[
    {"title": "Inception", "genre": "Sci-Fi", "release_year": 2010},
    {"title": "The Shawshank Redemption", "genre": "Drama", "release_year": 1994},
    {"title": "The Godfather", "genre": "Crime", "release_year": 1972},
    {"title": "Pulp Fiction", "genre": "Crime", "release_year": 1994},
    {"title": "Forrest Gump", "genre": "Drama", "release_year": 1994},
    {"title": "The Malayan Emergency began during the aftermath of the Second World War. As the British tried to repair the Malayan economy, the Malayan Communist Party, or MCP, was organizing protests against labor conditions in the country.[1] As the protests became more effective, the British responded with harsher measures. This in turn caused the protesters to become more militant, culminating in the beginning of organized violence with the assassination of three European plantation managers at Sungai Siput, Perak.[2]", "genre": "Drama", "release_year": 1994},
    {"title": "Kenya Cytlaly Cuevas Fuentes was born in 1973 in Mexico City by the Oceanía metro station.[4] She was raised by her maternal grandmother and alongside her siblings. Her mother had migrated to the United States and her father lived with another family.[5] Up until nine years of age, she faced abuse at the hands of her siblings. Her grandmother had passed away and there was no one to defend her. That same year, she left home and started sex work.[5] Wandering at night, she met a woman who she, at that time, did not realize was transgender. Instantly feeling a connection, she walked over and was told to get to work. She met her first client, explaining her situation and pleading to stay with him. He told her that she couldn't go with him, but he would pay for a week's worth of shelter and food.[5] The next day, she connected with the other trans women residing in the hotel. They taught her how to dress and she had, for the first time, felt comfortable in her body.[5]", "genre": "Drama", "release_year": 1994},
    {"title": "LDP announced in the following years that there were no youth branches and women's branches in the party due to the principles of not making age and gender discrimination in the administration.[12][13] However, the youth group called Genç Yunuslar (Young Dolphins) continues to exist even though it is not considered an official organization by LDP. Unlike other parties in Turkish politics, the party uses a humorous language on its official Twitter accounts. ", "genre": "Drama", "release_year": 1994},
    {"title": "Patronage on the line quickly reached double the railway's initial estimates, and by 1850 58 locomotives and 216 coaches were needed to handle the traffic. Goods traffic started in March 1842 and slowly increased, overtaking passenger revenue by 1855.[", "genre": "Drama", "release_year": 1994},
    {"title": "The film starts with Alex narrating his sad story. He is the scion of a large and rich Christian family, whose male members take pride in flaunting their virility. Due to his wayward life he lands up in prison. He makes attempts to flee from prison but in vain. A saviour appears before him in the form of Akbar Ali. Akbar Ali is from Lakshadweep, and circumstances make Alex follow him to the beautiful islands. The aftermath is the rest of the narration. ", "genre": "Drama", "release_year": 1994},
    {"title": "The Massachusetts State Government was originally scheduled to reimburse the Revere city government for 90% of the costs for the construction of what is the current Whelan school. In 2001 the Whelan project was put on the School Building Assistance program list. However the state delayed giving the funds. The Revere government waited for a three year period to acquire the funds. In February 2004, all of the members of the City of Revere City Council voted to have the current school campus built. Construction was scheduled to begin in June 2004. At that time the state government had not given the funds to the municipality", "genre": "Drama", "release_year": 1994},
    {"title": "A computer is a machine that manipulates data according to a set of instructions called a computer program.[15] The program has an executable form that the computer can use directly to execute the instructions. The same program in its human-readable source code form, enables a programmer to study and develop a sequence of steps known as an algorithm.[16] Because the instructions can be carried out in different types of computers, a single set of source instructions converts to machine instructions according to the CPU type.[17]", "genre": "Drama", "release_year": 1994}
]