[
  {
    "title": "Inside Out 2",
    "synopsis": "Teenager Riley's mind headquarters is undergoing a sudden demolition to make room for something entirely unexpected: new Emotions! Joy, Sadness, Anger, Fear and Disgust, who’ve long been running a successful operation by all accounts, aren’t sure how to feel when Anxiety shows up. And it looks like she’s not alone.",
    "genre": "Animation, Family, Drama, Adventure, Comedy",
    "release_year": "2024"
  },
  {
    "title": "Kingdom of the Planet of the Apes",
    "synopsis": "Several generations in the future following Caesar's reign, apes are now the dominant species and live harmoniously while humans have been reduced to living in the shadows. As a new tyrannical ape leader builds his empire, one young ape undertakes a harrowing journey that will cause him to question all that he has known about the past and to make choices that will define a future for apes and humans alike.",
    "genre": "Science Fiction, Adventure, Action",
    "release_year": "2024"
  },
  {
    "title": "Under Paris",
    "synopsis": "In the Summer of 2024, Paris is hosting the World Triathlon Championships on the Seine for the first time. Sophia, a brilliant scientist, learns from Mika, a young environmental activist, that a large shark is swimming deep in the river. To avoid a bloodbath at the heart of the city, they have no choice but to join forces with Adil, the Seine river police commander.",
    "genre": "Thriller, Horror, Action, Mystery",
    "release_year": "2024"
  },
  {
    "title": "Inside Out",
    "synopsis": "From an adventurous balloon ride above the clouds to a monster-filled metropolis, Academy Award®-winning director Pete Docter (“Monsters, Inc.,” “Up”) has taken audiences to unique and imaginative places. In Disney and Pixar’s original movie “ Inside Out,” he will take us to the most extraordinary location of all—inside the mind.",
    "genre": "Animation, Family, Adventure, Drama, Comedy",
    "release_year": "2015"
  },
  {
    "title": "Bad Boys: Ride or Die",
    "synopsis": "After their late former Captain is framed, Lowrey and Burnett try to clear his name, only to end up on the run themselves.",
    "genre": "Action, Crime, Thriller, Comedy",
    "release_year": "2024"
  },
  {
    "title": "Godzilla x Kong: The New Empire",
    "synopsis": "Following their explosive showdown, Godzilla and Kong must reunite against a colossal undiscovered threat hidden within our world, challenging their very existence – and our own.",
    "genre": "Science Fiction, Action, Adventure",
    "release_year": "2024"
  },
  {
    "title": "Civil War",
    "synopsis": "In the near future, a group of war journalists attempt to survive while reporting the truth as the United States stands on the brink of civil war.",
    "genre": "War, Action, Drama",
    "release_year": "2024"
  },
  {
    "title": "The Roundup: No Way Out",
    "synopsis": "Detective Ma Seok-do changes his affiliation from the Geumcheon Police Station to the Metropolitan Investigation Team, in order to eradicate Japanese gangsters who enter Korea to commit heinous crimes.",
    "genre": "Action, Crime, Comedy, Thriller",
    "release_year": "2023"
  },
  {
    "title": "The Last Kumite",
    "synopsis": "When Karate champion Michael Rivers wins the last tournament of his career, shady businessman Ron Hall offers him the opportunity to fight in an illegal Kumite in Bulgaria against the world’s best martial artists.  When Michael declines, Hall has his daughter kidnapped and, in order to rescue her, Rivers is left with no choice but to compete in the deadly tournament. Arriving in Bulgaria, he finds out that he is not the only fighter whose loved one was taken. Rivers enlists the help of trainers Master Loren, and Julie Jackson but will it be enough for him to win the tournament and save his daughter’s life?",
    "genre": "Action",
    "release_year": "2024"
  },
  {
    "title": "Atlas",
    "synopsis": "A brilliant counterterrorism analyst with a deep distrust of AI discovers it might be her only hope when a mission to capture a renegade robot goes awry.",
    "genre": "Science Fiction, Action",
    "release_year": "2024"
  },
  {
    "title": "The Watchers",
    "synopsis": "A young artist gets stranded in an extensive, immaculate forest in western Ireland, where, after finding shelter, she becomes trapped alongside three strangers, stalked by mysterious creatures each night.",
    "genre": "Horror, Mystery, Thriller",
    "release_year": "2024"
  },
  {
    "title": "Tarot",
    "synopsis": "When a group of friends recklessly violate the sacred rule of Tarot readings, they unknowingly unleash an unspeakable evil trapped within the cursed cards. One by one, they come face to face with fate and end up in a race against death.",
    "genre": "Horror",
    "release_year": "2024"
  },
  {
    "title": "Kung Fu Panda 4",
    "synopsis": "Po is gearing up to become the spiritual leader of his Valley of Peace, but also needs someone to take his place as Dragon Warrior. As such, he will train a new kung fu practitioner for the spot and will encounter a villain called the Chameleon who conjures villains from the past.",
    "genre": "Animation, Action, Family, Comedy, Fantasy",
    "release_year": "2024"
  },
  {
    "title": "Alienoid: Return to the Future",
    "synopsis": "Ean has a critical mission to return to the future to save everyone. However, she becomes trapped in the distant past while trying to prevent the escape of alien prisoners who are locked up in the bodies of humans. Meanwhile, Muruk, who helps Ean escape various predicaments, is unnerved when he begins sensing the presence of a strange being in his body. Traveling through the centuries, they are trying to prevent the explosion of the haava.",
    "genre": "Science Fiction, Action, Fantasy, Adventure",
    "release_year": "2024"
  },
  {
    "title": "The Fall Guy",
    "synopsis": "Fresh off an almost career-ending accident, stuntman Colt Seavers has to track down a missing movie star, solve a conspiracy and try to win back the love of his life while still doing his day job.",
    "genre": "Action, Comedy",
    "release_year": "2024"
  },
  {
    "title": "Bad Boys for Life",
    "synopsis": "Marcus and Mike are forced to confront new threats, career changes, and midlife crises as they join the newly created elite team AMMO of the Miami police department to take down the ruthless Armando Armas, the vicious leader of a Miami drug cartel.",
    "genre": "Thriller, Action, Crime",
    "release_year": "2020"
  },
  {
    "title": "Battle Over Britain",
    "synopsis": "A young pilot, fresh out of training, is called to join a Flight while they wait for the call to scramble. Throughout a single day, he witnesses the skies of southern England filled with deadly dog fights, and after every exhausting battle the men return to their dispersal hut, only to find another of their number missing. Unwilling to surrender, the pilot and his comrades unite to take to the skies once more, determined to defend not only the airfield, but their entire country.",
    "genre": "War",
    "release_year": "2023"
  },
  {
    "title": "Furiosa: A Mad Max Saga",
    "synopsis": "As the world fell, young Furiosa is snatched from the Green Place of Many Mothers and falls into the hands of a great Biker Horde led by the Warlord Dementus. Sweeping through the Wasteland they come across the Citadel presided over by The Immortan Joe. While the two Tyrants war for dominance, Furiosa must survive many trials as she puts together the means to find her way home.",
    "genre": "Action, Adventure, Science Fiction",
    "release_year": "2024"
  },
  {
    "title": "El Halcón: Sed de Venganza",
    "synopsis": "Criminals control Mexico and wrestling is now illegal. A retired fighter and a policewoman join forces to stop the perfidious criminal who has kidnapped her son.",
    "genre": "Action, Adventure, Comedy",
    "release_year": "2023"
  },
  {
    "title": "The Garfield Movie",
    "synopsis": "Garfield, the world-famous, Monday-hating, lasagna-loving indoor cat, is about to have a wild outdoor adventure! After an unexpected reunion with his long-lost father – scruffy street cat Vic – Garfield and his canine friend Odie are forced from their perfectly pampered life into joining Vic in a hilarious, high-stakes heist.",
    "genre": "Animation, Comedy, Family, Adventure",
    "release_year": "2024"
  },
  {
    "title": "Dune: Part Two",
    "synopsis": "Follow the mythic journey of Paul Atreides as he unites with Chani and the Fremen while on a path of revenge against the conspirators who destroyed his family. Facing a choice between the love of his life and the fate of the known universe, Paul endeavors to prevent a terrible future only he can foresee.",
    "genre": "Science Fiction, Adventure",
    "release_year": "2024"
  },
  {
    "title": "Top Gunner: Danger Zone",
    "synopsis": "An airliner filled with 800 passengers is forced to fly fast and low, above farmlands, suburbs and skyscraper-packed cities or the tons of explosives aboard will detonate. When an elite unit of US Air Force fighter jets is sent to provide escort, they find themselves facing a squadron of unidentifiable warplanes which ignites a deadly air battle that threatens to destroy all life above and below.",
    "genre": "Action, Thriller",
    "release_year": "2022"
  },
  {
    "title": "Hit Man",
    "synopsis": "A mild-mannered professor moonlighting as a fake hit man in police stings ignites a chain reaction of trouble when he falls for a potential client.",
    "genre": "Romance, Comedy, Crime",
    "release_year": "2024"
  },
  {
    "title": "Baki Hanma VS Kengan Ashura",
    "synopsis": "It's the ultimate showdown. The toughest fighters from \"Baki Hanma\" and \"Kengan Ashura\" clash in this unprecedented, hard-hitting martial arts crossover.",
    "genre": "Animation, Action",
    "release_year": "2024"
  },
  {
    "title": "El Halcón: Sed de Venganza",
    "synopsis": "Criminals control Mexico and wrestling is now illegal. A retired fighter and a policewoman join forces to stop the perfidious criminal who has kidnapped her son.",
    "genre": "Action, Adventure, Comedy",
    "release_year": "2023"
  },
  {
    "title": "The Garfield Movie",
    "synopsis": "Garfield, the world-famous, Monday-hating, lasagna-loving indoor cat, is about to have a wild outdoor adventure! After an unexpected reunion with his long-lost father – scruffy street cat Vic – Garfield and his canine friend Odie are forced from their perfectly pampered life into joining Vic in a hilarious, high-stakes heist.",
    "genre": "Animation, Comedy, Family, Adventure",
    "release_year": "2024"
  },
  {
    "title": "Godzilla Minus One",
    "synopsis": "In postwar Japan, Godzilla brings new devastation to an already scorched landscape. With no military intervention or government help in sight, the survivors must join together in the face of despair and fight back against an unrelenting horror.",
    "genre": "Science Fiction, Horror, Action",
    "release_year": "2023"
  },
  {
    "title": "Migration",
    "synopsis": "After a migrating duck family alights on their pond with thrilling tales of far-flung places, the Mallard family embarks on a family road trip, from New England, to New York City, to tropical Jamaica.",
    "genre": "Animation, Action, Adventure, Comedy, Family",
    "release_year": "2023"
  },
  {
    "title": "Miraculous World: Paris, Tales of Shadybug and Claw Noir",
    "synopsis": "Miraculous holders from another world appear in Paris. They come from a parallel universe where everything is reversed: the holders of Ladybug and Black Cat Miraculouses, Shadybug and Claw Noir, are the bad guys, and the holder of the Butterfly Miraculous, Hesperia, is a superhero. Ladybug and Cat Noir will have to help Hesperia counter the attacks of their evil doubles and prevent them from seizing the Butterfly's Miraculous. Can our heroes also help Hesperia make Shadybug and Claw Noir better people?",
    "genre": "Animation, Adventure, Action, Fantasy, Family",
    "release_year": "2023"
  },
  {
    "title": "Un père idéal",
    "synopsis": "",
    "genre": "Drama, TV Movie",
    "release_year": "2024"
  },
  {
    "title": "No Way Up",
    "synopsis": "Characters from different backgrounds are thrown together when the plane they're travelling on crashes into the Pacific Ocean. A nightmare fight for survival ensues with the air supply running out and dangers creeping in from all sides.",
    "genre": "Action, Horror, Thriller",
    "release_year": "2024"
  },
  {
    "title": "Oppenheimer",
    "synopsis": "The story of J. Robert Oppenheimer's role in the development of the atomic bomb during World War II.",
    "genre": "Drama, History",
    "release_year": "2023"
  },
  {
    "title": "Bad Boys",
    "synopsis": "Marcus Burnett is a henpecked family man. Mike Lowry is a footloose and fancy free ladies' man. Both Miami policemen, they have 72 hours to reclaim a consignment of drugs stolen from under their station's nose. To complicate matters, in order to get the assistance of the sole witness to a murder, they have to pretend to be each other.",
    "genre": "Action, Comedy, Crime, Thriller",
    "release_year": "1995"
  },
  {
    "title": "Fast X",
    "synopsis": "Over many missions and against impossible odds, Dom Toretto and his family have outsmarted, out-nerved and outdriven every foe in their path. Now, they confront the most lethal opponent they've ever faced: A terrifying threat emerging from the shadows of the past who's fueled by blood revenge, and who is determined to shatter this family and destroy everything—and everyone—that Dom loves, forever.",
    "genre": "Action, Crime, Thriller",
    "release_year": "2023"
  },
  {
    "title": "IF",
    "synopsis": "A young girl who goes through a difficult experience begins to see everyone's imaginary friends who have been left behind as their real-life friends have grown up.",
    "genre": "Comedy, Fantasy, Family",
    "release_year": "2024"
  },
  {
    "title": "Noryang: Deadly Sea",
    "synopsis": "The Imjin War reaches its seventh year in December of 1598. Admiral Yi Sun-shin learns that the Wa invaders in Joseon are preparing for a swift withdrawal following the deathbed orders of their leader Toyotomi Hideyoshi. Determined to destroy the enemy once and for all, Admiral Yi leads an allied fleet of Joseon and Ming ships to mount a blockade and annihilate the Wa army. However, once Ming commander Chen Lin is bribed into lifting the blockade, Wa lord Shimazu Yoshihiro and his Satsuma army sail to the Wa army’s rescue at Noryang Strait.",
    "genre": "Action, History, Drama, War",
    "release_year": "2023"
  },
  {
    "title": "The Batman",
    "synopsis": "In his second year of fighting crime, Batman uncovers corruption in Gotham City that connects to his own family while facing a serial killer known as the Riddler.",
    "genre": "Crime, Mystery, Thriller",
    "release_year": "2022"
  },
  {
    "title": "Immaculate",
    "synopsis": "An American nun embarks on a new journey when she joins a remote convent in the Italian countryside. However, her warm welcome quickly turns into a living nightmare when she discovers her new home harbours a sinister secret and unspeakable horrors.",
    "genre": "Horror, Mystery, Thriller",
    "release_year": "2024"
  },
  {
    "title": "The Legend of Catclaws Mountain",
    "synopsis": "Mindy adopts Angel, a high-spirited pony that—according to legend—will lead its owner to gold hidden in the nearby mountains. When Angel is kidnapped by a mad treasure hunter, Mindy and her school friends head into the hills to rescue the pony and hunt for the lost gold. But Mindy meets a mountain man that warns her the treasure is part of an ancient curse—if they remove the gold, they'll destroy the beautiful forest.",
    "genre": "Fantasy, Family",
    "release_year": "2024"
  },
  {
    "title": "The Terminator",
    "synopsis": "In the post-apocalyptic future, reigning tyrannical supercomputers teleport a cyborg assassin known as the \"Terminator\" back to 1984 to kill Sarah Connor, whose unborn son is destined to lead insurgents against 21st century mechanical hegemony. Meanwhile, the human-resistance movement dispatches a lone warrior to safeguard Sarah. Can he stop the virtually indestructible killing machine?",
    "genre": "Action, Thriller, Science Fiction",
    "release_year": "1984"
  },
  {
    "title": "May the 12th Be with You",
    "synopsis": "It's Mother's Day and Marge Simpson joins the moms of Disney+ on a special holiday outing that turns into an epic galactic adventure filled with heroes, villains, and Stewie from Family Guy.",
    "genre": "Animation, Comedy",
    "release_year": "2024"
  },
  {
    "title": "Ape vs Mecha Ape",
    "synopsis": "Recognizing the destructive power of its captive giant Ape, the military makes its own battle-ready A.I., Mecha Ape. But its first practical test goes horribly wrong, leaving the military no choice but to release the imprisoned giant ape to stop the colossal robot before it destroys downtown Chicago.",
    "genre": "Action, Science Fiction",
    "release_year": "2023"
  },
  {
    "title": "Despicable Me 4",
    "synopsis": "Gru and Lucy and their girls — Margo, Edith and Agnes — welcome a new member to the Gru family, Gru Jr., who is intent on tormenting his dad. Gru faces a new nemesis in Maxime Le Mal and his femme fatale girlfriend Valentina, and the family is forced to go on the run.",
    "genre": "Animation, Family, Comedy, Action",
    "release_year": "2024"
  },
  {
    "title": "Alienoid",
    "synopsis": "Gurus in the late Goryeo dynasty try to obtain a fabled, holy sword, and humans in 2022 hunt down an alien prisoner that is locked in a human's body. The two parties cross paths when a time-traveling portal opens up.",
    "genre": "Science Fiction, Action, Fantasy, Adventure",
    "release_year": "2022"
  },
  {
    "title": "4 Horsemen: Apocalypse",
    "synopsis": "A small team of scientists must race against time to stop what seems to be a cascade of global disasters signaling the possible apocalypse and end of days.",
    "genre": "Science Fiction, Horror",
    "release_year": "2022"
  },
  {
    "title": "Thelma the Unicorn",
    "synopsis": "Thelma dreams of being a glamorous unicorn. Then in a rare pink and glitter-filled moment of fate, Thelma's wish comes true. She rises to instant international stardom, but at an unexpected cost. After a while, Thelma realizes that she was happier as her ordinary, sparkle-free self. So she ditches her horn, scrubs off her sparkles, and returns home, where her best friend is waiting for her with a hug.",
    "genre": "Animation, Fantasy, Family",
    "release_year": "2024"
  },
  {
    "title": "Mobile Suit Gundam SEED FREEDOM",
    "synopsis": "In C.E.75, the fighting still continues. There are independence movements, and aggression by Blue Cosmos... In order to calm the situation, a global peace monitoring agency called COMPASS is established, with Lacus as its first president. As members of COMPASS, Kira and his comrades intervene into various regional battles. Then a newly established nation called Foundation proposes a joint operation against a Blue Cosmos stronghold.",
    "genre": "Animation, Science Fiction, Action, Drama",
    "release_year": "2024"
  },
  {
    "title": "Madame Web",
    "synopsis": "Forced to confront revelations about her past, paramedic Cassandra Webb forges a relationship with three young women destined for powerful futures...if they can all survive a deadly present.",
    "genre": "Action, Fantasy",
    "release_year": "2024"
  },
  {
    "title": "Space Pups",
    "synopsis": "Two young children and their parents help a trio of aliens transformed as friendly dogs to escape the clutches of a local UFO hunter as they repair their spaceship.",
    "genre": "Adventure, Family, Science Fiction",
    "release_year": "2023"
  },
  {
    "title": "Checkmates",
    "synopsis": "Candela, the headmistress of an elite school, after a traumatic divorce, returns to her old high school to lead a group of rebellious students through chess. There she will learn that in chess, and in life, it doesn't matter if you are a king or a pawn, because everyone ends up in the same box.",
    "genre": "Comedy",
    "release_year": "2024"
  },
  {
    "title": "Monster's Battlefield",
    "synopsis": "The soldier king Qin Yang's fiancée Ye Qin met with an unknown beast and died tragically. Gu Ping invites him to participate in Ye Qin's scientific research before her death. But Gu Ping is using Ye Qin's research results to combine the genes of unknown beasts to create the \"Zero\" dragon creature. The intelligent dragon creature, coupled with the extra-terrestrial beast evolved by devouring,  an imminent city war is coming...",
    "genre": "Science Fiction",
    "release_year": "2021"
  },
  {
    "title": "X",
    "synopsis": "In 1979, a group of young filmmakers set out to make an adult film in rural Texas, but when their reclusive, elderly hosts catch them in the act, the cast find themselves fighting for their lives.",
    "genre": "Horror, Thriller, Mystery",
    "release_year": "2022"
  },
  {
    "title": "Chief of Station",
    "synopsis": "After learning that the death of his wife was not an accident, a former CIA Station Chief is forced back into the espionage underworld, teaming up with an adversary to unravel a conspiracy that challenges everything he thought he knew.",
    "genre": "Action, Thriller",
    "release_year": "2024"
  },
  {
    "title": "Black Lotus",
    "synopsis": "An ex-special forces operative wages a one man war through the streets of Amsterdam to rescue his friend's daughter from the local crime syndicate.",
    "genre": "Action, Crime, Mystery, Thriller",
    "release_year": "2023"
  },
  {
    "title": "Road House",
    "synopsis": "Ex-UFC fighter Dalton takes a job as a bouncer at a Florida Keys roadhouse, only to discover that this paradise is not all it seems.",
    "genre": "Action, Thriller",
    "release_year": "2024"
  },
  {
    "title": "Ultraman: Rising",
    "synopsis": "With Tokyo under attack from kaiju, Ultraman discovers his greatest challenge isn’t fighting giant monsters - it’s raising one.",
    "genre": "Animation, Science Fiction, Family, Action",
    "release_year": "2024"
  },
  {
    "title": "The Batman",
    "synopsis": "In his second year of fighting crime, Batman uncovers corruption in Gotham City that connects to his own family while facing a serial killer known as the Riddler.",
    "genre": "Crime, Mystery, Thriller",
    "release_year": "2022"
  },
  {
    "title": "Dune",
    "synopsis": "Paul Atreides, a brilliant and gifted young man born into a great destiny beyond his understanding, must travel to the most dangerous planet in the universe to ensure the future of his family and his people. As malevolent forces explode into conflict over the planet's exclusive supply of the most precious resource in existence-a commodity capable of unlocking humanity's greatest potential-only those who can conquer their fear will survive.",
    "genre": "Science Fiction, Adventure",
    "release_year": "2021"
  },
  {
    "title": "xXx",
    "synopsis": "Xander Cage is your standard adrenaline junkie with no fear and a lousy attitude. When the US Government \"recruits\" him to go on a mission, he's not exactly thrilled. His mission: to gather information on an organization that may just be planning the destruction of the world, led by the nihilistic Yorgi.",
    "genre": "Action, Adventure, Thriller, Crime",
    "release_year": "2002"
  },
  {
    "title": "Rebel Moon - Part Two: The Scargiver",
    "synopsis": "The rebels gear up for battle against the ruthless forces of the Motherworld as unbreakable bonds are forged, heroes emerge — and legends are made.",
    "genre": "Science Fiction, Action, Drama",
    "release_year": "2024"
  },
  {
    "title": "Kali: Avenging Angel",
    "synopsis": "Lisa, aka Kali, who has nothing left to lose when she finds out her husband has been executed in Rio to cover up a corruption scandal. A former Special Forces recruit, she heads to Brazil with fists, blood and explosives, to Know the truth",
    "genre": "Action, Thriller, Adventure",
    "release_year": "2024"
  },
  {
    "title": "Am I OK?",
    "synopsis": "Lucy and Jane have been best friends for most of their lives and think they know everything there is to know about each other. But when Jane announces she's moving to London, Lucy reveals a long-held secret. As Jane tries to help Lucy, their friendship is thrown into chaos.",
    "genre": "Drama, Comedy, Romance",
    "release_year": "2024"
  },
  {
    "title": "The Wages of Fear",
    "synopsis": "When an explosion at an oil well threatens hundreds of lives, a crack team is called upon to make a deadly desert crossing with nitroglycerine in tow.",
    "genre": "Action, Thriller",
    "release_year": "2024"
  },
  {
    "title": "Breathe",
    "synopsis": "Air-supply is scarce in the near future, forcing a mother and daughter to fight for survival when two strangers arrive desperate for an oxygenated haven.",
    "genre": "Science Fiction, Mystery, Thriller",
    "release_year": "2024"
  },
  {
    "title": "Tenet",
    "synopsis": "Armed with only one word - Tenet - and fighting for the survival of the entire world, the Protagonist journeys through a twilight world of international espionage on a mission that will unfold in something beyond real time.",
    "genre": "Action, Thriller, Science Fiction",
    "release_year": "2020"
  },
  {
    "title": "Thor: Ragnarok",
    "synopsis": "Thor is imprisoned on the other side of the universe and finds himself in a race against time to get back to Asgard to stop Ragnarok, the destruction of his home-world and the end of Asgardian civilization, at the hands of a powerful new threat, the ruthless Hela.",
    "genre": "Action, Adventure, Science Fiction",
    "release_year": "2017"
  },
  {
    "title": "Barbie",
    "synopsis": "Barbie and Ken are having the time of their lives in the colorful and seemingly perfect world of Barbie Land. However, when they get a chance to go to the real world, they soon discover the joys and perils of living among humans.",
    "genre": "Comedy, Adventure",
    "release_year": "2023"
  },
  {
    "title": "The Flash",
    "synopsis": "When his attempt to save his family inadvertently alters the future, Barry Allen becomes trapped in a reality in which General Zod has returned and there are no Super Heroes to turn to. In order to save the world that he is in and return to the future that he knows, Barry's only hope is to race for his life. But will making the ultimate sacrifice be enough to reset the universe?",
    "genre": "Action, Adventure, Science Fiction",
    "release_year": "2023"
  },
  {
    "title": "Megamind vs. the Doom Syndicate",
    "synopsis": "Megamind's former villain team, The Doom Syndicate, has returned. Our newly crowned blue hero must now keep up evil appearances until he can assemble his friends (Roxanne, Ol' Chum and Keiko) to stop his former evil teammates from launching Metro City to the Moon.",
    "genre": "Animation, Comedy, Science Fiction",
    "release_year": "2024"
  },
  {
    "title": "The Terminator",
    "synopsis": "In the post-apocalyptic future, reigning tyrannical supercomputers teleport a cyborg assassin known as the \"Terminator\" back to 1984 to kill Sarah Connor, whose unborn son is destined to lead insurgents against 21st century mechanical hegemony. Meanwhile, the human-resistance movement dispatches a lone warrior to safeguard Sarah. Can he stop the virtually indestructible killing machine?",
    "genre": "Action, Thriller, Science Fiction",
    "release_year": "1984"
  },
  {
    "title": "Ghostbusters: Frozen Empire",
    "synopsis": "When the discovery of an ancient artifact unleashes an evil force, Ghostbusters new and old must join forces to protect their home and save the world from a second Ice Age.",
    "genre": "Fantasy, Adventure, Comedy",
    "release_year": "2024"
  },
  {
    "title": "My Fault",
    "synopsis": "Noah must leave her city, boyfriend, and friends to move into William Leister's mansion, the flashy and wealthy husband of her mother Rafaela. As a proud and independent 17 year old, Noah resists living in a mansion surrounded by luxury. However, it is there where she meets Nick, her new stepbrother, and the clash of their strong personalities becomes evident from the very beginning.",
    "genre": "Drama, Romance",
    "release_year": "2023"
  },
  {
    "title": "Turning Red",
    "synopsis": "Thirteen-year-old Mei is experiencing the awkwardness of being a teenager with a twist – when she gets too excited, she transforms into a giant red panda.",
    "genre": "Animation, Family, Comedy, Fantasy",
    "release_year": "2022"
  },
  {
    "title": "Wonka",
    "synopsis": "Willy Wonka – chock-full of ideas and determined to change the world one delectable bite at a time – is proof that the best things in life begin with a dream, and if you’re lucky enough to meet Willy Wonka, anything is possible.",
    "genre": "Comedy, Family, Fantasy",
    "release_year": "2023"
  },
  {
    "title": "The Idea of You",
    "synopsis": "Solène, a 40-year-old single mom, begins an unexpected romance with 24-year-old Hayes Campbell, the lead singer of August Moon, the hottest boy band on the planet. When Solène must step in to chaperone her teenage daughter's trip to the Coachella Music Festival after her ex bails at the last minute, she has a chance encounter with Hayes and there is an instant, undeniable spark. As they begin a whirlwind romance, it isn't long before Hayes' superstar status poses unavoidable challenges to their relationship, and Solène soon discovers that life in the glare of his spotlight might be more than she bargained for.",
    "genre": "Romance, Comedy, Drama",
    "release_year": "2024"
  },
  {
    "title": "Alien",
    "synopsis": "During its return to the earth, commercial spaceship Nostromo intercepts a distress signal from a distant planet. When a three-member team of the crew discovers a chamber containing thousands of eggs on the planet, a creature inside one of the eggs attacks an explorer. The entire crew is unaware of the impending nightmare set to descend upon them when the alien parasite planted inside its unfortunate host is birthed.",
    "genre": "Horror, Science Fiction",
    "release_year": "1979"
  },
  {
    "title": "Sisid Marino",
    "synopsis": "A married couple falls into depression after the death of their child. They turn to sex as a coping mechanism, but poverty takes its toll on them.",
    "genre": "Drama",
    "release_year": "2024"
  },
  {
    "title": "Silence of the Prey",
    "synopsis": "In a desperate bid to secure a future for her child, an undocumented immigrant mother takes a caretaker job. Unbeknownst to her, the elderly man conceals a horrifying truth.",
    "genre": "Horror, Thriller",
    "release_year": "2024"
  },
  {
    "title": "Deadpool",
    "synopsis": "The origin story of former Special Forces operative turned mercenary Wade Wilson, who, after being subjected to a rogue experiment that leaves him with accelerated healing powers, adopts the alter ego Deadpool. Armed with his new abilities and a dark, twisted sense of humor, Deadpool hunts down the man who nearly destroyed his life.",
    "genre": "Action, Adventure, Comedy",
    "release_year": "2016"
  },
  {
    "title": "Deadpool & Wolverine",
    "synopsis": "A listless Wade Wilson toils away in civilian life with his days as the morally flexible mercenary, Deadpool, behind him. But when his homeworld faces an existential threat, Wade must reluctantly suit-up again with an even more reluctant Wolverine.",
    "genre": "Science Fiction, Action, Comedy",
    "release_year": "2024"
  },
  {
    "title": "Sting",
    "synopsis": "After raising an unnervingly talented spider in secret, 12-year-old Charlotte must face the truth about her pet and fight for her family's survival.",
    "genre": "Horror, Thriller",
    "release_year": "2024"
  },
  {
    "title": "The Matrix",
    "synopsis": "Set in the 22nd century, The Matrix tells the story of a computer hacker who joins a group of underground insurgents fighting the vast and powerful computers who now rule the earth.",
    "genre": "Action, Science Fiction",
    "release_year": "1999"
  },
  {
    "title": "Hachiko",
    "synopsis": "This is the story of a puppy that touched hundreds of millions of people around the world. Hachiko is a cute Chinese pastoral dog. He met his destined owner Chen Jingxiu in the vast crowd and became a member of the Chen family. With the passage of time, the once beautiful home is no longer there, but Batong is still waiting where it is, and its fate is closely tied to its family.",
    "genre": "Drama, Family",
    "release_year": "2023"
  },
  {
    "title": "Abigail",
    "synopsis": "A group of criminals kidnaps a teenage ballet dancer, the daughter of a notorious gang leader, in order to obtain a ransom of $50 million, but over time, they discover that she is not just an ordinary girl. After the kidnappers begin to diminish, one by one, they discover, to their increasing horror, that they are locked inside with an unusual girl.",
    "genre": "Horror, Comedy",
    "release_year": "2024"
  },
  {
    "title": "Anyone But You",
    "synopsis": "After an amazing first date, Bea and Ben’s fiery attraction turns ice cold — until they find themselves unexpectedly reunited at a destination wedding in Australia. So they do what any two mature adults would do: pretend to be a couple.",
    "genre": "Romance, Comedy",
    "release_year": "2023"
  },
  {
    "title": "Wish",
    "synopsis": "Asha, a sharp-witted idealist, makes a wish so powerful that it is answered by a cosmic force – a little ball of boundless energy called Star. Together, Asha and Star confront a most formidable foe - the ruler of Rosas, King Magnifico - to save her community and prove that when the will of one courageous human connects with the magic of the stars, wondrous things can happen.",
    "genre": "Animation, Family, Fantasy, Adventure",
    "release_year": "2023"
  },
  {
    "title": "The Promised Neverland",
    "synopsis": "A number of children are being well fed, taken care of, and pampered at a very meticulate and managed orphanage. The facility and grounds are impressive, but the wall acting as a barrier is high. There is a secret to the place and once revealed to several orphans, they're desperate to escape.",
    "genre": "Action, Fantasy, Mystery, Adventure, Thriller",
    "release_year": "2020"
  },
  {
    "title": "Joker",
    "synopsis": "During the 1980s, a failed stand-up comedian is driven insane and turns to a life of crime and chaos in Gotham City while becoming an infamous psychopathic crime figure.",
    "genre": "Crime, Thriller, Drama",
    "release_year": "2019"
  },
  {
    "title": "Damaged",
    "synopsis": "A Chicago detective travels to Scotland after an emerging serial killer’s crimes match those that he investigated five years earlier, one of which was the crime scene of his murdered girlfriend.",
    "genre": "Action, Crime, Thriller",
    "release_year": "2024"
  },
  {
    "title": "Spitfire Over Berlin",
    "synopsis": "August 1944. With the American Eighth Air Force poised to strike over Nazi Germany, British Intelligence learns that they could be flying into a deadly trap. With only hours to spare, Flight Lieutenant Edward Barnes must fly a life and death mission over Berlin in his unarmed Spitfire to obtain photographic evidence and save the lives of 1200 men.",
    "genre": "War, Action, History",
    "release_year": "2022"
  },
  {
    "title": "Mercy",
    "synopsis": "An ex-military doctor finds herself in a deadly battle for survival when the Irish mafia seize control of the hospital at which she works. When her son is taken hostage, she is forced to rely upon her battle-hardened past and lethal skills after realizing there’s no one left to save the day but her.",
    "genre": "Action, Mystery, Thriller",
    "release_year": "2023"
  },
  {
    "title": "Slyth: The Hunt Saga",
    "synopsis": "After a deadly forest fire sweeps the earth and fills the air with pollutants, society is on the brink of collapse and riddled with disease. The only hope seems to be in a legend come to life: that of the Slyth, a reptilian species that can disguise themselves as humans and possesses blood that can cure disease. The hunt is on.",
    "genre": "Action, Science Fiction, Thriller, Romance",
    "release_year": "2023"
  },
  {
    "title": "After the Pandemic",
    "synopsis": "Set in a post-apocalyptic world where a global airborne pandemic has wiped out 90% of the Earth's population and only the young and immune have endured as scavengers. For Ellie and Quinn, the daily challenges to stay alive are compounded when they become hunted by the merciless Stalkers.",
    "genre": "Science Fiction, Action",
    "release_year": "2022"
  },
  {
    "title": "The Marvels",
    "synopsis": "Carol Danvers, aka Captain Marvel, has reclaimed her identity from the tyrannical Kree and taken revenge on the Supreme Intelligence. But unintended consequences see Carol shouldering the burden of a destabilized universe. When her duties send her to an anomalous wormhole linked to a Kree revolutionary, her powers become entangled with that of Jersey City super-fan Kamala Khan, aka Ms. Marvel, and Carol’s estranged niece, now S.A.B.E.R. astronaut Captain Monica Rambeau. Together, this unlikely trio must team up and learn to work in concert to save the universe.",
    "genre": "Science Fiction, Adventure, Action",
    "release_year": "2023"
  },
  {
    "title": "Elemental",
    "synopsis": "In a city where fire, water, land and air residents live together, a fiery young woman and a go-with-the-flow guy will discover something elemental: how much they have in common.",
    "genre": "Animation, Comedy, Family, Fantasy, Romance",
    "release_year": "2023"
  },
  {
    "title": "Logan",
    "synopsis": "In the near future, a weary Logan cares for an ailing Professor X in a hideout on the Mexican border. But Logan's attempts to hide from the world and his legacy are upended when a young mutant arrives, pursued by dark forces.",
    "genre": "Action, Drama, Science Fiction",
    "release_year": "2017"
  },
  {
    "title": "Iron Man 2",
    "synopsis": "With the world now aware of his dual life as the armored superhero Iron Man, billionaire inventor Tony Stark faces pressure from the government, the press and the public to share his technology with the military. Unwilling to let go of his invention, Stark, with Pepper Potts and James 'Rhodey' Rhodes at his side, must forge new alliances – and confront powerful enemies.",
    "genre": "Adventure, Action, Science Fiction",
    "release_year": "2010"
  },
  {
    "title": "The Super Mario Bros. Movie",
    "synopsis": "While working underground to fix a water main, Brooklyn plumbers—and brothers—Mario and Luigi are transported down a mysterious pipe and wander into a magical new world. But when the brothers are separated, Mario embarks on an epic quest to find Luigi.",
    "genre": "Animation, Family, Adventure, Fantasy, Comedy",
    "release_year": "2023"
  },
  {
    "title": "Black Panther",
    "synopsis": "King T'Challa returns home to the reclusive, technologically advanced African nation of Wakanda to serve as his country's new leader. However, T'Challa soon finds that he is challenged for the throne by factions within his own country as well as without. Using powers reserved to Wakandan kings, T'Challa assumes the Black Panther mantle to join with ex-girlfriend Nakia, the queen-mother, his princess-kid sister, members of the Dora Milaje (the Wakandan 'special forces') and an American secret agent, to prevent Wakanda from being dragged into a world war.",
    "genre": "Action, Adventure, Science Fiction",
    "release_year": "2018"
  },
  {
    "title": "Star Wars",
    "synopsis": "Princess Leia is captured and held hostage by the evil Imperial forces in their effort to take over the galactic Empire. Venturesome Luke Skywalker and dashing captain Han Solo team together with the loveable robot duo R2-D2 and C-3PO to rescue the beautiful princess and restore peace and justice in the Empire.",
    "genre": "Adventure, Action, Science Fiction",
    "release_year": "1977"
  },
  {
    "title": "The Idea of You",
    "synopsis": "Solène, a 40-year-old single mom, begins an unexpected romance with 24-year-old Hayes Campbell, the lead singer of August Moon, the hottest boy band on the planet. When Solène must step in to chaperone her teenage daughter's trip to the Coachella Music Festival after her ex bails at the last minute, she has a chance encounter with Hayes and there is an instant, undeniable spark. As they begin a whirlwind romance, it isn't long before Hayes' superstar status poses unavoidable challenges to their relationship, and Solène soon discovers that life in the glare of his spotlight might be more than she bargained for.",
    "genre": "Romance, Comedy, Drama",
    "release_year": "2024"
  },
  {
    "title": "Superman",
    "synopsis": "Mild-mannered Clark Kent works as a reporter at the Daily Planet alongside his crush, Lois Lane. Clark must summon his superhero alter-ego when the nefarious Lex Luthor launches a plan to take over the world.",
    "genre": "Science Fiction, Action, Adventure",
    "release_year": "1978"
  },
  {
    "title": "Wish",
    "synopsis": "Asha, a sharp-witted idealist, makes a wish so powerful that it is answered by a cosmic force – a little ball of boundless energy called Star. Together, Asha and Star confront a most formidable foe - the ruler of Rosas, King Magnifico - to save her community and prove that when the will of one courageous human connects with the magic of the stars, wondrous things can happen.",
    "genre": "Animation, Family, Fantasy, Adventure",
    "release_year": "2023"
  },
  {
    "title": "Becoming",
    "synopsis": "Join former first lady Michelle Obama in an intimate documentary looking at her life, hopes and connection with others.",
    "genre": "Documentary",
    "release_year": "2020"
  },
  {
    "title": "Split",
    "synopsis": "Though Kevin has evidenced 23 personalities to his trusted psychiatrist, Dr. Fletcher, there remains one still submerged who is set to materialize and dominate all the others. Compelled to abduct three teenage girls led by the willful, observant Casey, Kevin reaches a war for survival among all of those contained within him — as well as everyone around him — as the walls between his compartments shatter apart.",
    "genre": "Horror, Thriller",
    "release_year": "2017"
  },
  {
    "title": "The Promised Neverland",
    "synopsis": "A number of children are being well fed, taken care of, and pampered at a very meticulate and managed orphanage. The facility and grounds are impressive, but the wall acting as a barrier is high. There is a secret to the place and once revealed to several orphans, they're desperate to escape.",
    "genre": "Action, Fantasy, Mystery, Adventure, Thriller",
    "release_year": "2020"
  },
  {
    "title": "Baywatch",
    "synopsis": "Devoted lifeguard Mitch Buchannon butts heads with a brash new recruit. Together, they uncover a local criminal plot that threatens the future of the Bay.",
    "genre": "Comedy, Action, Crime",
    "release_year": "2017"
  },
  {
    "title": "Silence of the Prey",
    "synopsis": "In a desperate bid to secure a future for her child, an undocumented immigrant mother takes a caretaker job. Unbeknownst to her, the elderly man conceals a horrifying truth.",
    "genre": "Horror, Thriller",
    "release_year": "2024"
  },
  {
    "title": "Gifted",
    "synopsis": "Frank, a single man raising his child prodigy niece Mary, is drawn into a custody battle with his mother.",
    "genre": "Drama, Comedy",
    "release_year": "2017"
  },
  {
    "title": "Elemental",
    "synopsis": "In a city where fire, water, land and air residents live together, a fiery young woman and a go-with-the-flow guy will discover something elemental: how much they have in common.",
    "genre": "Animation, Comedy, Family, Fantasy, Romance",
    "release_year": "2023"
  },
  {
    "title": "Venom",
    "synopsis": "Investigative journalist Eddie Brock attempts a comeback following a scandal, but accidentally becomes the host of Venom, a violent, super powerful alien symbiote. Soon, he must rely on his newfound powers to protect the world from a shadowy organization looking for a symbiote of their own.",
    "genre": "Science Fiction, Action",
    "release_year": "2018"
  },
  {
    "title": "The Marvels",
    "synopsis": "Carol Danvers, aka Captain Marvel, has reclaimed her identity from the tyrannical Kree and taken revenge on the Supreme Intelligence. But unintended consequences see Carol shouldering the burden of a destabilized universe. When her duties send her to an anomalous wormhole linked to a Kree revolutionary, her powers become entangled with that of Jersey City super-fan Kamala Khan, aka Ms. Marvel, and Carol’s estranged niece, now S.A.B.E.R. astronaut Captain Monica Rambeau. Together, this unlikely trio must team up and learn to work in concert to save the universe.",
    "genre": "Science Fiction, Adventure, Action",
    "release_year": "2023"
  },
  {
    "title": "Dark Phoenix",
    "synopsis": "The X-Men face their most formidable and powerful foe when one of their own, Jean Grey, starts to spiral out of control. During a rescue mission in outer space, Jean is nearly killed when she's hit by a mysterious cosmic force. Once she returns home, this force not only makes her infinitely more powerful, but far more unstable. The X-Men must now band together to save her soul and battle aliens that want to use Grey's new abilities to rule the galaxy.",
    "genre": "Science Fiction, Action, Adventure",
    "release_year": "2019"
  },
  {
    "title": "RoboCop",
    "synopsis": "In a violent, near-apocalyptic Detroit, evil corporation Omni Consumer Products wins a contract from the city government to privatize the police force. To test their crime-eradicating cyborgs, the company leads street cop Alex Murphy into an armed confrontation with crime lord Boddicker so they can use his body to support their untested RoboCop prototype. But when RoboCop learns of the company's nefarious plans, he turns on his masters.",
    "genre": "Action, Thriller, Science Fiction",
    "release_year": "1987"
  },
  {
    "title": "Inception",
    "synopsis": "Cobb, a skilled thief who commits corporate espionage by infiltrating the subconscious of his targets is offered a chance to regain his old life as payment for a task considered to be impossible: \"inception\", the implantation of another person's idea into a target's subconscious.",
    "genre": "Action, Science Fiction, Adventure",
    "release_year": "2010"
  },
  {
    "title": "Morbius",
    "synopsis": "Dangerously ill with a rare blood disorder, and determined to save others suffering his same fate, Dr. Michael Morbius attempts a desperate gamble. What at first appears to be a radical success soon reveals itself to be a remedy potentially worse than the disease.",
    "genre": "Action, Science Fiction, Fantasy",
    "release_year": "2022"
  },
  {
    "title": "Citizen Kane",
    "synopsis": "Newspaper magnate Charles Foster Kane is taken from his mother as a boy and made the ward of a rich industrialist. As a result, every well-meaning, tyrannical or self-destructive move he makes for the rest of his life appears in some way to be a reaction to that deeply wounding event.",
    "genre": "Mystery, Drama",
    "release_year": "1941"
  },
  {
    "title": "Doctor Strange",
    "synopsis": "After his career is destroyed, a brilliant but arrogant surgeon gets a new lease on life when a sorcerer takes him under her wing and trains him to defend the world against evil.",
    "genre": "Action, Adventure, Fantasy",
    "release_year": "2016"
  },
  {
    "title": "Spectre",
    "synopsis": "A cryptic message from Bond’s past sends him on a trail to uncover a sinister organization. While M battles political forces to keep the secret service alive, Bond peels back the layers of deceit to reveal the terrible truth behind SPECTRE.",
    "genre": "Action, Adventure, Thriller",
    "release_year": "2015"
  },
  {
    "title": "Babylon",
    "synopsis": "A tale of outsized ambition and outrageous excess, tracing the rise and fall of multiple characters in an era of unbridled decadence and depravity during Hollywood's transition from silent films to sound films in the late 1920s.",
    "genre": "Drama, Comedy",
    "release_year": "2022"
  },
  {
    "title": "Emmanuelle 6",
    "synopsis": "Journey with Emmanuelle and the world's most excuisite models deep into the Amazon jungle to the heart of paradise. Beauty can be dangerous and the women soon find themselves captive to a powerful drug lord. Now they must escape from a land of darkness",
    "genre": "Drama, Romance",
    "release_year": "1988"
  },
  {
    "title": "The Super Mario Bros. Movie",
    "synopsis": "While working underground to fix a water main, Brooklyn plumbers—and brothers—Mario and Luigi are transported down a mysterious pipe and wander into a magical new world. But when the brothers are separated, Mario embarks on an epic quest to find Luigi.",
    "genre": "Animation, Family, Adventure, Fantasy, Comedy",
    "release_year": "2023"
  },
  {
    "title": "Kokoro to Karada",
    "synopsis": "A few years ago,  when Tomomi (Hiroko Akune) was on the way home from school, she saw her friend Keiko (Misaki Mori) about to be raped by a man. Tomomi hit the man in the head with a stone and saved Keiko.  In the present, Keiko, has buried her past, sells her body in Tokyo. One day, Keiko is contacted by Tomomi. They haven't spoken since their high school graduation. They meet and Keiko lets Tomomi stay at her apartment. Soon, the bizarre lives of the two women begins, with Tomomi also selling her body.",
    "genre": "Drama",
    "release_year": "2004"
  },
  {
    "title": "Mercy",
    "synopsis": "An ex-military doctor finds herself in a deadly battle for survival when the Irish mafia seize control of the hospital at which she works. When her son is taken hostage, she is forced to rely upon her battle-hardened past and lethal skills after realizing there’s no one left to save the day but her.",
    "genre": "Action, Mystery, Thriller",
    "release_year": "2023"
  },
  {
    "title": "Friend's Mothers",
    "synopsis": "A lonely young man is in dire straits, but his friend's mothers don't see him as a boy, but as a man, and take extra interest in him.",
    "genre": "Romance",
    "release_year": "2018"
  },
  {
    "title": "The Childe",
    "synopsis": "Han, a Filipino-Korean(Kopino) boxer hits the final punch against his opponent at an illegal game. The opponent is knocked down, and Han returns home with a few dollars to pay for his mother’s surgery. Although he is aware that he shouldn't, he strives to find his father, whom he saw in an old picture. Then, one day, Han rushes to the Kopino Support Center after receiving an unexpected phone call from Mr. Kim, and he follows those who came to pick him up on a board to Korea. Meanwhile, a mysterious child appears and a man keeps an eye on Han at the airport. Who or what is chasing him?",
    "genre": "Action, Thriller, Drama",
    "release_year": "2023"
  },
  {
    "title": "Gravity",
    "synopsis": "Dr. Ryan Stone, a brilliant medical engineer on her first Shuttle mission, with veteran astronaut Matt Kowalsky in command of his last flight before retiring. But on a seemingly routine spacewalk, disaster strikes. The Shuttle is destroyed, leaving Stone and Kowalsky completely alone-tethered to nothing but each other and spiraling out into the blackness of space. The deafening silence tells them they have lost any link to Earth and any chance for rescue. As fear turns to panic, every gulp of air eats away at what little oxygen is left. But the only way home may be to go further out into the terrifying expanse of space.",
    "genre": "Science Fiction, Thriller, Drama",
    "release_year": "2013"
  },
  {
    "title": "Damaged",
    "synopsis": "A Chicago detective travels to Scotland after an emerging serial killer’s crimes match those that he investigated five years earlier, one of which was the crime scene of his murdered girlfriend.",
    "genre": "Action, Crime, Thriller",
    "release_year": "2024"
  },
  {
    "title": "Judge Dredd",
    "synopsis": "In a dystopian future, Dredd, the most famous judge (a cop with instant field judiciary powers) is convicted for a crime he did not commit while his murderous counterpart escapes.",
    "genre": "Science Fiction",
    "release_year": "1995"
  },
  {
    "title": "MR-9: Do or Die",
    "synopsis": "Masud Rana is a Secret Agent with code name MR-9 of the Bangladesh Counter Intelligence Agency",
    "genre": "Action, Drama, Thriller",
    "release_year": "2023"
  },
  {
    "title": "Misery",
    "synopsis": "After stalking and saving the life of her favorite fiction author in a car accident, his  manic obsessor holds him captive in her remote Colorado home then forces him to write back to life the popular literary character he killed off.",
    "genre": "Drama, Thriller",
    "release_year": "1990"
  },
  {
    "title": "Slyth: The Hunt Saga",
    "synopsis": "After a deadly forest fire sweeps the earth and fills the air with pollutants, society is on the brink of collapse and riddled with disease. The only hope seems to be in a legend come to life: that of the Slyth, a reptilian species that can disguise themselves as humans and possesses blood that can cure disease. The hunt is on.",
    "genre": "Action, Science Fiction, Thriller, Romance",
    "release_year": "2023"
  },
  {
    "title": "Dark City",
    "synopsis": "A man struggles with memories of his past, including a wife he cannot remember, in a nightmarish world with no sun and run by beings with telekinetic powers who seek the souls of humans.",
    "genre": "Mystery, Science Fiction",
    "release_year": "1998"
  },
  {
    "title": "Sting",
    "synopsis": "After raising an unnervingly talented spider in secret, 12-year-old Charlotte must face the truth about her pet and fight for her family's survival.",
    "genre": "Horror, Thriller",
    "release_year": "2024"
  },
  {
    "title": "Green Book",
    "synopsis": "Tony Lip, a bouncer in 1962, is hired to drive pianist Don Shirley on a tour through the Deep South in the days when African Americans, forced to find alternate accommodations and services due to segregation laws below the Mason-Dixon Line, relied on a guide called The Negro Motorist Green Book.",
    "genre": "Drama, History",
    "release_year": "2018"
  },
  {
    "title": "After the Pandemic",
    "synopsis": "Set in a post-apocalyptic world where a global airborne pandemic has wiped out 90% of the Earth's population and only the young and immune have endured as scavengers. For Ellie and Quinn, the daily challenges to stay alive are compounded when they become hunted by the merciless Stalkers.",
    "genre": "Science Fiction, Action",
    "release_year": "2022"
  },
  {
    "title": "Jaws",
    "synopsis": "When the seaside community of Amity finds itself under attack by a dangerous great white shark, the town's chief of police, a young marine biologist, and a grizzled hunter embark on a desperate quest to destroy the beast before it strikes again.",
    "genre": "Horror, Thriller, Adventure",
    "release_year": "1975"
  },
  {
    "title": "Anyone But You",
    "synopsis": "After an amazing first date, Bea and Ben’s fiery attraction turns ice cold — until they find themselves unexpectedly reunited at a destination wedding in Australia. So they do what any two mature adults would do: pretend to be a couple.",
    "genre": "Romance, Comedy",
    "release_year": "2023"
  },
  {
    "title": "Death Wish",
    "synopsis": "A mild-mannered father is transformed into a killing machine after his family is torn apart by a violent act.",
    "genre": "Action, Crime, Drama, Thriller",
    "release_year": "2018"
  },
  {
    "title": "A Quiet Place: Day One",
    "synopsis": "As New York City is invaded by alien creatures who hunt by sound, a woman named Sammy fights to survive.",
    "genre": "Horror, Science Fiction, Thriller",
    "release_year": "2024"
  },
  {
    "title": "A Quiet Place: Day One",
    "synopsis": "As New York City is invaded by alien creatures who hunt by sound, a woman named Sammy fights to survive.",
    "genre": "Horror, Science Fiction, Thriller",
    "release_year": "2024"
  },
  {
    "title": "Deadpool 2",
    "synopsis": "Wisecracking mercenary Deadpool battles the evil and powerful Cable and other bad guys to save a boy's life.",
    "genre": "Action, Comedy, Adventure",
    "release_year": "2018"
  },
  {
    "title": "Hachiko",
    "synopsis": "This is the story of a puppy that touched hundreds of millions of people around the world. Hachiko is a cute Chinese pastoral dog. He met his destined owner Chen Jingxiu in the vast crowd and became a member of the Chen family. With the passage of time, the once beautiful home is no longer there, but Batong is still waiting where it is, and its fate is closely tied to its family.",
    "genre": "Drama, Family",
    "release_year": "2023"
  },
  {
    "title": "Garfield",
    "synopsis": "Garfield, the fat, lazy, lasagna lover, has everything a cat could want. But when Jon, in an effort to impress the Liz - the vet and an old high-school crush - adopts a dog named Odie and brings him home, Garfield gets the one thing he doesn't want. Competition.",
    "genre": "Animation, Comedy, Family",
    "release_year": "2004"
  },
  {
    "title": "Transformers: Rise of the Beasts",
    "synopsis": "When a new threat capable of destroying the entire planet emerges, Optimus Prime and the Autobots must team up with a powerful faction known as the Maximals. With the fate of humanity hanging in the balance, humans Noah and Elena will do whatever it takes to help the Transformers as they engage in the ultimate battle to save Earth.",
    "genre": "Action, Adventure, Science Fiction",
    "release_year": "2023"
  },
  {
    "title": "Spitfire Over Berlin",
    "synopsis": "August 1944. With the American Eighth Air Force poised to strike over Nazi Germany, British Intelligence learns that they could be flying into a deadly trap. With only hours to spare, Flight Lieutenant Edward Barnes must fly a life and death mission over Berlin in his unarmed Spitfire to obtain photographic evidence and save the lives of 1200 men.",
    "genre": "War, Action, History",
    "release_year": "2022"
  },
  {
    "title": "The Three Musketeers: Milady",
    "synopsis": "D'Artagnan, on a quest to rescue the abducted Constance, runs into the mysterious Milady de Winter again. The tension between the Catholics and the Protestants finally escalates, as the king declares war — forcing the now four musketeers into battle. But as the war goes on, they are tested physically, mentally and emotionally.",
    "genre": "Adventure, Action, Drama",
    "release_year": "2023"
  },
  {
    "title": "Baby Driver",
    "synopsis": "After being coerced into working for a crime boss, a young getaway driver finds himself taking part in a heist doomed to fail.",
    "genre": "Action, Crime",
    "release_year": "2017"
  },
  {
    "title": "Land of Bad",
    "synopsis": "When a Delta Force special ops mission goes terribly wrong, Air Force drone pilot Reaper has 48 hours to remedy what has devolved into a wild rescue operation. With no weapons and no communication other than the drone above, the ground mission suddenly becomes a full-scale battle when the team is discovered by the enemy.",
    "genre": "Action, Thriller, War",
    "release_year": "2024"
  },
  {
    "title": "HAIKYU!! The Dumpster Battle",
    "synopsis": "Shoyo Hinata joins Karasuno High's volleyball club to be like his idol, a former Karasuno player known as the 'Little Giant'. But Hinata soon learns that he must team up with his middle school nemesis, Tobio Kageyama. Their clashing styles form a surprising weapon, but can their newfound teamwork defeat their rival Nekoma High in the highly anticipated 'Dumpster Battle', the long awaited ultimate showdown between two opposing underdog teams?",
    "genre": "Animation, Drama",
    "release_year": "2024"
  },
  {
    "title": "Se7en",
    "synopsis": "Two homicide detectives are on a desperate hunt for a serial killer whose crimes are based on the \"seven deadly sins\" in this dark and haunting film that takes viewers from the tortured remains of one victim to the next. The seasoned Det. Sommerset researches each sin in an effort to get inside the killer's mind, while his novice partner, Mills, scoffs at his efforts to unravel the case.",
    "genre": "Crime, Mystery, Thriller",
    "release_year": "1995"
  },
  {
    "title": "Ipar Adalah Maut",
    "synopsis": "Nisa and Aris’s marriage appears to be a picture-perfect fairytale especially after the birth of their first child, Raya. Situation becomes delicate as Nisa’s mother entrust her second daughter, Rani to live with Nisa and Aris. Initially Rani keeps her distance with Aris. However it does not last long before the window to a forbidden relationship is opened. Behind Nisa’s back, Aris develops an affair with his wife’s beloved sister.",
    "genre": "Drama, Romance",
    "release_year": "2024"
  },
  {
    "title": "Scarface",
    "synopsis": "After getting a green card in exchange for assassinating a Cuban government official, Tony Montana stakes a claim on the drug trade in Miami. Viciously murdering anyone who stands in his way, Tony eventually becomes the biggest drug lord in the state, controlling nearly all the cocaine that comes through Miami. But increased pressure from the police, wars with Colombian drug cartels and his own drug-fueled paranoia serve to fuel the flames of his eventual downfall.",
    "genre": "Action, Crime, Drama",
    "release_year": "1983"
  },
  {
    "title": "SPY x FAMILY CODE: White",
    "synopsis": "While under the guise of taking his family on a weekend winter getaway, Loid's attempt to make progress on his current mission Operation Strix proves difficult when Anya mistakenly gets involved and triggers events that threaten world peace.",
    "genre": "Animation, Comedy, Adventure, Action",
    "release_year": "2023"
  },
  {
    "title": "John Wick: Chapter 4",
    "synopsis": "With the price on his head ever increasing, John Wick uncovers a path to defeating The High Table. But before he can earn his freedom, Wick must face off against a new enemy with powerful alliances across the globe and forces that turn old friends into foes.",
    "genre": "Action, Thriller, Crime",
    "release_year": "2023"
  },
  {
    "title": "Spider-Man: Across the Spider-Verse",
    "synopsis": "After reuniting with Gwen Stacy, Brooklyn’s full-time, friendly neighborhood Spider-Man is catapulted across the Multiverse, where he encounters the Spider Society, a team of Spider-People charged with protecting the Multiverse’s very existence. But when the heroes clash on how to handle a new threat, Miles finds himself pitted against the other Spiders and must set out on his own to save those he loves most.",
    "genre": "Animation, Action, Adventure, Science Fiction",
    "release_year": "2023"
  },
  {
    "title": "A Quiet Place",
    "synopsis": "A family is forced to live in silence while hiding from creatures that hunt by sound.",
    "genre": "Horror, Drama, Science Fiction",
    "release_year": "2018"
  },
  {
    "title": "Total Recall",
    "synopsis": "Factory worker Doug Quaid takes a virtual mind-trip vacation with the Rekall company, opting for implanted memories of being a spy. When the procedure goes wrong, Quaid becomes a wanted man by the police and joins forces with a rebel fighter to stop the evil Chancellor Cohaagen.",
    "genre": "Action, Science Fiction, Thriller",
    "release_year": "2012"
  },
  {
    "title": "Mad Max: Fury Road",
    "synopsis": "An apocalyptic story set in the furthest reaches of our planet, in a stark desert landscape where humanity is broken, and most everyone is crazed fighting for the necessities of life. Within this world exist two rebels on the run who just might be able to restore order.",
    "genre": "Action, Adventure, Science Fiction",
    "release_year": "2015"
  },
  {
    "title": "Damsel",
    "synopsis": "A young woman's marriage to a charming prince turns into a fierce fight for survival when she's offered up as a sacrifice to a fire-breathing dragon.",
    "genre": "Fantasy, Action, Adventure",
    "release_year": "2024"
  },
  {
    "title": "Donnie Darko",
    "synopsis": "After narrowly escaping a bizarre accident, a troubled teenager is plagued by visions of a large bunny rabbit that manipulates him to commit a series of crimes.",
    "genre": "Fantasy, Drama, Mystery",
    "release_year": "2001"
  },
  {
    "title": "Nahir",
    "synopsis": "One of the most controversial cases in recent years in Argentina, this movie is based on the true story of Nahir Galarza and the murder of her boyfriend that rocked the country. The youngest woman to be convicted and sentenced to life in prison in Argentina, but questions still remain- was this a crime of passion, or is the truth still yet to be fully discovered?",
    "genre": "Crime, Drama, Thriller",
    "release_year": "2024"
  },
  {
    "title": "Vikings: Battle of Heirs",
    "synopsis": "A young Viking must come to terms with the realization that he may be the King's son, who was switched at birth, but not before others try to take his rightful place.",
    "genre": "Action",
    "release_year": "2023"
  },
  {
    "title": "Morbius",
    "synopsis": "Dangerously ill with a rare blood disorder, and determined to save others suffering his same fate, Dr. Michael Morbius attempts a desperate gamble. What at first appears to be a radical success soon reveals itself to be a remedy potentially worse than the disease.",
    "genre": "Action, Science Fiction, Fantasy",
    "release_year": "2022"
  },
  {
    "title": "Challengers",
    "synopsis": "Tennis player turned coach Tashi has taken her husband, Art, and transformed him into a world-famous Grand Slam champion. To jolt him out of his recent losing streak, she signs him up for a \"Challenger\" event — close to the lowest level of pro tournament — where he finds himself standing across the net from his former best friend and Tashi's former boyfriend.",
    "genre": "Romance, Drama",
    "release_year": "2024"
  },
  {
    "title": "Puss in Boots: The Last Wish",
    "synopsis": "Puss in Boots discovers that his passion for adventure has taken its toll: He has burned through eight of his nine lives, leaving him with only one life left. Puss sets out on an epic journey to find the mythical Last Wish and restore his nine lives.",
    "genre": "Animation, Adventure, Fantasy, Comedy, Family",
    "release_year": "2022"
  },
  {
    "title": "Se7en",
    "synopsis": "Two homicide detectives are on a desperate hunt for a serial killer whose crimes are based on the \"seven deadly sins\" in this dark and haunting film that takes viewers from the tortured remains of one victim to the next. The seasoned Det. Sommerset researches each sin in an effort to get inside the killer's mind, while his novice partner, Mills, scoffs at his efforts to unravel the case.",
    "genre": "Crime, Mystery, Thriller",
    "release_year": "1995"
  },
  {
    "title": "578: Magnum",
    "synopsis": "A container truck driver, Hùng, lives an idyllic life with his little daughter, An. The father and daughter become the closest companions in every journey with their orange container truck. Life goes on like that until An has to leave her father to go to school. One day, Hùng is informed that An is suffering from severe depression. Relying on his old skills in the past and finding out the truth, Hùng becomes enraged and painful to know that his little girl was kidnapped by a male stranger. Starting his lone and intense journey looking for and chasing after the unknown abuser, Hùng realizes that to hunt down that psychopath he has to counter the massive underground forces behind him.",
    "genre": "Action, Thriller",
    "release_year": "2022"
  },
  {
    "title": "Slasher",
    "synopsis": "Julio inherits a mask like his father used to kill. A group of young people will arrive at his town and cross his path. Julio must decide whether to continue the family tradition or embrace the love he has just known.",
    "genre": "Horror, Comedy, Drama",
    "release_year": "2023"
  },
  {
    "title": "The Gigolo",
    "synopsis": "Fung looks like a super-heartthrob and was bon with a special endowment, making him the high school idol. He was expelled from school when he was caught fighting on campus. When his mom, the sole provider of his family with her poultry business, had to stop working due to her back problems, Fung decides to support his family financially. And from that moment, his life takes on a tumultuous change…",
    "genre": "Romance, Drama, Comedy",
    "release_year": "2015"
  },
  {
    "title": "Outsource",
    "synopsis": "A police chief hires an old friend, who is an international spy, to help him search for a wanted suspect in the Philippines. When the chief dies, all evidence points towards the spy, and he must go to extremes to defend himself.",
    "genre": "Action, Comedy",
    "release_year": "2022"
  },
  {
    "title": "Usogui",
    "synopsis": "Madarame Baku is a mysterious gambler. His nickname is Usogui (literally The Lie Eater). Club Kakerou is the top illegal gambling den, where gamblers vie to become the best in their profession. Seeing through the lies of others, Madarame Baku challenges a variety of high stakes games at Club Kakerou.",
    "genre": "Mystery, Thriller",
    "release_year": "2022"
  },
  {
    "title": "Superman",
    "synopsis": "Mild-mannered Clark Kent works as a reporter at the Daily Planet alongside his crush, Lois Lane. Clark must summon his superhero alter-ego when the nefarious Lex Luthor launches a plan to take over the world.",
    "genre": "Science Fiction, Action, Adventure",
    "release_year": "1978"
  },
  {
    "title": "A Quiet Place",
    "synopsis": "A family is forced to live in silence while hiding from creatures that hunt by sound.",
    "genre": "Horror, Drama, Science Fiction",
    "release_year": "2018"
  },
  {
    "title": "Sri Asih",
    "synopsis": "Alana discover the truth about her origin: she’s not an ordinary human being. She may be the gift for humanity and become its protector as Sri Asih. Or a destruction, if she can’t control her anger.",
    "genre": "Action, Adventure, Science Fiction, Fantasy, Drama",
    "release_year": "2022"
  },
  {
    "title": "Becoming",
    "synopsis": "Join former first lady Michelle Obama in an intimate documentary looking at her life, hopes and connection with others.",
    "genre": "Documentary",
    "release_year": "2020"
  },
  {
    "title": "Escape from Hell",
    "synopsis": "A women's prison camp is located deep in the tropical rain forest. Sadistic guards and a warden from hell make life almost unbearable for the inmates, and any infraction of the rules is dealt with swiftly and savagely. The camp doctor is horrified at what he sees happening, and drinks heavily to push the horror away. Finally the inmates have had had enough, and they enlist the help of the doctor to try and escape.",
    "genre": "Adventure, Crime, Thriller",
    "release_year": "1980"
  },
  {
    "title": "Baby Driver",
    "synopsis": "After being coerced into working for a crime boss, a young getaway driver finds himself taking part in a heist doomed to fail.",
    "genre": "Action, Crime",
    "release_year": "2017"
  },
  {
    "title": "Winnie-the-Pooh: Blood and Honey 2",
    "synopsis": "Five months following the murders, Christopher Robin tries returning to his regular life while dealing with his PTSD. Deep within the 100-Acre-Wood, a destructive rage grows as Winnie-the-Pooh, Piglet, Owl, and Tigger find their home and their lives endangered after their existence is revealed.",
    "genre": "Horror, Thriller, Mystery, Comedy",
    "release_year": "2024"
  },
  {
    "title": "The Omen",
    "synopsis": "Immediately after their miscarriage, the US diplomat Robert Thorn adopts the newborn Damien without the knowledge of his wife. Yet what he doesn’t know is that their new son is the son of the devil.",
    "genre": "Horror, Thriller",
    "release_year": "1976"
  },
  {
    "title": "Scarface",
    "synopsis": "After getting a green card in exchange for assassinating a Cuban government official, Tony Montana stakes a claim on the drug trade in Miami. Viciously murdering anyone who stands in his way, Tony eventually becomes the biggest drug lord in the state, controlling nearly all the cocaine that comes through Miami. But increased pressure from the police, wars with Colombian drug cartels and his own drug-fueled paranoia serve to fuel the flames of his eventual downfall.",
    "genre": "Action, Crime, Drama",
    "release_year": "1983"
  },
  {
    "title": "Meteor",
    "synopsis": "After a meteor collides into Earth, a lonely rancher and a lost young girl are on the run from vicious mercenaries.",
    "genre": "Science Fiction, Thriller",
    "release_year": "2021"
  },
  {
    "title": "Gifted",
    "synopsis": "Frank, a single man raising his child prodigy niece Mary, is drawn into a custody battle with his mother.",
    "genre": "Drama, Comedy",
    "release_year": "2017"
  },
  {
    "title": "RoboCop",
    "synopsis": "In a violent, near-apocalyptic Detroit, evil corporation Omni Consumer Products wins a contract from the city government to privatize the police force. To test their crime-eradicating cyborgs, the company leads street cop Alex Murphy into an armed confrontation with crime lord Boddicker so they can use his body to support their untested RoboCop prototype. But when RoboCop learns of the company's nefarious plans, he turns on his masters.",
    "genre": "Action, Thriller, Science Fiction",
    "release_year": "1987"
  },
  {
    "title": "The Night They Came Home",
    "synopsis": "The combined force of local lawmen and Indian police aim to take down the the Rufus Buck Gang, a cold-heated band of fugitives with vengeance on their minds.",
    "genre": "Western, Thriller, Action",
    "release_year": "2024"
  },
  {
    "title": "Spider-Man: Homecoming",
    "synopsis": "Following the events of Captain America: Civil War, Peter Parker, with the help of his mentor Tony Stark, tries to balance his life as an ordinary high school student in Queens, New York City, with fighting crime as his superhero alter ego Spider-Man as a new threat, the Vulture, emerges.",
    "genre": "Action, Adventure, Science Fiction, Drama",
    "release_year": "2017"
  },
  {
    "title": "Trolls Band Together",
    "synopsis": "When Branch's brother, Floyd, is kidnapped for his musical talents by a pair of nefarious pop-star villains, Branch and Poppy embark on a harrowing and emotional journey to reunite the other brothers and rescue Floyd from a fate even worse than pop-culture obscurity.",
    "genre": "Animation, Family, Music, Fantasy, Comedy",
    "release_year": "2023"
  },
  {
    "title": "The Family Plan",
    "synopsis": "Dan Morgan is many things: a devoted husband, a loving father, a celebrated car salesman. He's also a former assassin. And when his past catches up to his present, he's forced to take his unsuspecting family on a road trip unlike any other.",
    "genre": "Action, Comedy",
    "release_year": "2023"
  },
  {
    "title": "Mission: Impossible - Dead Reckoning Part One",
    "synopsis": "Ethan Hunt and his IMF team embark on their most dangerous mission yet: To track down a terrifying new weapon that threatens all of humanity before it falls into the wrong hands. With control of the future and the world's fate at stake and dark forces from Ethan's past closing in, a deadly race around the globe begins. Confronted by a mysterious, all-powerful enemy, Ethan must consider that nothing can matter more than his mission—not even the lives of those he cares about most.",
    "genre": "Action, Thriller",
    "release_year": "2023"
  },
  {
    "title": "Bionic",
    "synopsis": "When the progress of robotics makes Paralympic athletes the new sports stars, Maria dreams of competing against her sister. For that, she will have to enter a world of crime and violence.",
    "genre": "Science Fiction, Action, Adventure",
    "release_year": "2024"
  },
  {
    "title": "Citizen Kane",
    "synopsis": "Newspaper magnate Charles Foster Kane is taken from his mother as a boy and made the ward of a rich industrialist. As a result, every well-meaning, tyrannical or self-destructive move he makes for the rest of his life appears in some way to be a reaction to that deeply wounding event.",
    "genre": "Mystery, Drama",
    "release_year": "1941"
  },
  {
    "title": "Justice League",
    "synopsis": "Fuelled by his restored faith in humanity and inspired by Superman's selfless act, Bruce Wayne and Diana Prince assemble a team of metahumans consisting of Barry Allen, Arthur Curry and Victor Stone to face the catastrophic threat of Steppenwolf and the Parademons who are on the hunt for three Mother Boxes on Earth.",
    "genre": "Action, Adventure, Science Fiction",
    "release_year": "2017"
  },
  {
    "title": "Meg 2: The Trench",
    "synopsis": "An exploratory dive into the deepest depths of the ocean of a daring research team spirals into chaos when a malevolent mining operation threatens their mission and forces them into a high-stakes battle for survival.",
    "genre": "Action, Science Fiction, Horror",
    "release_year": "2023"
  },
  {
    "title": "Spectre",
    "synopsis": "A cryptic message from Bond’s past sends him on a trail to uncover a sinister organization. While M battles political forces to keep the secret service alive, Bond peels back the layers of deceit to reveal the terrible truth behind SPECTRE.",
    "genre": "Action, Adventure, Thriller",
    "release_year": "2015"
  },
  {
    "title": "Avengers: Endgame",
    "synopsis": "After the devastating events of Avengers: Infinity War, the universe is in ruins due to the efforts of the Mad Titan, Thanos. With the help of remaining allies, the Avengers must assemble once more in order to undo Thanos' actions and restore order to the universe once and for all, no matter what consequences may be in store.",
    "genre": "Adventure, Science Fiction, Action",
    "release_year": "2019"
  },
  {
    "title": "We Treat Women Too Well",
    "synopsis": "Remedios Buendía defends her homeland and will fight for it. This fateful day of 1945, a group of maquis take the post where she tries on her wedding dress. She will show how far she can go defending her values.",
    "genre": "Comedy",
    "release_year": "2024"
  },
  {
    "title": "It",
    "synopsis": "In a small town in Maine, seven children known as The Losers Club come face to face with life problems, bullies and a monster that takes the shape of a clown called Pennywise.",
    "genre": "Horror",
    "release_year": "2017"
  },
  {
    "title": "Encanto",
    "synopsis": "The tale of an extraordinary family, the Madrigals, who live hidden in the mountains of Colombia, in a magical house, in a vibrant town, in a wondrous, charmed place called an Encanto. The magic of the Encanto has blessed every child in the family—every child except one, Mirabel. But when she discovers that the magic surrounding the Encanto is in danger, Mirabel decides that she, the only ordinary Madrigal, might just be her exceptional family's last hope.",
    "genre": "Animation, Comedy, Family, Fantasy",
    "release_year": "2021"
  },
  {
    "title": "Avatar: The Way of Water",
    "synopsis": "Set more than a decade after the events of the first film, learn the story of the Sully family (Jake, Neytiri, and their kids), the trouble that follows them, the lengths they go to keep each other safe, the battles they fight to stay alive, and the tragedies they endure.",
    "genre": "Science Fiction, Adventure, Action",
    "release_year": "2022"
  },
  {
    "title": "Get Real",
    "synopsis": "Steven spends his school days longing for all-star athlete John. But John has a gorgeous girlfriend, and Steven is still in the closet. Steven's sole confidant is his friend Linda. After a curious run-in with John in a public restroom, Steven starts to wonder if the jock is straight after all. When they begin a romance, it threatens to expose the truth about both of them.",
    "genre": "Drama, Romance",
    "release_year": "1998"
  },
  {
    "title": "Spectre",
    "synopsis": "A cryptic message from Bond’s past sends him on a trail to uncover a sinister organization. While M battles political forces to keep the secret service alive, Bond peels back the layers of deceit to reveal the terrible truth behind SPECTRE.",
    "genre": "Action, Adventure, Thriller",
    "release_year": "2015"
  },
  {
    "title": "Avengers: Endgame",
    "synopsis": "After the devastating events of Avengers: Infinity War, the universe is in ruins due to the efforts of the Mad Titan, Thanos. With the help of remaining allies, the Avengers must assemble once more in order to undo Thanos' actions and restore order to the universe once and for all, no matter what consequences may be in store.",
    "genre": "Adventure, Science Fiction, Action",
    "release_year": "2019"
  },
  {
    "title": "Vikings: Battle of Heirs",
    "synopsis": "A young Viking must come to terms with the realization that he may be the King's son, who was switched at birth, but not before others try to take his rightful place.",
    "genre": "Action",
    "release_year": "2023"
  },
  {
    "title": "It",
    "synopsis": "In a small town in Maine, seven children known as The Losers Club come face to face with life problems, bullies and a monster that takes the shape of a clown called Pennywise.",
    "genre": "Horror",
    "release_year": "2017"
  },
  {
    "title": "Rings",
    "synopsis": "Julia becomes worried about her boyfriend Holt when he explores the dark urban legend of a mysterious videotape said to kill the watcher seven days after viewing. She sacrifices herself to save her boyfriend and in doing so makes a horrifying discovery: there is a \"movie within the movie\" that no one has ever seen before.",
    "genre": "Horror",
    "release_year": "2017"
  },
  {
    "title": "Avatar: The Way of Water",
    "synopsis": "Set more than a decade after the events of the first film, learn the story of the Sully family (Jake, Neytiri, and their kids), the trouble that follows them, the lengths they go to keep each other safe, the battles they fight to stay alive, and the tragedies they endure.",
    "genre": "Science Fiction, Adventure, Action",
    "release_year": "2022"
  },
  {
    "title": "Grease",
    "synopsis": "Australian good girl Sandy and greaser Danny fell in love over the summer. But when they unexpectedly discover they're now in the same high school, will they be able to rekindle their romance despite their eccentric friends?",
    "genre": "Romance, Comedy",
    "release_year": "1978"
  },
  {
    "title": "Justice League: Crisis on Infinite Earths Part Two",
    "synopsis": "An endless army of shadow demons bent on the destruction of all reality swarms over our world and all parallel Earths! The only thing opposing them is the mightiest team of metahumans ever assembled. But not even the combined power of Superman, Batman, Wonder Woman, Green Lantern and all their fellow superheroes can slow down the onslaught of this invincible horde. What mysterious force is driving them? And how do the long-buried secrets of the Monitor and Supergirl threaten to crush our last defense?",
    "genre": "Animation, Science Fiction, Action",
    "release_year": "2024"
  },
  {
    "title": "Apaixonada",
    "synopsis": "Based on the book by Cris Souza Fontes, Apaixonada tells the story of a woman who realizes how monotonous her life is. She finds herself desperate and facing an identity crisis. From then on, she is forced to begin an exciting journey of self-discovery that takes her close to all the passions that life has to offer.",
    "genre": "Comedy, Romance",
    "release_year": "2024"
  },
  {
    "title": "It Chapter Two",
    "synopsis": "27 years after overcoming the malevolent supernatural entity Pennywise, the former members of the Losers' Club, who have grown up and moved away from Derry, are brought back together by a devastating phone call.",
    "genre": "Horror",
    "release_year": "2019"
  },
  {
    "title": "Get Out",
    "synopsis": "Chris and his girlfriend Rose go upstate to visit her parents for the weekend. At first, Chris reads the family's overly accommodating behavior as nervous attempts to deal with their daughter's interracial relationship, but as the weekend progresses, a series of increasingly disturbing discoveries lead him to a truth that he never could have imagined.",
    "genre": "Mystery, Thriller, Horror",
    "release_year": "2017"
  },
  {
    "title": "House on Rockingham",
    "synopsis": "After securing a job as live-in housekeeper, a woman discovers the owner may be connected to her sister's disappearance.",
    "genre": "Horror, Thriller",
    "release_year": "2024"
  },
  {
    "title": "Expend4bles",
    "synopsis": "Armed with every weapon they can get their hands on and the skills to use them, The Expendables are the world’s last line of defense and the team that gets called when all other options are off the table. But new team members with new styles and tactics are going to give “new blood” a whole new meaning.",
    "genre": "Action, Adventure, Thriller",
    "release_year": "2023"
  },
  {
    "title": "Toy Story",
    "synopsis": "Led by Woody, Andy's toys live happily in his room until Andy's birthday brings Buzz Lightyear onto the scene. Afraid of losing his place in Andy's heart, Woody plots against Buzz. But when circumstances separate Buzz and Woody from their owner, the duo eventually learns to put aside their differences.",
    "genre": "Animation, Adventure, Family, Comedy",
    "release_year": "1995"
  },
  {
    "title": "The Creator",
    "synopsis": "Amid a future war between the human race and the forces of artificial intelligence, a hardened ex-special forces agent grieving the disappearance of his wife, is recruited to hunt down and kill the Creator, the elusive architect of advanced AI who has developed a mysterious weapon with the power to end the war—and mankind itself.",
    "genre": "Action, Adventure, Science Fiction",
    "release_year": "2023"
  },
  {
    "title": "The Bikeriders",
    "synopsis": "After a chance encounter at a local bar, strong-willed Kathy is inextricably drawn to Benny, the newest member of Midwestern motorcycle club, the Vandals led by the enigmatic Johnny. Much like the country around it, the club begins to evolve, transforming from a gathering place for local outsiders into a dangerous underworld of violence, forcing Benny to choose between Kathy and his loyalty to the club.",
    "genre": "Crime, Drama",
    "release_year": "2024"
  },
  {
    "title": "Aquaman and the Lost Kingdom",
    "synopsis": "Black Manta seeks revenge on Aquaman for his father's death. Wielding the Black Trident's power, he becomes a formidable foe. To defend Atlantis, Aquaman forges an alliance with his imprisoned brother. They must protect the kingdom.",
    "genre": "Action, Adventure, Fantasy",
    "release_year": "2023"
  },
  {
    "title": "Gravity",
    "synopsis": "Dr. Ryan Stone, a brilliant medical engineer on her first Shuttle mission, with veteran astronaut Matt Kowalsky in command of his last flight before retiring. But on a seemingly routine spacewalk, disaster strikes. The Shuttle is destroyed, leaving Stone and Kowalsky completely alone-tethered to nothing but each other and spiraling out into the blackness of space. The deafening silence tells them they have lost any link to Earth and any chance for rescue. As fear turns to panic, every gulp of air eats away at what little oxygen is left. But the only way home may be to go further out into the terrifying expanse of space.",
    "genre": "Science Fiction, Thriller, Drama",
    "release_year": "2013"
  },
  {
    "title": "War for the Planet of the Apes",
    "synopsis": "Caesar and his apes are forced into a deadly conflict with an army of humans led by a ruthless Colonel. After the apes suffer unimaginable losses, Caesar wrestles with his darker instincts and begins his own mythic quest to avenge his kind. As the journey finally brings them face to face, Caesar and the Colonel are pitted against each other in an epic battle that will determine the fate of both their species and the future of the planet.",
    "genre": "Drama, Science Fiction, War",
    "release_year": "2017"
  },
  {
    "title": "The Equalizer 3",
    "synopsis": "Robert McCall finds himself at home in Southern Italy but he discovers his friends are under the control of local crime bosses. As events turn deadly, McCall knows what he has to do: become his friends' protector by taking on the mafia.",
    "genre": "Action, Thriller, Crime",
    "release_year": "2023"
  },
  {
    "title": "Late Night with the Devil",
    "synopsis": "A live broadcast of a late-night talk show in 1977 goes horribly wrong, unleashing evil into the nation's living rooms.",
    "genre": "Horror",
    "release_year": "2024"
  },
  {
    "title": "Island Escape",
    "synopsis": "Trapped on an island, a team of mercenaries on a rescue mission begin to question everything around them as they encounter threatening creatures living in the shadows.",
    "genre": "Horror, Action, Science Fiction",
    "release_year": "2023"
  },
  {
    "title": "Green Book",
    "synopsis": "Tony Lip, a bouncer in 1962, is hired to drive pianist Don Shirley on a tour through the Deep South in the days when African Americans, forced to find alternate accommodations and services due to segregation laws below the Mason-Dixon Line, relied on a guide called The Negro Motorist Green Book.",
    "genre": "Drama, History",
    "release_year": "2018"
  },
  {
    "title": "Freelance",
    "synopsis": "An ex-special forces operative takes a job to provide security for a journalist as she interviews a dictator, but a military coup breaks out in the middle of the interview, they are forced to escape into the jungle where they must survive.",
    "genre": "Action, Comedy",
    "release_year": "2023"
  },
  {
    "title": "Hard Hit",
    "synopsis": "On his way to work, a bank manager receives an anonymous call claiming there's a bomb under his car seat, and if anyone exits the car, it will explode unless he can pay a ransom.",
    "genre": "Action, Crime, Drama, Thriller",
    "release_year": "2021"
  },
  {
    "title": "Arthur the King",
    "synopsis": "Over the course of ten days and 435 miles, an unbreakable bond is forged between pro adventure racer Michael Light and a scrappy street dog companion dubbed Arthur. As the team is pushed to their outer limits of endurance in the race, Arthur redefines what victory, loyalty and friendship truly mean.",
    "genre": "Adventure, Drama",
    "release_year": "2024"
  },
  {
    "title": "Traces of Love",
    "synopsis": "On a random night, Marco and Laura meet at a karaoke bar and sing the song \"Evidências\" together. Since then, they fell in love and formed a couple that seemed perfect, until the moment they said “yes”. Without understanding what happened, now, every time this song plays, Marco will travel through his memories with Laura.",
    "genre": "Comedy, Romance, Fantasy",
    "release_year": "2024"
  },
  {
    "title": "Crew",
    "synopsis": "Three ordinary air hostesses from Mumbai embark on a journey to pursue their dreams but find themselves caught up in unexpected misfortunes.",
    "genre": "Comedy, Drama",
    "release_year": "2024"
  },
  {
    "title": "Vampiras: The Brides",
    "synopsis": "After more than 300 years in hiding, Dracula's brides, Luna, Adriana and his new apprentice Katya, must team up once again to stop the most diabolical threat from their past, his sister Mina.",
    "genre": "Horror, Fantasy, Action, Mystery",
    "release_year": "2024"
  },
  {
    "title": "Coraline",
    "synopsis": "A young girl discovers an idealized parallel universe behind a secret door in her new home, unaware that it contains a sinister secret.",
    "genre": "Animation, Family, Fantasy",
    "release_year": "2009"
  },
  {
    "title": "The Hunger Games: The Ballad of Songbirds & Snakes",
    "synopsis": "64 years before he becomes the tyrannical president of Panem, Coriolanus Snow sees a chance for a change in fortunes when he mentors Lucy Gray Baird, the female tribute from District 12.",
    "genre": "Drama, Science Fiction, Action",
    "release_year": "2023"
  },
  {
    "title": "Death Wish",
    "synopsis": "A mild-mannered father is transformed into a killing machine after his family is torn apart by a violent act.",
    "genre": "Action, Crime, Drama, Thriller",
    "release_year": "2018"
  },
  {
    "title": "The Tomorrow War",
    "synopsis": "The world is stunned when a group of time travelers arrive from the year 2051 to deliver an urgent message: Thirty years in the future, mankind is losing a global war against a deadly alien species. The only hope for survival is for soldiers and civilians from the present to be transported to the future and join the fight. Among those recruited is high school teacher and family man Dan Forester. Determined to save the world for his young daughter, Dan teams up with a brilliant scientist and his estranged father in a desperate quest to rewrite the fate of the planet.",
    "genre": "Action, Science Fiction, Adventure",
    "release_year": "2021"
  },
  {
    "title": "Exhuma",
    "synopsis": "After tracing the origin of a disturbing supernatural affliction to a wealthy family's ancestral gravesite, a team of paranormal experts relocates the remains—and soon discovers what happens to those who dare to mess with the wrong grave.",
    "genre": "Mystery, Horror, Thriller",
    "release_year": "2024"
  },
  {
    "title": "Poor Things",
    "synopsis": "Brought back to life by an unorthodox scientist, a young woman runs off with a lawyer on a whirlwind adventure across the continents. Free from the prejudices of her times, she grows steadfast in her purpose to stand for equality and liberation.",
    "genre": "Science Fiction, Romance, Comedy",
    "release_year": "2023"
  },
  {
    "title": "Blade",
    "synopsis": "The Daywalker known as \"Blade\" - a half-vampire, half-mortal man - becomes the protector of humanity against an underground army of vampires.",
    "genre": "Horror, Action",
    "release_year": "1998"
  },
  {
    "title": "Thabo and the Rhino Case",
    "synopsis": "Eleven year old Thabo aspires to be a private detective, if only his home, the small African village, was not the most peaceful Savannah paradise. But things take a sudden turn when a rhino is murdered in the safari park because of its horn.",
    "genre": "Family, Mystery, Adventure",
    "release_year": "2023"
  },
  {
    "title": "PAW Patrol: The Mighty Movie",
    "synopsis": "A magical meteor crash lands in Adventure City and gives the PAW Patrol pups superpowers, transforming them into The Mighty Pups.",
    "genre": "Animation, Family, Action, Science Fiction, Comedy, Drama, Adventure",
    "release_year": "2023"
  },
  {
    "title": "Ghostbusters",
    "synopsis": "After losing their academic posts at a prestigious university, a team of parapsychologists goes into business as proton-pack-toting \"ghostbusters\" who exterminate ghouls, hobgoblins and supernatural pests of all stripes. An ad campaign pays off when a knockout cellist hires the squad to purge her swanky digs of demons that appear to be living in her refrigerator.",
    "genre": "Comedy, Fantasy",
    "release_year": "1984"
  },
  {
    "title": "Princess Cursed in Time: Alchemist's Quest",
    "synopsis": "It follows young alchemist Amélie as she acquires a magical power: partially influencing the flow of time. But she is split in time, and Amélie from the present meets Améliw from the past, who accompanies her every step of the way.",
    "genre": "Family, Fantasy, Comedy",
    "release_year": "2022"
  },
  {
    "title": "Coco",
    "synopsis": "Despite his family’s baffling generations-old ban on music, Miguel dreams of becoming an accomplished musician like his idol, Ernesto de la Cruz. Desperate to prove his talent, Miguel finds himself in the stunning and colorful Land of the Dead following a mysterious chain of events. Along the way, he meets charming trickster Hector, and together, they set off on an extraordinary journey to unlock the real story behind Miguel's family history.",
    "genre": "Family, Animation, Music, Adventure",
    "release_year": "2017"
  },
  {
    "title": "Skyscraper",
    "synopsis": "Framed and on the run, a former FBI agent must save his family from a blazing fire in the world's tallest building.",
    "genre": "Action, Thriller, Adventure",
    "release_year": "2018"
  },
  {
    "title": "Hibla",
    "synopsis": "Isabel and Clara are two childhood friends separated by fate. Isabel is a naive provincial lass who works as an indigenous fabric weaver while Clara is the liberated city girl. Clara has gone wild after her mother runs off with another man. The two meet after years of separation when Clara returns to the barrio to visit her father, Roman. But their cultural difference further separates them as Lando, Isabel's boyfriend, enters into the picture. Lando, frustrated with Isabel's conservatism and idealism, turns his attention to Clara, which irked Isabel. Isabel, in turn, seduces Clara's father.",
    "genre": "Romance, Drama",
    "release_year": "2002"
  },
  {
    "title": "Lady Bird",
    "synopsis": "Lady Bird McPherson, a strong willed, deeply opinionated, artistic 17 year old comes of age in Sacramento. Her relationship with her mother and her upbringing are questioned and tested as she plans to head off to college.",
    "genre": "Drama, Comedy",
    "release_year": "2017"
  },
  {
    "title": "The Nun",
    "synopsis": "A priest with a haunted past and a novice on the threshold of her final vows are sent by the Vatican to investigate the death of a young nun in Romania and confront a malevolent force in the form of a demonic nun.",
    "genre": "Horror",
    "release_year": "2018"
  },
  {
    "title": "The Suicide Squad",
    "synopsis": "Supervillains Harley Quinn, Bloodsport, Peacemaker and a collection of nutty cons at Belle Reve prison join the super-secret, super-shady Task Force X as they are dropped off at the remote, enemy-infused island of Corto Maltese.",
    "genre": "Action, Comedy, Adventure",
    "release_year": "2021"
  },
  {
    "title": "Golden Kamuy",
    "synopsis": "On the Hokkaido frontier, a war veteran and Ainu girl race against misfits and military renegades to find treasure mapped out on tattooed outlaws.",
    "genre": "Action, Adventure, Comedy",
    "release_year": "2024"
  },
  {
    "title": "Return of Special Forces 5",
    "synopsis": "After Long Wei and his men finished their operation in Fuji, they received a distress message from his ex-wife, Leng Yun. Long Wei immediately rushes to Southeast Asia alone to look for his ex-wife. With his excellent ability to fight alone, Long Wei and his daughter break through all the dangers they encounter one by one, will they be able to rescue his ex-wife successfully?",
    "genre": "Action",
    "release_year": "2021"
  },
  {
    "title": "Black Widow",
    "synopsis": "Natasha Romanoff, also known as Black Widow, confronts the darker parts of her ledger when a dangerous conspiracy with ties to her past arises. Pursued by a force that will stop at nothing to bring her down, Natasha must deal with her history as a spy and the broken relationships left in her wake long before she became an Avenger.",
    "genre": "Action, Adventure, Science Fiction",
    "release_year": "2021"
  },
  {
    "title": "Shrek",
    "synopsis": "It ain't easy bein' green -- especially if you're a likable (albeit smelly) ogre named Shrek. On a mission to retrieve a gorgeous princess from the clutches of a fire-breathing dragon, Shrek teams up with an unlikely compatriot -- a wisecracking donkey.",
    "genre": "Animation, Comedy, Fantasy, Adventure, Family",
    "release_year": "2001"
  },
  {
    "title": "Five Nights at Freddy's",
    "synopsis": "Recently fired and desperate for work, a troubled young man named Mike agrees to take a position as a night security guard at an abandoned theme restaurant: Freddy Fazbear's Pizzeria. But he soon discovers that nothing at Freddy's is what it seems.",
    "genre": "Horror, Mystery",
    "release_year": "2023"
  },
  {
    "title": "Creed III",
    "synopsis": "After dominating the boxing world, Adonis Creed has thrived in his career and family life. When a childhood friend and former boxing prodigy, Damian Anderson, resurfaces after serving a long sentence in prison, he is eager to prove that he deserves his shot in the ring. The face-off between former friends is more than just a fight. To settle the score, Adonis must put his future on the line to battle Damian — a fighter with nothing to lose.",
    "genre": "Drama, Action",
    "release_year": "2023"
  },
  {
    "title": "Iron Man 3",
    "synopsis": "When Tony Stark's world is torn apart by a formidable terrorist called the Mandarin, he starts an odyssey of rebuilding and retribution.",
    "genre": "Action, Adventure, Science Fiction",
    "release_year": "2013"
  },
  {
    "title": "Orion and the Dark",
    "synopsis": "A boy with an active imagination faces his fears on an unforgettable journey through the night with his new friend: a giant, smiling creature named Dark.",
    "genre": "Animation, Family, Comedy, Fantasy",
    "release_year": "2024"
  },
  {
    "title": "Nobody",
    "synopsis": "Hutch Mansell, a suburban dad, overlooked husband, nothing neighbor — a \"nobody.\" When two thieves break into his home one night, Hutch's unknown long-simmering rage is ignited and propels him on a brutal path that will uncover dark secrets he fought to leave behind.",
    "genre": "Action, Thriller",
    "release_year": "2021"
  },
  {
    "title": "Code 8 Part II",
    "synopsis": "In a world where superpowered people are heavily policed by robots, an ex-con teams up with a drug lord he despises to protect a teen from a corrupt cop.",
    "genre": "Science Fiction, Action, Crime",
    "release_year": "2024"
  },
  {
    "title": "Natty Knocks",
    "synopsis": "On Halloween Eve, Britt and the kids she is babysitting have to survive the horror of serial killer Abner Honeywell, who is himself the traumatized son of B-movie horror legend \"Natty Knocks\".",
    "genre": "Horror, Thriller",
    "release_year": "2023"
  },
  {
    "title": "Species",
    "synopsis": "In 1993, the Search for Extra Terrestrial Intelligence Project receives a transmission detailing an alien DNA structure, along with instructions on how to splice it with human DNA. The result is Sil, a sensual but deadly creature who can change from a beautiful woman to an armour-plated killing machine in the blink of an eye.",
    "genre": "Science Fiction, Horror, Action",
    "release_year": "1995"
  },
  {
    "title": "Venom: Let There Be Carnage",
    "synopsis": "After finding a host body in investigative reporter Eddie Brock, the alien symbiote must face a new enemy, Carnage, the alter ego of serial killer Cletus Kasady.",
    "genre": "Science Fiction, Action, Adventure",
    "release_year": "2021"
  },
  {
    "title": "Too Old for Fairy Tales 2",
    "synopsis": "Your favourite gamer trio is back! This time, Waldek, Staszek and Delfina will spend an adventure-packed summer in the Tatra Mountains. During the trip, Waldek accidentally finds out that his father – the man he has heard so much about from his mum, the person who abandoned his family a long time ago – lives nearby. The boy is determined to find him and ask him about the reasons for his decision. Together with Staszek, under the cover of night, they set out on their mission. The hazards of the mountain trail, however, are nothing compared to what Delfina will have to do. The creative teenager has to hide the truth about the boys’ disappearance from her aunt, the mother of Waldek and… her new partner. How will this secret mission affect the lives of all the characters?  Will Waldek find an answer to the questions that haunt him and understand the actions of his father?",
    "genre": "Family, Comedy",
    "release_year": "2024"
  },
  {
    "title": "Harry Potter and the Philosopher's Stone",
    "synopsis": "Harry Potter has lived under the stairs at his aunt and uncle's house his whole life. But on his 11th birthday, he learns he's a powerful wizard—with a place waiting for him at the Hogwarts School of Witchcraft and Wizardry. As he learns to harness his newfound powers with the help of the school's kindly headmaster, Harry uncovers the truth about his parents' deaths—and about the villain who's to blame.",
    "genre": "Adventure, Fantasy",
    "release_year": "2001"
  },
  {
    "title": "Saw X",
    "synopsis": "Between the events of 'Saw' and 'Saw II', a sick and desperate John Kramer travels to Mexico for a risky and experimental medical procedure in hopes of a miracle cure for his cancer, only to discover the entire operation is a scam to defraud the most vulnerable. Armed with a newfound purpose, the infamous serial killer returns to his work, turning the tables on the con artists in his signature visceral way through devious, deranged, and ingenious traps.",
    "genre": "Horror, Thriller",
    "release_year": "2023"
  },
  {
    "title": "Total Recall",
    "synopsis": "Factory worker Doug Quaid takes a virtual mind-trip vacation with the Rekall company, opting for implanted memories of being a spy. When the procedure goes wrong, Quaid becomes a wanted man by the police and joins forces with a rebel fighter to stop the evil Chancellor Cohaagen.",
    "genre": "Action, Science Fiction, Thriller",
    "release_year": "2012"
  },
  {
    "title": "Fighter",
    "synopsis": "Top IAF aviators come together in the face of imminent danger, to form Air Dragons. Fighter unfolds their camaraderie, brotherhood and battles, internal and external.",
    "genre": "Action, Thriller, War",
    "release_year": "2024"
  },
  {
    "title": "The Chronicles of Narnia: The Lion, the Witch and the Wardrobe",
    "synopsis": "Siblings Lucy, Edmund, Susan and Peter step through a magical wardrobe and find the land of Narnia. There, they discover a charming, once peaceful kingdom that has been plunged into eternal winter by the evil White Witch, Jadis. Aided by the wise and magnificent lion, Aslan, the children lead Narnia into a spectacular, climactic battle to be free of the Witch's glacial powers forever.",
    "genre": "Adventure, Family, Fantasy",
    "release_year": "2005"
  },
  {
    "title": "Imaginary",
    "synopsis": "When Jessica moves back into her childhood home with her family, her youngest stepdaughter Alice develops an eerie attachment to a stuffed bear named Chauncey she finds in the basement. Alice starts playing games with Chauncey that begin playful and become increasingly sinister. As Alice’s behavior becomes more and more concerning, Jessica intervenes only to realize Chauncey is much more than the stuffed toy bear she believed him to be.",
    "genre": "Horror, Mystery, Thriller",
    "release_year": "2024"
  },
  {
    "title": "Heart of the Hunter",
    "synopsis": "A retired assassin is pulled back into action when his friend uncovers a dangerous conspiracy at the heart of the South African government.",
    "genre": "Action, Mystery, Thriller",
    "release_year": "2024"
  },
  {
    "title": "Halloween",
    "synopsis": "Fifteen years after murdering his sister on Halloween Night 1963, Michael Myers escapes from a mental hospital and returns to the small town of Haddonfield, Illinois to kill again.",
    "genre": "Horror, Thriller",
    "release_year": "1978"
  },
  {
    "title": "Thor: Love and Thunder",
    "synopsis": "After his retirement is interrupted by Gorr the God Butcher, a galactic killer who seeks the extinction of the gods, Thor Odinson enlists the help of King Valkyrie, Korg, and ex-girlfriend Jane Foster, who now wields Mjolnir as the Mighty Thor. Together they embark upon a harrowing cosmic adventure to uncover the mystery of the God Butcher’s vengeance and stop him before it’s too late.",
    "genre": "Fantasy, Action, Comedy",
    "release_year": "2022"
  },
  {
    "title": "Get Out",
    "synopsis": "Chris and his girlfriend Rose go upstate to visit her parents for the weekend. At first, Chris reads the family's overly accommodating behavior as nervous attempts to deal with their daughter's interracial relationship, but as the weekend progresses, a series of increasingly disturbing discoveries lead him to a truth that he never could have imagined.",
    "genre": "Mystery, Thriller, Horror",
    "release_year": "2017"
  },
  {
    "title": "Bad Boys",
    "synopsis": "Mick O'Brien is a young Chicago street thug torn between a life of petty crime and the love of his girlfriend. But when the heist of a local drug dealer goes tragically wrong Mick is sentenced to a brutal juvenile prison where violence is a rite of passage and respect is measured in vengeance.",
    "genre": "Crime, Drama, Thriller",
    "release_year": "1983"
  },
  {
    "title": "Love Lies Bleeding",
    "synopsis": "Reclusive gym manager Lou falls hard for Jackie, an ambitious bodybuilder headed through town to Las Vegas in pursuit of her dream. But their love ignites violence, pulling them deep into the web of Lou’s criminal family.",
    "genre": "Crime, Romance, Thriller",
    "release_year": "2024"
  },
  {
    "title": "Hacksaw Ridge",
    "synopsis": "WWII American Army Medic Desmond T. Doss, who served during the Battle of Okinawa, refuses to kill people and becomes the first Conscientious Objector in American history to receive the Congressional Medal of Honor.",
    "genre": "Drama, History, War",
    "release_year": "2016"
  },
  {
    "title": "Good Will Hunting",
    "synopsis": "When professors discover that an aimless janitor is also a math genius, a therapist helps the young man confront the demons that are holding him back.",
    "genre": "Drama",
    "release_year": "1997"
  },
  {
    "title": "Grease",
    "synopsis": "Australian good girl Sandy and greaser Danny fell in love over the summer. But when they unexpectedly discover they're now in the same high school, will they be able to rekindle their romance despite their eccentric friends?",
    "genre": "Romance, Comedy",
    "release_year": "1978"
  },
  {
    "title": "Noah's Ark",
    "synopsis": "A pair of mice attempt to board Noah's Ark: Vini, a charismatic poet with terrible stage fright, and Tito, a talented and charming guitarist. When the rains come, only one male and one female of each species is allowed on Noah's Ark. With the help of an ingenious cockroach and fate's good luck, Vini and Tito sneak their way onto the Ark and together avert a showdown among the ships carnivores and plant eaters. All the while, the animals perform a series of classic songs inspired by world renowned poet, Vinicius de Moraes. Can these talented stowaways use music to break the tension and help these cooped up creatures survive the 40 days and 40 nights together?",
    "genre": "Animation, Music, Comedy",
    "release_year": "2024"
  },
  {
    "title": "Perra Vida",
    "synopsis": "Romina, a controlling lawyer, wants her daughter's affection. She offers rent for a recovering alcoholic's dog in exchange for a fake boyfriend role. Unexpectedly, it might turn real.",
    "genre": "Comedy, Romance",
    "release_year": "2024"
  },
  {
    "title": "The Lion King",
    "synopsis": "Simba idolizes his father, King Mufasa, and takes to heart his own royal destiny. But not everyone in the kingdom celebrates the new cub's arrival. Scar, Mufasa's brother—and former heir to the throne—has plans of his own. The battle for Pride Rock is ravaged with betrayal, tragedy and drama, ultimately resulting in Simba's exile. With help from a curious pair of newfound friends, Simba will have to figure out how to grow up and take back what is rightfully his.",
    "genre": "Adventure, Drama, Family, Animation",
    "release_year": "2019"
  },
  {
    "title": "Pirates of the Caribbean: The Curse of the Black Pearl",
    "synopsis": "Jack Sparrow, a freewheeling 18th-century pirate, quarrels with a rival pirate bent on pillaging Port Royal. When the governor's daughter is kidnapped, Sparrow decides to help the girl's love save her.",
    "genre": "Adventure, Fantasy, Action",
    "release_year": "2003"
  },
  {
    "title": "The Tearsmith",
    "synopsis": "Adopted together after a tough childhood in an orphanage, Nica and Rigel realize that unexpected but irresistible feelings pull them together.",
    "genre": "Romance, Drama",
    "release_year": "2024"
  },
  {
    "title": "Black Panther: Wakanda Forever",
    "synopsis": "Queen Ramonda, Shuri, M’Baku, Okoye and the Dora Milaje fight to protect their nation from intervening world powers in the wake of King T’Challa’s death.  As the Wakandans strive to embrace their next chapter, the heroes must band together with the help of War Dog Nakia and Everett Ross and forge a new path for the kingdom of Wakanda.",
    "genre": "Action, Adventure, Science Fiction",
    "release_year": "2022"
  },
  {
    "title": "Sayen: The Huntress",
    "synopsis": "Realizing that she cannot take down Fisk alone, Sayen teams up with an underground resistance group with a plan to expose and end Fisk's unchecked plundering once and for all.",
    "genre": "Action, Thriller",
    "release_year": "2024"
  },
  {
    "title": "Titanic",
    "synopsis": "101-year-old Rose DeWitt Bukater tells the story of her life aboard the Titanic, 84 years later. A young Rose boards the ship with her mother and fiancé. Meanwhile, Jack Dawson and Fabrizio De Rossi win third-class tickets aboard the ship. Rose tells the whole story from Titanic's departure through to its death—on its first and last voyage—on April 15, 1912.",
    "genre": "Drama, Romance",
    "release_year": "1997"
  },
  {
    "title": "Stand by Me",
    "synopsis": "After learning that a boy their age has been accidentally killed near their rural homes, four Oregon boys decide to go see the body. On the way, Gordie,  Vern, Chris and Teddy encounter a mean junk man and a marsh full of leeches, as they also learn more about one another and their very different home lives. Just a lark at first, the boys' adventure evolves into a defining event in their lives.",
    "genre": "Crime, Drama",
    "release_year": "1986"
  },
  {
    "title": "The Price of Nonna's Inheritance",
    "synopsis": "When a grandmother falls for a cheeky suitor with dubious intentions, her family devises a secret plan to protect her life — and their inheritance.",
    "genre": "Comedy",
    "release_year": "2024"
  },
  {
    "title": "Your Fault",
    "synopsis": "",
    "genre": "Drama, Romance",
    "release_year": ""
  },
  {
    "title": "Float",
    "synopsis": "Waverly thought she had her future figured out, she’d start her medical residency in Toronto after a summer visit to her parents in Taipei. When her plans suddenly change, she makes an impulsive detour to a small Canadian town where she meets local lifeguard Blake. After he saves her from nearly drowning at a beach party, Blake offers to teach Waverly to swim, and as the lessons continue, the two unexpectedly find themselves falling in love.",
    "genre": "Romance, Drama",
    "release_year": "2024"
  },
  {
    "title": "Top Gun: Maverick",
    "synopsis": "After more than thirty years of service as one of the Navy’s top aviators, and dodging the advancement in rank that would ground him, Pete “Maverick” Mitchell finds himself training a detachment of TOP GUN graduates for a specialized mission the likes of which no living pilot has ever seen.",
    "genre": "Action, Drama",
    "release_year": "2022"
  },
  {
    "title": "Creed II",
    "synopsis": "Between personal obligations and training for his next big fight against an opponent with ties to his family's past, Adonis Creed is up against the challenge of his life.",
    "genre": "Drama, Action",
    "release_year": "2018"
  },
  {
    "title": "The Raffle",
    "synopsis": "Struggling with a financial crisis, a good-looking widow decides to put herself up for grabs. However, going through with it becomes almost impossible with a new love and the legal system thrown into the mix.",
    "genre": "Drama",
    "release_year": "1991"
  },
  {
    "title": "The Boy and the Heron",
    "synopsis": "While the Second World War rages, the teenage Mahito, haunted by his mother's tragic death, is relocated from Tokyo to the serene rural home of his new stepmother Natsuko, a woman who bears a striking resemblance to the boy's mother. As he tries to adjust, this strange new world grows even stranger following the appearance of a persistent gray heron, who perplexes and bedevils Mahito, dubbing him the \"long-awaited one.\"",
    "genre": "Animation, Adventure, Fantasy",
    "release_year": "2023"
  },
  {
    "title": "The Nun II",
    "synopsis": "In 1956 France, a priest is violently murdered, and Sister Irene begins to investigate. She once again comes face-to-face with a powerful evil.",
    "genre": "Horror",
    "release_year": "2023"
  },
  {
    "title": "The Adventures of Maid Marian",
    "synopsis": "Everyone knows the stories of Robin Hood and Maid Marian, but this the story of what happens next. Out of the shadows, a legend returns to save her people from the tyranny of the disgraced Sheriff of Nottingham. Robin Hood remains at war and Marian must put her own combat skills to the test, creating a new tale that will be heralded throughout the ages.",
    "genre": "Adventure, Action",
    "release_year": "2022"
  },
  {
    "title": "Kalikot",
    "synopsis": "Sal, a hot single professor, moves across an auto service shop and rocks the world of young repairman Arnel. Ever since Sal came over to get her car fixed, Arnel's skilled hands have always been busy. But can he still fix the problems that come with it?",
    "genre": "Drama",
    "release_year": "2024"
  },
  {
    "title": "Up",
    "synopsis": "Carl Fredricksen spent his entire life dreaming of exploring the globe and experiencing life to its fullest. But at age 78, life seems to have passed him by, until a twist of fate (and a persistent 8-year old Wilderness Explorer named Russell) gives him a new lease on life.",
    "genre": "Animation, Comedy, Family, Adventure",
    "release_year": "2009"
  },
  {
    "title": "The Shawshank Redemption",
    "synopsis": "Imprisoned in the 1940s for the double murder of his wife and her lover, upstanding banker Andy Dufresne begins a new life at the Shawshank prison, where he puts his accounting skills to work for an amoral warden. During his long stretch in prison, Dufresne comes to be admired by the other inmates -- including an older prisoner named Red -- for his integrity and unquenchable sense of hope.",
    "genre": "Drama, Crime",
    "release_year": "1994"
  },
  {
    "title": "Blade",
    "synopsis": "A film set in the Marvel Cinematic Universe (MCU) based on the Marvel Comics character of the same name.",
    "genre": "Fantasy",
    "release_year": "2025"
  },
  {
    "title": "Fight Club",
    "synopsis": "A ticking-time-bomb insomniac and a slippery soap salesman channel primal male aggression into a shocking new form of therapy. Their concept catches on, with underground \"fight clubs\" forming in every town, until an eccentric gets in the way and ignites an out-of-control spiral toward oblivion.",
    "genre": "Drama",
    "release_year": "1999"
  },
  {
    "title": "Halloween",
    "synopsis": "Laurie Strode comes to her final confrontation with Michael Myers, the masked figure who has haunted her since she narrowly escaped his killing spree on Halloween night four decades ago.",
    "genre": "Horror, Thriller",
    "release_year": "2018"
  },
  {
    "title": "Rise of the Planet of the Apes",
    "synopsis": "A highly intelligent chimpanzee named Caesar has been living a peaceful suburban life ever since he was born. But when he gets taken to a cruel primate facility, Caesar decides to revolt against those who have harmed him.",
    "genre": "Thriller, Action, Drama, Science Fiction",
    "release_year": "2011"
  },
  {
    "title": "Harry Potter and the Prisoner of Azkaban",
    "synopsis": "Year three at Hogwarts means new fun and challenges as Harry learns the delicate art of approaching a Hippogriff, transforming shape-shifting Boggarts into hilarity and even turning back time. But the term also brings danger: soul-sucking Dementors hover over the school, an ally of the accursed He-Who-Cannot-Be-Named lurks within the castle walls, and fearsome wizard Sirius Black escapes Azkaban. And Harry will confront them all.",
    "genre": "Adventure, Fantasy",
    "release_year": "2004"
  },
  {
    "title": "Blue Beetle",
    "synopsis": "Recent college grad Jaime Reyes returns home full of aspirations for his future, only to find that home is not quite as he left it. As he searches to find his purpose in the world, fate intervenes when Jaime unexpectedly finds himself in possession of an ancient relic of alien biotechnology: the Scarab.",
    "genre": "Action, Science Fiction, Adventure",
    "release_year": "2023"
  },
  {
    "title": "The Little Mermaid",
    "synopsis": "The youngest of King Triton’s daughters, and the most defiant, Ariel longs to find out more about the world beyond the sea, and while visiting the surface, falls for the dashing Prince Eric. With mermaids forbidden to interact with humans, Ariel makes a deal with the evil sea witch, Ursula, which gives her a chance to experience life on land, but ultimately places her life – and her father’s crown – in jeopardy.",
    "genre": "Adventure, Family, Fantasy, Romance",
    "release_year": "2023"
  },
  {
    "title": "The Maze Runner",
    "synopsis": "Set in a post-apocalyptic world, young Thomas is deposited in a community of boys after his memory is erased, soon learning they're all trapped in a maze that will require him to join forces with fellow “runners” for a shot at escape.",
    "genre": "Action, Mystery, Science Fiction, Thriller",
    "release_year": "2014"
  },
  {
    "title": "The Avengers",
    "synopsis": "When an unexpected enemy emerges and threatens global safety and security, Nick Fury, director of the international peacekeeping agency known as S.H.I.E.L.D., finds himself in need of a team to pull the world back from the brink of disaster. Spanning the globe, a daring recruitment effort begins!",
    "genre": "Science Fiction, Action, Adventure",
    "release_year": "2012"
  },
  {
    "title": "Heat",
    "synopsis": "Obsessive master thief Neil McCauley leads a top-notch crew on various daring heists throughout Los Angeles while determined detective Vincent Hanna pursues him without rest. Each man recognizes and respects the ability and the dedication of the other even though they are aware their cat-and-mouse game may end in violence.",
    "genre": "Action, Crime, Drama",
    "release_year": "1995"
  },
  {
    "title": "Chinatown",
    "synopsis": "Private eye Jake Gittes lives off of the murky moral climate of sunbaked, pre-World War II Southern California. Hired by a beautiful socialite to investigate her husband's extra-marital affair, Gittes is swept into a maelstrom of double dealings and deadly deceits, uncovering a web of personal and political scandals that come crashing together.",
    "genre": "Crime, Drama, Mystery, Thriller",
    "release_year": "1974"
  },
  {
    "title": "How to Make Millions Before Grandma Dies",
    "synopsis": "A man quits work to care for dying grandmother, motivated by her fortune. He schemes to win her favor before she passes.",
    "genre": "Drama",
    "release_year": "2024"
  },
  {
    "title": "The Strangers: Chapter 1",
    "synopsis": "After their car breaks down in an eerie small town, a young couple are forced to spend the night in a remote cabin. Panic ensues as they are terrorized by three masked strangers who strike with no mercy and seemingly no motives.",
    "genre": "Horror, Thriller",
    "release_year": "2024"
  },
  {
    "title": "Downsizing",
    "synopsis": "A kindly occupational therapist undergoes a new procedure to be shrunken to four inches tall so that he and his wife can help save the planet and afford a nice lifestyle at the same time.",
    "genre": "Drama, Science Fiction",
    "release_year": "2017"
  },
  {
    "title": "Kate",
    "synopsis": "A ruthless criminal operative has less than 24 hours to exact revenge on her enemies and in the process forms an unexpected bond with the daughter of one of her past victims.",
    "genre": "Action",
    "release_year": "2021"
  },
  {
    "title": "The Lord of the Rings: The Fellowship of the Ring",
    "synopsis": "Young hobbit Frodo Baggins, after inheriting a mysterious ring from his uncle Bilbo, must leave his home in order to keep it from falling into the hands of its evil creator. Along the way, a fellowship is formed to protect the ringbearer and make sure that the ring arrives at its final destination: Mt. Doom, the only place where it can be destroyed.",
    "genre": "Adventure, Fantasy, Action",
    "release_year": "2001"
  },
  {
    "title": "The Void",
    "synopsis": "In the middle of a routine patrol, officer Daniel Carter happens upon a blood-soaked figure limping down a deserted stretch of road. He rushes the young man to a nearby rural hospital staffed by a skeleton crew, only to discover that patients and personnel are transforming into something inhuman. As the horror intensifies, Carter leads the other survivors on a hellish voyage into the subterranean depths of the hospital in a desperate bid to end the nightmare before it's too late.",
    "genre": "Mystery, Horror, Science Fiction",
    "release_year": "2016"
  },
  {
    "title": "Badland Hunters",
    "synopsis": "After a deadly earthquake turns Seoul into a lawless badland, a fearless huntsman springs into action to rescue a teenager abducted by a mad doctor.",
    "genre": "Science Fiction, Action",
    "release_year": "2024"
  },
  {
    "title": "Courage of Lassie",
    "synopsis": "Bill's separated from his litter, making friends with the wild creatures until he's found and adopted by young Kathie. An accident separates him from her, and he's drafted into K-9 duty in the trenches until battle fatigue takes its toll and he turns vicious. And even though he finds his way back home, he may be condemned as a killer.",
    "genre": "Family, Adventure, Drama",
    "release_year": "1946"
  },
  {
    "title": "Jurassic World Dominion",
    "synopsis": "Four years after Isla Nublar was destroyed, dinosaurs now live—and hunt—alongside humans all over the world. This fragile balance will reshape the future and determine, once and for all, whether human beings are to remain the apex predators ona planet they now share with history's most fearsome creatures.",
    "genre": "Adventure, Action, Science Fiction",
    "release_year": "2022"
  },
  {
    "title": "Shrek 2",
    "synopsis": "Shrek, Fiona, and Donkey set off to Far, Far Away to meet Fiona's mother and father, the Queen and King. But not everyone is happily ever after. Shrek and the King find it difficult to get along, and there's tension in the marriage. The Fairy Godmother discovers that Fiona has married Shrek instead of her son Prince Charming and plots to destroy their marriage.",
    "genre": "Animation, Family, Comedy, Fantasy, Adventure",
    "release_year": "2004"
  },
  {
    "title": "The Golden Lotus: Love and Desire",
    "synopsis": "A corrupt local official, Xi Men Qing, who lusts after women and money, pursues his brother's young wife, Lee Ping Er. Ping finds Men attractive, and under her drunken husband's nose, she and Men work their way through the illustrations of a pillow book, the \"Golden Lotus.\" Men pursues the same feat with his fourth concubine, Pan Jing Lien, who lives in the compound next to Ping. Jing's jealousy compounds a tale of humiliation, childbirth, death, and depravity. Does karma or enlightenment await anyone?",
    "genre": "Drama, Romance",
    "release_year": "1991"
  },
  {
    "title": "Chappie",
    "synopsis": "Every child comes into the world full of promise, and none more so than Chappie: he is gifted, special, a prodigy. Like any child, Chappie will come under the influence of his surroundings—some good, some bad—and he will rely on his heart and soul to find his way in the world and become his own man. But there's one thing that makes Chappie different from any one else: he is a robot.",
    "genre": "Crime, Action, Science Fiction",
    "release_year": "2015"
  },
  {
    "title": "Napoleon",
    "synopsis": "An epic that details the checkered rise and fall of French Emperor Napoleon Bonaparte and his relentless journey to power through the prism of his addictive, volatile relationship with his wife, Josephine.",
    "genre": "History, War, Romance",
    "release_year": "2023"
  },
  {
    "title": "Total Recall",
    "synopsis": "Construction worker Douglas Quaid's obsession with the planet Mars leads him to visit Recall, a company who manufacture memories. Something goes wrong during his memory implant turning Doug's life upside down and even to question what is reality and what isn't.",
    "genre": "Action, Adventure, Science Fiction",
    "release_year": "1990"
  },
  {
    "title": "Code 8 Part II",
    "synopsis": "In a world where superpowered people are heavily policed by robots, an ex-con teams up with a drug lord he despises to protect a teen from a corrupt cop.",
    "genre": "Science Fiction, Action, Crime",
    "release_year": "2024"
  },
  {
    "title": "House on Rockingham",
    "synopsis": "After securing a job as live-in housekeeper, a woman discovers the owner may be connected to her sister's disappearance.",
    "genre": "Horror, Thriller",
    "release_year": "2024"
  },
  {
    "title": "The Void",
    "synopsis": "In the middle of a routine patrol, officer Daniel Carter happens upon a blood-soaked figure limping down a deserted stretch of road. He rushes the young man to a nearby rural hospital staffed by a skeleton crew, only to discover that patients and personnel are transforming into something inhuman. As the horror intensifies, Carter leads the other survivors on a hellish voyage into the subterranean depths of the hospital in a desperate bid to end the nightmare before it's too late.",
    "genre": "Mystery, Horror, Science Fiction",
    "release_year": "2016"
  },
  {
    "title": "Pirates of the Caribbean: The Curse of the Black Pearl",
    "synopsis": "Jack Sparrow, a freewheeling 18th-century pirate, quarrels with a rival pirate bent on pillaging Port Royal. When the governor's daughter is kidnapped, Sparrow decides to help the girl's love save her.",
    "genre": "Adventure, Fantasy, Action",
    "release_year": "2003"
  },
  {
    "title": "Blood and Snow",
    "synopsis": "Scientists find meteor in Arctic. It kills one, infects the other. Nearby base takes in survivor to investigate incident. Survivor's identity raises questions.",
    "genre": "Science Fiction, Horror",
    "release_year": "2023"
  },
  {
    "title": "Ex Machina",
    "synopsis": "Caleb, a coder at the world's largest internet company, wins a competition to spend a week at a private mountain retreat belonging to Nathan, the reclusive CEO of the company. But when Caleb arrives at the remote location he finds that he will have to participate in a strange and fascinating experiment in which he must interact with the world's first true artificial intelligence, housed in the body of a beautiful robot girl.",
    "genre": "Drama, Science Fiction",
    "release_year": "2015"
  },
  {
    "title": "Manhattan",
    "synopsis": "Manhattan explores how the life of a middle-aged television writer dating a teenage girl is further complicated when he falls in love with his best friend's mistress.",
    "genre": "Comedy, Drama, Romance",
    "release_year": "1979"
  },
  {
    "title": "Prometheus",
    "synopsis": "A team of explorers discover a clue to the origins of mankind on Earth, leading them on a journey to the darkest corners of the universe. There, they must fight a terrifying battle to save the future of the human race.",
    "genre": "Science Fiction, Adventure, Mystery",
    "release_year": "2012"
  },
  {
    "title": "The Golden Lotus: Love and Desire",
    "synopsis": "A corrupt local official, Xi Men Qing, who lusts after women and money, pursues his brother's young wife, Lee Ping Er. Ping finds Men attractive, and under her drunken husband's nose, she and Men work their way through the illustrations of a pillow book, the \"Golden Lotus.\" Men pursues the same feat with his fourth concubine, Pan Jing Lien, who lives in the compound next to Ping. Jing's jealousy compounds a tale of humiliation, childbirth, death, and depravity. Does karma or enlightenment await anyone?",
    "genre": "Drama, Romance",
    "release_year": "1991"
  },
  {
    "title": "Chappie",
    "synopsis": "Every child comes into the world full of promise, and none more so than Chappie: he is gifted, special, a prodigy. Like any child, Chappie will come under the influence of his surroundings—some good, some bad—and he will rely on his heart and soul to find his way in the world and become his own man. But there's one thing that makes Chappie different from any one else: he is a robot.",
    "genre": "Crime, Action, Science Fiction",
    "release_year": "2015"
  },
  {
    "title": "Allied",
    "synopsis": "In 1942, an intelligence officer in North Africa encounters a female French Resistance fighter on a deadly mission behind enemy lines. When they reunite in London, their relationship is tested by the pressures of war.",
    "genre": "Action, Drama, War, Romance, Thriller",
    "release_year": "2016"
  },
  {
    "title": "Emmanuelle 4",
    "synopsis": "In order to escape from her former lover Marc, Sylvia goes to Brazil where Dr. Santamo transforms her into the beautiful Emmanuelle...",
    "genre": "Drama, Romance",
    "release_year": "1984"
  },
  {
    "title": "The Boy and the Heron",
    "synopsis": "While the Second World War rages, the teenage Mahito, haunted by his mother's tragic death, is relocated from Tokyo to the serene rural home of his new stepmother Natsuko, a woman who bears a striking resemblance to the boy's mother. As he tries to adjust, this strange new world grows even stranger following the appearance of a persistent gray heron, who perplexes and bedevils Mahito, dubbing him the \"long-awaited one.\"",
    "genre": "Animation, Adventure, Fantasy",
    "release_year": "2023"
  },
  {
    "title": "Cocaine Bear",
    "synopsis": "Inspired by a true story, an oddball group of cops, criminals, tourists and teens converge in a Georgia forest where a 500-pound black bear goes on a murderous rampage after unintentionally ingesting cocaine.",
    "genre": "Thriller, Comedy, Crime",
    "release_year": "2023"
  },
  {
    "title": "I Saw the TV Glow",
    "synopsis": "Teenager Owen is just trying to make it through life in the suburbs when his classmate introduces him to a mysterious late-night TV show — a vision of a supernatural world beneath their own. In the pale glow of the television, Owen’s view of reality begins to crack.",
    "genre": "Drama, Horror",
    "release_year": "2024"
  },
  {
    "title": "Crooklyn",
    "synopsis": "From Spike Lee comes this vibrant semi-autobiographical portrait of a school-teacher, her stubborn jazz-musician husband and their five kids living in '70s Brooklyn.",
    "genre": "Comedy, Drama",
    "release_year": "1994"
  },
  {
    "title": "The Rock",
    "synopsis": "When vengeful General Francis X. Hummel seizes control of Alcatraz Island and threatens to launch missiles loaded with deadly chemical weapons into San Francisco, only a young FBI chemical weapons expert and notorious Federal prisoner have the stills to penetrate the impregnable island fortress and take him down.",
    "genre": "Action, Adventure, Thriller",
    "release_year": "1996"
  },
  {
    "title": "Arthur the King",
    "synopsis": "Over the course of ten days and 435 miles, an unbreakable bond is forged between pro adventure racer Michael Light and a scrappy street dog companion dubbed Arthur. As the team is pushed to their outer limits of endurance in the race, Arthur redefines what victory, loyalty and friendship truly mean.",
    "genre": "Adventure, Drama",
    "release_year": "2024"
  },
  {
    "title": "Rocky V",
    "synopsis": "A lifetime of taking shots has ended Rocky’s career, and a crooked accountant has left him broke. Inspired by the memory of his trainer, however, Rocky finds glory in training and takes on an up-and-coming boxer.",
    "genre": "Drama",
    "release_year": "1990"
  },
  {
    "title": "Fargo",
    "synopsis": "Jerry, a small-town Minnesota car salesman is bursting at the seams with debt... but he's got a plan. He's going to hire two thugs to kidnap his wife in a scheme to collect a hefty ransom from his wealthy father-in-law. It's going to be a snap and nobody's going to get hurt... until people start dying. Enter Police Chief Marge, a coffee-drinking, parka-wearing - and extremely pregnant - investigator who'll stop at nothing to get her man. And if you think her small-time investigative skills will give the crooks a run for their ransom... you betcha!",
    "genre": "Crime, Drama, Thriller",
    "release_year": "1996"
  },
  {
    "title": "The Witch Game",
    "synopsis": "Mara is a teenager who deeply loves everything related to the esoteric arts. On her birthday, she receives a virtual game as a gift that will lead her to live a magical and dangerous experience. Now, after starting the game, Mara must save her sister from the clutches of Satan himself. Anything can happen within the rules of the game, and Mara will have to overcome several obstacles, her own convictions and beliefs, to get her family back.",
    "genre": "Horror",
    "release_year": "2023"
  },
  {
    "title": "The Exorcism of God",
    "synopsis": "An American priest working in Mexico is considered a saint by many local parishioners. However, due to a botched exorcism, he carries a secret that’s eating him alive until he gets an opportunity to face his demon one final time.",
    "genre": "Horror, Crime, Drama, Fantasy",
    "release_year": "2022"
  },
  {
    "title": "Monsters, Inc.",
    "synopsis": "Lovable Sulley and his wisecracking sidekick Mike Wazowski are the top scare team at Monsters, Inc., the scream-processing factory in Monstropolis. When a little girl named Boo wanders into their world, it's the monsters who are scared silly, and it's up to Sulley and Mike to keep her out of sight and get her back home.",
    "genre": "Animation, Comedy, Family",
    "release_year": "2001"
  },
  {
    "title": "Sixty Minutes",
    "synopsis": "Desperate to keep custody of his daughter, a mixed martial arts fighter abandons a big match and races across Berlin to attend her birthday party.",
    "genre": "Action",
    "release_year": "2024"
  },
  {
    "title": "Predators",
    "synopsis": "A group of cold-blooded killers find themselves trapped on an alien planet to be hunted by extraterrestrial Predators.",
    "genre": "Science Fiction, Action, Thriller",
    "release_year": "2010"
  },
  {
    "title": "Sing 2",
    "synopsis": "Buster and his new cast now have their sights set on debuting a new show at the Crystal Tower Theater in glamorous Redshore City. But with no connections, he and his singers must sneak into the Crystal Entertainment offices, run by the ruthless wolf mogul Jimmy Crystal, where the gang pitches the ridiculous idea of casting the lion rock legend Clay Calloway in their show. Buster must embark on a quest to find the now-isolated Clay and persuade him to return to the stage.",
    "genre": "Animation, Family, Music, Comedy",
    "release_year": "2021"
  },
  {
    "title": "Wonder Woman 1984",
    "synopsis": "A botched store robbery places Wonder Woman in a global battle against a powerful and mysterious ancient force that puts her powers in jeopardy.",
    "genre": "Action, Adventure, Fantasy",
    "release_year": "2020"
  },
  {
    "title": "Apaixonada",
    "synopsis": "Based on the book by Cris Souza Fontes, Apaixonada tells the story of a woman who realizes how monotonous her life is. She finds herself desperate and facing an identity crisis. From then on, she is forced to begin an exciting journey of self-discovery that takes her close to all the passions that life has to offer.",
    "genre": "Comedy, Romance",
    "release_year": "2024"
  },
  {
    "title": "Origin",
    "synopsis": "While grappling with tremendous personal tragedy, writer Isabel Wilkerson sets herself on a path of global investigation and discovery.",
    "genre": "Drama",
    "release_year": "2023"
  },
  {
    "title": "Mother of the Bride",
    "synopsis": "A doting mom jets off to a tropical island resort for her daughter's wedding — only to discover the groom's father is the ex she hasn't seen in decades.",
    "genre": "Romance, Comedy",
    "release_year": "2024"
  },
  {
    "title": "Hunters",
    "synopsis": "As John T. Wrecker continues his task of protecting a group of refugees from a virus, the threat of something new and even more dangerous grows ever closer in the form of monstrous mutants.",
    "genre": "Action",
    "release_year": "2021"
  },
  {
    "title": "Argylle",
    "synopsis": "When the plots of reclusive author Elly Conway's fictional espionage novels begin to mirror the covert actions of a real-life spy organization, quiet evenings at home become a thing of the past. Accompanied by her cat Alfie and Aiden, a cat-allergic spy, Elly races across the world to stay one step ahead of the killers as the line between Conway's fictional world and her real one begins to blur.",
    "genre": "Action, Adventure, Comedy",
    "release_year": "2024"
  },
  {
    "title": "Return of the Jedi",
    "synopsis": "Luke Skywalker leads a mission to rescue his friend Han Solo from the clutches of Jabba the Hutt, while the Emperor seeks to destroy the Rebellion once and for all with a second dreaded Death Star.",
    "genre": "Adventure, Action, Science Fiction",
    "release_year": "1983"
  },
  {
    "title": "The Lion King",
    "synopsis": "A young lion prince is cast out of his pride by his cruel uncle, who claims he killed his father. While the uncle rules with an iron paw, the prince grows up beyond the Savannah, living by a philosophy: No worries for the rest of your days. But when his past comes to haunt him, the young prince must decide his fate: Will he remain an outcast or face his demons and become what he needs to be?",
    "genre": "Family, Animation, Drama",
    "release_year": "1994"
  },
  {
    "title": "Doctor Strange in the Multiverse of Madness",
    "synopsis": "Doctor Strange, with the help of mystical allies both old and new, traverses the mind-bending and dangerous alternate realities of the Multiverse to confront a mysterious new adversary.",
    "genre": "Fantasy, Action, Adventure",
    "release_year": "2022"
  },
  {
    "title": "Free Guy",
    "synopsis": "A bank teller discovers he is actually a background player in an open-world video game, and decides to become the hero of his own story. Now, in a world where there are no limits, he is determined to be the guy who saves his world his way before it's too late.",
    "genre": "Comedy, Adventure, Science Fiction",
    "release_year": "2021"
  },
  {
    "title": "Whiplash",
    "synopsis": "Under the direction of a ruthless instructor, a talented young drummer begins to pursue perfection at any cost, even his humanity.",
    "genre": "Drama, Music",
    "release_year": "2014"
  },
  {
    "title": "Ruthless",
    "synopsis": "A high school coach, whose teenage daughter was murdered, takes matters into his own hands by going after the men who kidnap his students for their sex trafficking operation.",
    "genre": "Action, Thriller",
    "release_year": "2023"
  },
  {
    "title": "Rocky IV",
    "synopsis": "Rocky Balboa proudly holds the world heavyweight boxing championship, but a new challenger has stepped forward: Ivan Drago, a six-foot-four, 261-pound fighter who has the backing of the Soviet Union.",
    "genre": "Drama",
    "release_year": "1985"
  },
  {
    "title": "Bad Boys",
    "synopsis": "Mick O'Brien is a young Chicago street thug torn between a life of petty crime and the love of his girlfriend. But when the heist of a local drug dealer goes tragically wrong Mick is sentenced to a brutal juvenile prison where violence is a rite of passage and respect is measured in vengeance.",
    "genre": "Crime, Drama, Thriller",
    "release_year": "1983"
  },
  {
    "title": "American Beauty",
    "synopsis": "Lester Burnham, a depressed suburban father in a mid-life crisis, decides to turn his hectic life around after developing an infatuation with his daughter's attractive friend.",
    "genre": "Drama",
    "release_year": "1999"
  },
  {
    "title": "Free Guy",
    "synopsis": "A bank teller discovers he is actually a background player in an open-world video game, and decides to become the hero of his own story. Now, in a world where there are no limits, he is determined to be the guy who saves his world his way before it's too late.",
    "genre": "Comedy, Adventure, Science Fiction",
    "release_year": "2021"
  },
  {
    "title": "The Dry",
    "synopsis": "Aaron Falk returns to his drought-stricken hometown to attend a tragic funeral. But his return opens a decades-old wound - the unsolved death of a teenage girl.",
    "genre": "Crime, Thriller, Mystery",
    "release_year": "2021"
  },
  {
    "title": "Napoleon",
    "synopsis": "An epic that details the checkered rise and fall of French Emperor Napoleon Bonaparte and his relentless journey to power through the prism of his addictive, volatile relationship with his wife, Josephine.",
    "genre": "History, War, Romance",
    "release_year": "2023"
  },
  {
    "title": "Last Summer",
    "synopsis": "One summer, a French teenager who has been living with his mother in the city moves in with his estranged father’s family in the countryside, where he clashes with his stepmother.",
    "genre": "Drama, Thriller",
    "release_year": "2023"
  },
  {
    "title": "The Golden Lotus: Love and Desire",
    "synopsis": "A corrupt local official, Xi Men Qing, who lusts after women and money, pursues his brother's young wife, Lee Ping Er. Ping finds Men attractive, and under her drunken husband's nose, she and Men work their way through the illustrations of a pillow book, the \"Golden Lotus.\" Men pursues the same feat with his fourth concubine, Pan Jing Lien, who lives in the compound next to Ping. Jing's jealousy compounds a tale of humiliation, childbirth, death, and depravity. Does karma or enlightenment await anyone?",
    "genre": "Drama, Romance",
    "release_year": "1991"
  },
  {
    "title": "Terminator Genisys",
    "synopsis": "The year is 2029. John Connor, leader of the resistance continues the war against the machines. At the Los Angeles offensive, John's fears of the unknown future begin to emerge when TECOM spies reveal a new plot by SkyNet that will attack him from both fronts; past and future, and will ultimately change warfare forever.",
    "genre": "Science Fiction, Action, Thriller, Adventure",
    "release_year": "2015"
  },
  {
    "title": "X-Men: Apocalypse",
    "synopsis": "After the re-emergence of the world's first mutant, world-destroyer Apocalypse, the X-Men must unite to defeat his extinction level plan.",
    "genre": "Action, Adventure, Science Fiction, Fantasy",
    "release_year": "2016"
  },
  {
    "title": "Bumblebee",
    "synopsis": "On the run in the year 1987, Bumblebee finds refuge in a junkyard in a small Californian beach town. Charlie, on the cusp of turning 18 and trying to find her place in the world, discovers Bumblebee, battle-scarred and broken.  When Charlie revives him, she quickly learns this is no ordinary yellow VW bug.",
    "genre": "Action, Adventure, Science Fiction",
    "release_year": "2018"
  },
  {
    "title": "Batman Begins",
    "synopsis": "Driven by tragedy, billionaire Bruce Wayne dedicates his life to uncovering and defeating the corruption that plagues his home, Gotham City.  Unable to work within the system, he instead creates a new identity, a symbol of fear for the criminal underworld - The Batman.",
    "genre": "Action, Crime, Drama",
    "release_year": "2005"
  },
  {
    "title": "Melancholia",
    "synopsis": "Two sisters find their already strained relationship challenged as a mysterious new planet threatens to collide with Earth.",
    "genre": "Drama, Science Fiction",
    "release_year": "2011"
  },
  {
    "title": "The Lion King",
    "synopsis": "A young lion prince is cast out of his pride by his cruel uncle, who claims he killed his father. While the uncle rules with an iron paw, the prince grows up beyond the Savannah, living by a philosophy: No worries for the rest of your days. But when his past comes to haunt him, the young prince must decide his fate: Will he remain an outcast or face his demons and become what he needs to be?",
    "genre": "Family, Animation, Drama",
    "release_year": "1994"
  },
  {
    "title": "Monkey Man",
    "synopsis": "Kid is an anonymous young man who ekes out a meager living in an underground fight club where, night after night, wearing a gorilla mask, he is beaten bloody by more popular fighters for cash. After years of suppressed rage, Kid discovers a way to infiltrate the enclave of the city’s sinister elite. As his childhood trauma boils over, his mysteriously scarred hands unleash an explosive campaign of retribution to settle the score with the men who took everything from him.",
    "genre": "Action, Thriller",
    "release_year": "2024"
  },
  {
    "title": "Monsters, Inc.",
    "synopsis": "Lovable Sulley and his wisecracking sidekick Mike Wazowski are the top scare team at Monsters, Inc., the scream-processing factory in Monstropolis. When a little girl named Boo wanders into their world, it's the monsters who are scared silly, and it's up to Sulley and Mike to keep her out of sight and get her back home.",
    "genre": "Animation, Comedy, Family",
    "release_year": "2001"
  },
  {
    "title": "Kong: Skull Island",
    "synopsis": "Explore the mysterious and dangerous home of the king of the apes as a team of explorers ventures deep inside the treacherous, primordial island.",
    "genre": "Action, Adventure, Fantasy",
    "release_year": "2017"
  },
  {
    "title": "Vampiras: The Brides",
    "synopsis": "After more than 300 years in hiding, Dracula's brides, Luna, Adriana and his new apprentice Katya, must team up once again to stop the most diabolical threat from their past, his sister Mina.",
    "genre": "Horror, Fantasy, Action, Mystery",
    "release_year": "2024"
  },
  {
    "title": "Hidden Desire",
    "synopsis": "David is sitting in a bar, musing over why he has bedded and left five or six of Asia's loveliest women in such a short time.",
    "genre": "Romance, Drama",
    "release_year": "1991"
  },
  {
    "title": "Bedspacer",
    "synopsis": "Janice's steamy obsession to imitate Lexi propels them to campus stardom. But dark secrets blur the lines between authenticity and seductive deception.",
    "genre": "Thriller, Drama",
    "release_year": "2024"
  },
  {
    "title": "Romance of the West Chamber",
    "synopsis": "Cheung, a 23-year-old unmarried travelling scholar, stops by the monastery, where he sees a beautiful woman. Against the rules, Monk Faben allows Cheung to stay and woo the girl, Ann-Ann. She is shy, and also the Prime Minister's daughter, so the wooing is arranged by Ann-Ann's maid Hung.",
    "genre": "History, Romance",
    "release_year": "1997"
  },
  {
    "title": "Iron Man",
    "synopsis": "After being held captive in an Afghan cave, billionaire engineer Tony Stark creates a unique weaponized suit of armor to fight evil.",
    "genre": "Action, Science Fiction, Adventure",
    "release_year": "2008"
  },
  {
    "title": "Hotel Transylvania: Transformania",
    "synopsis": "When Van Helsing's mysterious invention, the \"Monsterfication Ray,\" goes haywire, Drac and his monster pals are all transformed into humans, and Johnny becomes a monster. In their new mismatched bodies, Drac and Johnny must team up and race across the globe to find a cure before it's too late, and before they drive each other crazy.",
    "genre": "Animation, Comedy, Family, Adventure, Fantasy",
    "release_year": "2022"
  },
  {
    "title": "The New Mutants",
    "synopsis": "Five young mutants, just discovering their abilities while held in a secret facility against their will, fight to escape their past sins and save themselves.",
    "genre": "Science Fiction, Horror, Action, Mystery, Adventure",
    "release_year": "2020"
  },
  {
    "title": "Kong: Skull Island",
    "synopsis": "Explore the mysterious and dangerous home of the king of the apes as a team of explorers ventures deep inside the treacherous, primordial island.",
    "genre": "Action, Adventure, Fantasy",
    "release_year": "2017"
  },
  {
    "title": "Despicable Me",
    "synopsis": "Villainous Gru lives up to his reputation as a despicable, deplorable and downright unlikable guy when he hatches a plan to steal the moon from the sky. But he has a tough time staying on task after three orphans land in his care.",
    "genre": "Family, Animation, Comedy",
    "release_year": "2010"
  },
  {
    "title": "365 Days: This Day",
    "synopsis": "Laura and Massimo are back and hotter than ever. But the reunited couple's new beginning is complicated by Massimo’s family ties and a mysterious man who enters Laura’s life to win her heart and trust, at any cost.",
    "genre": "Romance, Drama",
    "release_year": "2022"
  },
  {
    "title": "Dumb and Dumber",
    "synopsis": "Lloyd and Harry are two men whose stupidity is really indescribable. When Mary, a beautiful woman, loses an important suitcase with money before she leaves for Aspen, the two friends (who have found the suitcase) decide to return it to her. After some \"adventures\" they finally get to Aspen where, using the lost money they live it up and fight for Mary's heart.",
    "genre": "Comedy",
    "release_year": "1994"
  },
  {
    "title": "Confessions of a Frustrated Housewife",
    "synopsis": "A wealthy man suffers from impotence whenever he tries to make love to his wife. Since Viagara hadn't been invented yet, his swinging liberal doctor instead recommends a strong dose of infidelity. Before long he is rolling in the hay with a young lovely and needless to say his impotence problem is cured (it's amazing that he doesn't have a heart attack though). His wife is a little bitter, however, and decides to embark on her own affair. And if you're wondering with whom, well, just look at the title.",
    "genre": "Drama",
    "release_year": "1976"
  },
  {
    "title": "Frozen",
    "synopsis": "Young princess Anna of Arendelle dreams about finding true love at her sister Elsa’s coronation. Fate takes her on a dangerous journey in an attempt to end the eternal winter that has fallen over the kingdom. She's accompanied by ice delivery man Kristoff, his reindeer Sven, and snowman Olaf. On an adventure where she will find out what friendship, courage, family, and true love really means.",
    "genre": "Animation, Family, Adventure, Fantasy",
    "release_year": "2013"
  },
  {
    "title": "Metropolis",
    "synopsis": "In a futuristic city sharply divided between the rich and the poor, the son of the city's mastermind meets a prophet who predicts the coming of a savior to mediate their differences.",
    "genre": "Drama, Science Fiction",
    "release_year": "1927"
  },
  {
    "title": "20th Century Girl",
    "synopsis": "In 1999, a teen girl keeps close tabs on a boy in school on behalf of her deeply smitten best friend – then she gets swept up in a love story of her own.",
    "genre": "Romance, Drama",
    "release_year": "2022"
  },
  {
    "title": "The Grey",
    "synopsis": "Following a grueling five-week shift at an Alaskan oil refinery, workers led by sharpshooter John Ottway are flying home for a much-needed vacation. But a brutal storm causes their plane to crash in the frozen wilderness, and only eight men, including Ottway, survive. As they trek southward toward civilization and safety, Ottway and his companions must battle mortal injuries, the icy elements, and a pack of hungry wolves.",
    "genre": "Drama, Thriller, Action, Adventure",
    "release_year": "2012"
  },
  {
    "title": "Toy Story 4",
    "synopsis": "Woody has always been confident about his place in the world and that his priority is taking care of his kid, whether that's Andy or Bonnie. But when Bonnie adds a reluctant new toy called \"Forky\" to her room, a road trip adventure alongside old and new friends will show Woody how big the world can be for a toy.",
    "genre": "Family, Adventure, Animation, Comedy, Fantasy",
    "release_year": "2019"
  },
  {
    "title": "X-Men: Apocalypse",
    "synopsis": "After the re-emergence of the world's first mutant, world-destroyer Apocalypse, the X-Men must unite to defeat his extinction level plan.",
    "genre": "Action, Adventure, Science Fiction, Fantasy",
    "release_year": "2016"
  },
  {
    "title": "The Thundermans Return",
    "synopsis": "Twins Phoebe and Max are enjoying their superhero lifestyle, but when one 'save' goes awry, the Thundermans are sent back to Hiddenville. While Hank and Barb enjoy their return, and Billy and Nora look forward to a normal high school life, Max and Phoebe are determined to regain their superhero status.",
    "genre": "Family, Science Fiction, Action, Comedy",
    "release_year": "2024"
  },
  {
    "title": "Geostorm",
    "synopsis": "After an unprecedented series of natural disasters threatened the planet, the world's leaders came together to create an intricate network of satellites to control the global climate and keep everyone safe. But now, something has gone wrong: the system built to protect Earth is attacking it, and it becomes a race against the clock to uncover the real threat before a worldwide geostorm wipes out everything and everyone along with it.",
    "genre": "Action, Science Fiction, Thriller",
    "release_year": "2017"
  },
  {
    "title": "Sonic the Hedgehog 2",
    "synopsis": "After settling in Green Hills, Sonic is eager to prove he has what it takes to be a true hero. His test comes when Dr. Robotnik returns, this time with a new partner, Knuckles, in search for an emerald that has the power to destroy civilizations. Sonic teams up with his own sidekick, Tails, and together they embark on a globe-trotting journey to find the emerald before it falls into the wrong hands.",
    "genre": "Action, Adventure, Family, Comedy",
    "release_year": "2022"
  },
  {
    "title": "Attack",
    "synopsis": "With the Parliament under siege, India’s first super soldier Arjun Shergill is tasked to get hold of the terrorists in the nick of time, save the Prime Minister from their clutches and stop a dirty bomb from exploding and destroying Delhi. Will Arjun succeed in his mission?",
    "genre": "Action, Science Fiction, Thriller",
    "release_year": "2022"
  },
  {
    "title": "Mothers' Instinct",
    "synopsis": "Alice and Celine are inseparable and share everything, from their daily routines to their secrets. Their perfect harmony is shattered when one of their sons dies in a tragic accident while under Alice’s care. Celine blames Alice for the death of her child and becomes obsessed with protecting her surviving son from any harm. Alice, on the other hand, feels guilty and paranoid that Celine is plotting to harm her and her family. A gripping battle of wills ensues as the two women spiral into madness and violence.",
    "genre": "Thriller, Drama",
    "release_year": "2024"
  },
  {
    "title": "Hustlers",
    "synopsis": "A crew of savvy former strip club employees band together to turn the tables on their Wall Street clients.",
    "genre": "Drama, Comedy, Crime",
    "release_year": "2019"
  },
  {
    "title": "The Next 365 Days",
    "synopsis": "Laura and Massimo's relationship hangs in the balance as they try to overcome trust issues while a tenacious Nacho works to push them apart.",
    "genre": "Romance, Drama",
    "release_year": "2022"
  },
  {
    "title": "Ratatouille",
    "synopsis": "Remy, a resident of Paris, appreciates good food and has quite a sophisticated palate. He would love to become a chef so he can create and enjoy culinary masterpieces to his heart's delight. The only problem is, Remy is a rat. When he winds up in the sewer beneath one of Paris' finest restaurants, the rodent gourmet finds himself ideally placed to realize his dream.",
    "genre": "Animation, Comedy, Family, Fantasy",
    "release_year": "2007"
  },
  {
    "title": "A Quiet Place Part II",
    "synopsis": "Following the events at home, the Abbott family now face the terrors of the outside world. Forced to venture into the unknown, they realize that the creatures that hunt by sound are not the only threats that lurk beyond the sand path.",
    "genre": "Science Fiction, Thriller, Horror",
    "release_year": "2021"
  },
  {
    "title": "Brightburn",
    "synopsis": "What if a child from another world crash-landed on Earth, but instead of becoming a hero to mankind, he proved to be something far more sinister?",
    "genre": "Horror, Science Fiction, Thriller, Mystery",
    "release_year": "2019"
  },
  {
    "title": "The Lord of the Rings: The Return of the King",
    "synopsis": "As armies mass for a final battle that will decide the fate of the world--and powerful, ancient forces of Light and Dark compete to determine the outcome--one member of the Fellowship of the Ring is revealed as the noble heir to the throne of the Kings of Men. Yet, the sole hope for triumph over evil lies with a brave hobbit, Frodo, who, accompanied by his loyal friend Sam and the hideous, wretched Gollum, ventures deep into the very dark heart of Mordor on his seemingly impossible quest to destroy the Ring of Power.​",
    "genre": "Adventure, Fantasy, Action",
    "release_year": "2003"
  },
  {
    "title": "Bullet Train Down",
    "synopsis": "On its maiden run, the world's fastest bullet train is rigged with a bomb that will explode if it dips below 200 mph.",
    "genre": "Action",
    "release_year": "2022"
  },
  {
    "title": "Minions: The Rise of Gru",
    "synopsis": "A fanboy of a supervillain supergroup known as the Vicious 6, Gru hatches a plan to become evil enough to join them, with the backup of his followers, the Minions.",
    "genre": "Animation, Comedy, Family, Adventure, Crime, Science Fiction",
    "release_year": "2022"
  },
  {
    "title": "Terminator Genisys",
    "synopsis": "The year is 2029. John Connor, leader of the resistance continues the war against the machines. At the Los Angeles offensive, John's fears of the unknown future begin to emerge when TECOM spies reveal a new plot by SkyNet that will attack him from both fronts; past and future, and will ultimately change warfare forever.",
    "genre": "Science Fiction, Action, Thriller, Adventure",
    "release_year": "2015"
  },
  {
    "title": "Predator 2",
    "synopsis": "A police chief in the war-torn streets of Los Angeles discovers that an extraterrestrial creature is hunting down residents - and that he is the next target.",
    "genre": "Science Fiction, Action, Thriller",
    "release_year": "1990"
  },
  {
    "title": "U Turn",
    "synopsis": "When Bobby's car breaks down in the desert while on the run from some of the bookies who have already taken two of his fingers, he becomes trapped in the nearby small town where the people are stranger than anyone he's encountered. After becoming involved with a young married woman, her husband hires Bobby to kill her. Later, she hires Bobby to kill the husband.",
    "genre": "Crime, Drama, Thriller",
    "release_year": "1997"
  },
  {
    "title": "Brats",
    "synopsis": "In the 1980s, Andrew McCarthy was part of a young generation of actors who were set to take over Hollywood after a string of successful teen movies. However, when the New York magazine cover story in 1985 dubs them the Brat Pack, stars in the making suddenly find themselves losing control over the trajectory of their careers. Now, almost forty years later, McCarthy looks to reconnect with peers and co-stars so that together they can reflect on their respective legacies.",
    "genre": "Documentary",
    "release_year": "2024"
  },
  {
    "title": "Creepshow",
    "synopsis": "Five tales in the style of classic '50s horror comics, involving a murdered man emerging from the grave, a meteor's ooze that makes everything grow, a snack for a crated creature, a scheming husband, and a malevolent millionaire with an insect phobia.",
    "genre": "Horror, Comedy",
    "release_year": "1982"
  },
  {
    "title": "Zootopia",
    "synopsis": "Determined to prove herself, Officer Judy Hopps, the first bunny on Zootopia's police force, jumps at the chance to crack her first case - even if it means partnering with scam-artist fox Nick Wilde to solve the mystery.",
    "genre": "Animation, Adventure, Family, Comedy",
    "release_year": "2016"
  },
  {
    "title": "Miraculous: Ladybug & Cat Noir, The Movie",
    "synopsis": "After a guardian of magical jewels turns an awkward girl and a popular boy into superheroes, they can never reveal their identities — even to each other.",
    "genre": "Animation, Fantasy, Action, Romance, Family",
    "release_year": "2023"
  },
  {
    "title": "The Wolf of Wall Street",
    "synopsis": "A New York stockbroker refuses to cooperate in a large securities fraud case involving corruption on Wall Street, corporate banking world and mob infiltration. Based on Jordan Belfort's autobiography.",
    "genre": "Crime, Drama, Comedy",
    "release_year": "2013"
  },
  {
    "title": "Passengers",
    "synopsis": "A spacecraft traveling to a distant colony planet and transporting thousands of people has a malfunction in its sleep chambers. As a result, two passengers are awakened 90 years early.",
    "genre": "Drama, Romance, Science Fiction",
    "release_year": "2016"
  },
  {
    "title": "Planet of the Apes",
    "synopsis": "After a spectacular crash-landing on an uncharted planet, brash astronaut Leo Davidson finds himself trapped in a savage world where talking apes dominate the human race. Desperate to find a way home, Leo must evade the invincible gorilla army led by Ruthless General Thade.",
    "genre": "Thriller, Science Fiction, Action, Adventure",
    "release_year": "2001"
  },
  {
    "title": "Pirates of the Caribbean: Dead Man's Chest",
    "synopsis": "Captain Jack Sparrow works his way out of a blood debt with the ghostly Davy Jones to avoid eternal damnation.",
    "genre": "Adventure, Fantasy, Action",
    "release_year": "2006"
  },
  {
    "title": "Spider-Man",
    "synopsis": "After being bitten by a genetically altered spider at Oscorp, nerdy but endearing high school student Peter Parker is endowed with amazing powers to become the superhero known as Spider-Man.",
    "genre": "Action, Science Fiction",
    "release_year": "2002"
  },
  {
    "title": "Angel Heart",
    "synopsis": "A down-and-out Brooklyn detective is hired to track down a singer on an odyssey that will take him through the desperate streets of Harlem, the smoke-filled jazz clubs of New Orleans, and the swamps of Louisiana and its seedy underworld of voodoo.",
    "genre": "Horror, Mystery",
    "release_year": "1987"
  },
  {
    "title": "The Voyagers",
    "synopsis": "Time jump to 1939 with teenager Max and his friends as they try to navigate Mussolini's Rome and find Max's missing brother.",
    "genre": "Fantasy, Adventure, TV Movie",
    "release_year": "2022"
  },
  {
    "title": "Fifty Shades of Grey",
    "synopsis": "When college senior Anastasia Steele steps in for her sick roommate to interview prominent businessman Christian Grey for their campus paper, little does she realize the path her life will take. Christian, as enigmatic as he is rich and powerful, finds himself strangely drawn to Ana, and she to him. Though sexually inexperienced, Ana plunges headlong into an affair -- and learns that Christian's true sexual proclivities push the boundaries of pain and pleasure.",
    "genre": "Drama, Romance, Thriller",
    "release_year": "2015"
  },
  {
    "title": "Suicide Squad",
    "synopsis": "From DC Comics comes the Suicide Squad, an antihero team of incarcerated supervillains who act as deniable assets for the United States government, undertaking high-risk black ops missions in exchange for commuted prison sentences.",
    "genre": "Action, Adventure, Fantasy",
    "release_year": "2016"
  },
  {
    "title": "Silence",
    "synopsis": "Two Jesuit priests travel to seventeenth century Japan which has, under the Tokugawa shogunate, banned Catholicism and almost all foreign contact.",
    "genre": "Drama, History",
    "release_year": "2016"
  },
  {
    "title": "Temptation of Angel",
    "synopsis": "A story of the everyday life of a couple living together, ordinary but full of warmth and love. Starring Miura and Yamaguchi's first movie since making public of their romance--their real-life story on the screen.",
    "genre": "Drama",
    "release_year": "1979"
  },
  {
    "title": "Spirited Away",
    "synopsis": "A young girl, Chihiro, becomes trapped in a strange new world of spirits. When her parents undergo a mysterious transformation, she must call upon the courage she never knew she had to free her family.",
    "genre": "Animation, Family, Fantasy",
    "release_year": "2001"
  },
  {
    "title": "Uncut Gems",
    "synopsis": "A charismatic New York City jeweler always on the lookout for the next big score makes a series of high-stakes bets that could lead to the windfall of a lifetime. Howard must perform a precarious high-wire act, balancing business, family, and encroaching adversaries on all sides in his relentless pursuit of the ultimate win.",
    "genre": "Drama, Thriller, Crime",
    "release_year": "2019"
  },
  {
    "title": "The Masked Saint",
    "synopsis": "The journey of a professional wrestler who becomes a small town pastor and moonlights as a masked vigilante fighting injustice. While facing crises at home and at the church, the Pastor must evade the police and somehow reconcile his violent secret identity with his calling as a pastor.",
    "genre": "Crime, Action",
    "release_year": "2016"
  },
  {
    "title": "The Conjuring",
    "synopsis": "Paranormal investigators Ed and Lorraine Warren work to help a family terrorized by a dark presence in their farmhouse. Forced to confront a powerful entity, the Warrens find themselves caught in the most terrifying case of their lives.",
    "genre": "Horror, Thriller",
    "release_year": "2013"
  },
  {
    "title": "The Godfather Part II",
    "synopsis": "In the continuing saga of the Corleone crime family, a young Vito Corleone grows up in Sicily and in 1910s New York. In the 1950s, Michael Corleone attempts to expand the family business into Las Vegas, Hollywood and Cuba.",
    "genre": "Drama, Crime",
    "release_year": "1974"
  },
  {
    "title": "Manhattan",
    "synopsis": "Manhattan explores how the life of a middle-aged television writer dating a teenage girl is further complicated when he falls in love with his best friend's mistress.",
    "genre": "Comedy, Drama, Romance",
    "release_year": "1979"
  },
  {
    "title": "The Dry",
    "synopsis": "Aaron Falk returns to his drought-stricken hometown to attend a tragic funeral. But his return opens a decades-old wound - the unsolved death of a teenage girl.",
    "genre": "Crime, Thriller, Mystery",
    "release_year": "2021"
  },
  {
    "title": "Beautiful Teacher in Torture Hell",
    "synopsis": "A female teacher who is skilled in kendo is assigned to a rural high school in a beautiful remote valley. But she is soon trapped in a wide conspiracy of lust and perversion by those around her.",
    "genre": "Drama, Thriller, Horror",
    "release_year": "1985"
  },
  {
    "title": "Rebel Moon - Part One: A Child of Fire",
    "synopsis": "When the ruthless forces of the Motherworld threaten a quiet farming village on a distant moon, a mysterious outsider becomes its best hope for survival.",
    "genre": "Science Fiction, Drama, Action",
    "release_year": "2023"
  },
  {
    "title": "Killers of the Flower Moon",
    "synopsis": "When oil is discovered in 1920s Oklahoma under Osage Nation land, the Osage people are murdered one by one—until the FBI steps in to unravel the mystery.",
    "genre": "Crime, History, Drama",
    "release_year": "2023"
  },
  {
    "title": "Mission: Impossible - Ghost Protocol",
    "synopsis": "Ethan Hunt and his team are racing against time to track down a dangerous terrorist named Hendricks, who has gained access to Russian nuclear launch codes and is planning a strike on the United States. An attempt to stop him ends in an explosion causing severe destruction to the Kremlin and the IMF to be implicated in the bombing, forcing the President to disavow them. No longer being aided by the government, Ethan and his team chase Hendricks around the globe, although they might still be too late to stop a disaster.",
    "genre": "Action, Thriller, Adventure",
    "release_year": "2011"
  },
  {
    "title": "The Prestige",
    "synopsis": "A mysterious story of two magicians whose intense rivalry leads them on a life-long battle for supremacy -- full of obsession, deceit and jealousy with dangerous and deadly consequences.",
    "genre": "Drama, Mystery, Science Fiction",
    "release_year": "2006"
  },
  {
    "title": "Evil Dead II",
    "synopsis": "Ash Williams and his girlfriend Linda find a log cabin in the woods with a voice recording from an archeologist who had recorded himself reciting ancient chants from \"The Book of the Dead.\" As they play the recording an evil power is unleashed taking over Linda's body.",
    "genre": "Horror, Comedy, Fantasy",
    "release_year": "1987"
  },
  {
    "title": "Batman Begins",
    "synopsis": "Driven by tragedy, billionaire Bruce Wayne dedicates his life to uncovering and defeating the corruption that plagues his home, Gotham City.  Unable to work within the system, he instead creates a new identity, a symbol of fear for the criminal underworld - The Batman.",
    "genre": "Action, Crime, Drama",
    "release_year": "2005"
  },
  {
    "title": "The General",
    "synopsis": "During America’s Civil War, Union spies steal engineer Johnny Gray's beloved locomotive, 'The General'—with Johnnie's lady love aboard an attached boxcar—and he single-handedly must do all in his power to both get The General back and to rescue Annabelle.",
    "genre": "Comedy, Action, Adventure, War",
    "release_year": "1926"
  },
  {
    "title": "Tangled",
    "synopsis": "When the kingdom's most wanted-and most charming-bandit Flynn Rider hides out in a mysterious tower, he's taken hostage by Rapunzel, a beautiful and feisty tower-bound teen with 70 feet of magical, golden hair. Flynn's curious captor, who's looking for her ticket out of the tower where she's been locked away for years, strikes a deal with the handsome thief and the unlikely duo sets off on an action-packed escapade, complete with a super-cop horse, an over-protective chameleon and a gruff gang of pub thugs.",
    "genre": "Animation, Family",
    "release_year": "2010"
  },
  {
    "title": "The Amazing Spider-Man",
    "synopsis": "Peter Parker is an outcast high schooler abandoned by his parents as a boy, leaving him to be raised by his Uncle Ben and Aunt May. Like most teenagers, Peter is trying to figure out who he is and how he got to be the person he is today. As Peter discovers a mysterious briefcase that belonged to his father, he begins a quest to understand his parents' disappearance – leading him directly to Oscorp and the lab of Dr. Curt Connors, his father's former partner. As Spider-Man is set on a collision course with Connors' alter ego, The Lizard, Peter will make life-altering choices to use his powers and shape his destiny to become a hero.",
    "genre": "Action, Adventure, Science Fiction",
    "release_year": "2012"
  },
  {
    "title": "Harry Potter and the Deathly Hallows: Part 2",
    "synopsis": "Harry, Ron and Hermione continue their quest to vanquish the evil Voldemort once and for all. Just as things begin to look hopeless for the young wizards, Harry discovers a trio of magical objects that endow him with powers to rival Voldemort's formidable skills.",
    "genre": "Fantasy, Adventure",
    "release_year": "2011"
  },
  {
    "title": "The Cloverfield Paradox",
    "synopsis": "Orbiting above a planet on the brink of war, scientists test a device to solve an energy crisis and end up face-to-face with a dark alternate reality.",
    "genre": "Horror, Science Fiction, Action",
    "release_year": "2018"
  },
  {
    "title": "Mulan",
    "synopsis": "To save her father from certain death in the army, a young woman secretly enlists in his place and becomes one of China's greatest heroines in the process.",
    "genre": "Animation, Family, Adventure",
    "release_year": "1998"
  },
  {
    "title": "City Hunter",
    "synopsis": "An exceptional marksman and hopeless playboy, private eye Ryo Saeba reluctantly forms an alliance with his late partner's sister to investigate his death.",
    "genre": "Action, Drama, Comedy",
    "release_year": "2024"
  },
  {
    "title": "The Zone of Interest",
    "synopsis": "The commandant of Auschwitz, Rudolf Höss, and his wife Hedwig, strive to build a dream life for their family in a house and garden next to the camp.",
    "genre": "History, Drama",
    "release_year": "2023"
  },
  {
    "title": "Death Whisperer",
    "synopsis": "When a remote village is plagued by a deadly curse, one brother must fight to save his family from a terrifying supernatural threat.",
    "genre": "Horror, Thriller",
    "release_year": "2023"
  },
  {
    "title": "The Conjuring: The Devil Made Me Do It",
    "synopsis": "Paranormal investigators Ed and Lorraine Warren encounter what would become one of the most sensational cases from their files. The fight for the soul of a young boy takes them beyond anything they'd ever seen before, to mark the first time in U.S. history that a murder suspect would claim demonic possession as a defense.",
    "genre": "Horror, Mystery, Thriller",
    "release_year": "2021"
  },
  {
    "title": "Mysteries of the Terracotta Warriors",
    "synopsis": "Thousands of terracotta warriors guarded the first Chinese emperor's tomb. This is their story, told through archeological evidence and reenactments.",
    "genre": "Documentary",
    "release_year": "2024"
  },
  {
    "title": "Pirates of the Caribbean: On Stranger Tides",
    "synopsis": "Captain Jack Sparrow crosses paths with a woman from his past, and he's not sure if it's love -- or if she's a ruthless con artist who's using him to find the fabled Fountain of Youth. When she forces him aboard the Queen Anne's Revenge, the ship of the formidable pirate Blackbeard, Jack finds himself on an unexpected adventure in which he doesn't know who to fear more: Blackbeard or the woman from his past.",
    "genre": "Adventure, Action, Fantasy",
    "release_year": "2011"
  },
  {
    "title": "Wind River",
    "synopsis": "An FBI agent teams with the town's veteran game tracker to investigate a murder that occurred on a Native American reservation.",
    "genre": "Crime, Drama, Mystery, Thriller",
    "release_year": "2017"
  },
  {
    "title": "American Beauty",
    "synopsis": "Lester Burnham, a depressed suburban father in a mid-life crisis, decides to turn his hectic life around after developing an infatuation with his daughter's attractive friend.",
    "genre": "Drama",
    "release_year": "1999"
  },
  {
    "title": "Ocean's Eight",
    "synopsis": "Debbie Ocean, a criminal mastermind, gathers a crew of female thieves to pull off the heist of the century at New York's annual Met Gala.",
    "genre": "Crime, Comedy, Action",
    "release_year": "2018"
  },
  {
    "title": "The Irishman",
    "synopsis": "Pennsylvania, 1956. Frank Sheeran, a war veteran of Irish origin who works as a truck driver, accidentally meets mobster Russell Bufalino. Once Frank becomes his trusted man, Bufalino sends him to Chicago with the task of helping Jimmy Hoffa, a powerful union leader related to organized crime, with whom Frank will maintain a close friendship for nearly twenty years.",
    "genre": "Crime, Drama, History",
    "release_year": "2019"
  },
  {
    "title": "Carl's Date",
    "synopsis": "Carl Fredricksen reluctantly agrees to go on a date with a lady friend—but admittedly has no idea how dating works these days. Ever the helpful friend, Dug steps in to calm Carl's pre-date jitters and offer some tried-and-true tips for making friends—if you're a dog.",
    "genre": "Animation, Adventure, Family",
    "release_year": "2023"
  },
  {
    "title": "Robot Dreams",
    "synopsis": "Dog lives in Manhattan and he's tired of being alone. One day he decides to build himself a robot, a companion. Their friendship blossoms, until they become inseparable, to the rhythm of '80s NYC. One summer night, Dog, with great sadness, is forced to abandon Robot at the beach. Will they ever meet again?",
    "genre": "Animation, Drama, Comedy, Science Fiction",
    "release_year": "2023"
  },
  {
    "title": "Ghostbusters: Afterlife",
    "synopsis": "Running out of options and money, single mum Callie sets foot in the small town of Summerville, Oklahoma, with her two teenage children, Phoebe and Trevor. And now, there is no turning back. As the family attempts to settle in the dilapidated house of Callie's eccentric late father, unexpected secrets hidden in plain sight, mysterious equipment, and a strange vehicle rotting in the barn seem to relate to the area's puzzling seismic activity, and something even more shocking: the long-forgotten Stay-Puft Marshmallow Man Incident in 1980s New York City. But there hasn't been a single ghost sighting since the bizarre events of Ghostbusters II (1989). Is history repeating itself? Will Phoebe connect the dots, give her grandfather a voice, and discover the family's connection to the original Ghostbusters (1984)?",
    "genre": "Fantasy, Comedy, Adventure, Science Fiction",
    "release_year": "2021"
  },
  {
    "title": "Sorry Angel",
    "synopsis": "Jacques is a writer living in Paris. He hasn't turned 40 but already mistrusts that the best in life is yet to come. Arthur is a student living in Brittany. He reads and smiles a lot and refuses to think that everything in life might not be possible. Jacques and Arthur will like each other. Just like in a lovely dream. Just like in a sad story.",
    "genre": "Comedy, Drama, Romance",
    "release_year": "2018"
  },
  {
    "title": "The Blues Brothers",
    "synopsis": "Jake Blues, just released from prison, puts his old band back together to save the Catholic home where he and his brother Elwood were raised.",
    "genre": "Music, Comedy, Action, Crime",
    "release_year": "1980"
  },
  {
    "title": "Indiana Jones and the Dial of Destiny",
    "synopsis": "Finding himself in a new era, and approaching retirement, Indy wrestles with fitting into a world that seems to have outgrown him. But as the tentacles of an all-too-familiar evil return in the form of an old rival, Indy must don his hat and pick up his whip once more to make sure an ancient and powerful artifact doesn't fall into the wrong hands.",
    "genre": "Adventure, Action",
    "release_year": "2023"
  },
  {
    "title": "White Chicks",
    "synopsis": "Two FBI agent brothers, Marcus and Kevin Copeland, accidentally foil a drug bust. To avoid being fired they accept a mission escorting a pair of socialites to the Hamptons--but when the girls are disfigured in a car accident, they refuse to go. Left without options, Marcus and Kevin decide to pose as the sisters, transforming themselves from black men into rich white women.",
    "genre": "Comedy, Crime",
    "release_year": "2004"
  },
  {
    "title": "Emmanuelle 7",
    "synopsis": "Through the wonders of virtual reality, Emmanuelle tries to help a former schoolmate to overcome a traumatic sexual past.",
    "genre": "Drama, Science Fiction",
    "release_year": "1993"
  },
  {
    "title": "Dora: Say Hola to Adventure!",
    "synopsis": "It’s Dora, the world’s most famous exploradora, like you’ve never seen her before! Join her and ALL her friends for BRAND NEW, magical adventures in the rainforest!",
    "genre": "Animation, Family",
    "release_year": "2023"
  },
  {
    "title": "Harry Potter and the Order of the Phoenix",
    "synopsis": "Returning for his fifth year of study at Hogwarts, Harry is stunned to find that his warnings about the return of Lord Voldemort have been ignored. Left with no choice, Harry takes matters into his own hands, training a small group of students to defend themselves against the dark arts.",
    "genre": "Adventure, Fantasy",
    "release_year": "2007"
  },
  {
    "title": "Colors of Evil: Red",
    "synopsis": "When a girl's body is found on a beach in Poland's Tricity, a prosecutor teams up with the victim's mother on an impassioned quest for the truth.",
    "genre": "Mystery, Thriller, Crime, Drama",
    "release_year": "2024"
  },
  {
    "title": "Me Before You",
    "synopsis": "A small town girl is caught between dead-end jobs. A high-profile, successful man becomes wheelchair bound following an accident. The man decides his life is not worth living until the girl is hired for six months to be his new caretaker. Worlds apart and trapped together by circumstance, the two get off to a rocky start. But the girl becomes determined to prove to the man that life is worth living and as they embark on a series of adventures together, each finds their world changing in ways neither of them could begin to imagine.",
    "genre": "Drama, Romance",
    "release_year": "2016"
  },
  {
    "title": "Rocky V",
    "synopsis": "A lifetime of taking shots has ended Rocky’s career, and a crooked accountant has left him broke. Inspired by the memory of his trainer, however, Rocky finds glory in training and takes on an up-and-coming boxer.",
    "genre": "Drama",
    "release_year": "1990"
  },
  {
    "title": "Charlie and the Chocolate Factory",
    "synopsis": "A young boy wins a tour through the most magnificent chocolate factory in the world, led by the world's most unusual candy maker.",
    "genre": "Adventure, Comedy, Family, Fantasy",
    "release_year": "2005"
  },
  {
    "title": "The Layover",
    "synopsis": "When their plane is rerouted due to a hurricane warning, two single female best friends find themselves competing for the same guy during an extended layover in St. Louis.",
    "genre": "Comedy, Romance",
    "release_year": "2017"
  },
  {
    "title": "The Dark Knight",
    "synopsis": "Batman raises the stakes in his war on crime. With the help of Lt. Jim Gordon and District Attorney Harvey Dent, Batman sets out to dismantle the remaining criminal organizations that plague the streets. The partnership proves to be effective, but they soon find themselves prey to a reign of chaos unleashed by a rising criminal mastermind known to the terrified citizens of Gotham as the Joker.",
    "genre": "Drama, Action, Crime, Thriller",
    "release_year": "2008"
  },
  {
    "title": "Godzilla vs. Kong",
    "synopsis": "In a time when monsters walk the Earth, humanity’s fight for its future sets Godzilla and Kong on a collision course that will see the two most powerful forces of nature on the planet collide in a spectacular battle for the ages.",
    "genre": "Action, Science Fiction, Adventure",
    "release_year": "2021"
  },
  {
    "title": "Die Hart",
    "synopsis": "Kevin Hart - playing a version of himself - is on a death-defying quest to become an action star. And with a little help from John Travolta, Nathalie Emmanuel, and Josh Hartnett - he just might pull it off.",
    "genre": "Comedy, Action, Thriller",
    "release_year": "2023"
  },
  {
    "title": "Gato Galáctico e o Feitiço do Tempo",
    "synopsis": "",
    "genre": "Adventure",
    "release_year": "2024"
  },
  {
    "title": "Jade",
    "synopsis": "Jade presents the story of a woman who comes between a powerful businessman and a gang leader in their search for a hard drive that could damage the operations of Interpol. Despite grieving for the brother she accidentally killed, the woman is required to use her unique set of skills to retrieve the drive and protect her brother's unborn child being carried by another woman.",
    "genre": "Action, Thriller",
    "release_year": "2024"
  },
  {
    "title": "The Departed",
    "synopsis": "To take down South Boston's Irish Mafia, the police send in one of their own to infiltrate the underworld, not realizing the syndicate has done likewise. While an undercover cop curries favor with the mob kingpin, a career criminal rises through the police ranks. But both sides soon discover there's a mole among them.",
    "genre": "Drama, Thriller, Crime",
    "release_year": "2006"
  },
  {
    "title": "Infested",
    "synopsis": "Residents of a rundown French apartment building battle against an army of deadly, rapidly reproducing spiders.",
    "genre": "Horror",
    "release_year": "2023"
  },
  {
    "title": "Forrest Gump",
    "synopsis": "A man with a low IQ has accomplished great things in his life and been present during significant historic events—in each case, far exceeding what anyone imagined he could do. But despite all he has achieved, his one true love eludes him.",
    "genre": "Comedy, Drama, Romance",
    "release_year": "1994"
  },
  {
    "title": "Nightman",
    "synopsis": "A young pregnant woman discovers that her perfect boyfriend may be a dangerous sleepwalker when she finds out of strange disappearances and murders taking place in the region.",
    "genre": "Thriller, Horror",
    "release_year": "2023"
  },
  {
    "title": "To Be Twenty",
    "synopsis": "Lia and Tina are two beautiful girls who meet and realize that they have a lot in common. They are both young, beautiful and pissed off, so they decide to hitchhike their way to Rome to find Nazariota's commune, a place to stay for free and have all the sex they want... or so they think. Things don't go as they have planned though, and soon they become involved in prostitution, the police and an aggressive gang.",
    "genre": "Comedy",
    "release_year": "1978"
  },
  {
    "title": "Big Hero 6",
    "synopsis": "A special bond develops between plus-sized inflatable robot Baymax, and prodigy Hiro Hamada, who team up with a group of friends to form a band of high-tech heroes.",
    "genre": "Adventure, Family, Animation, Action, Comedy",
    "release_year": "2014"
  },
  {
    "title": "Harry Potter and the Deathly Hallows: Part 1",
    "synopsis": "Harry, Ron and Hermione walk away from their last year at Hogwarts to find and destroy the remaining Horcruxes, putting an end to Voldemort's bid for immortality. But with Harry's beloved Dumbledore dead and Voldemort's unscrupulous Death Eaters on the loose, the world is more dangerous than ever.",
    "genre": "Adventure, Fantasy",
    "release_year": "2010"
  },
  {
    "title": "Real Steel",
    "synopsis": "Charlie Kenton is a washed-up fighter who retired from the ring when robots took over the sport. After his robot is trashed, he reluctantly teams up with his estranged son to rebuild and train an unlikely contender.",
    "genre": "Action, Science Fiction, Drama",
    "release_year": "2011"
  },
  {
    "title": "Deep Fear",
    "synopsis": "A solo trip aboard a yacht takes a terrifying turn when a woman encounters three drug traffickers clinging to the shattered remains of a boat. They soon force her to dive into shark-infested waters to retrieve kilos of cocaine from the sunken wreck.",
    "genre": "Horror, Thriller, Action, Mystery",
    "release_year": "2023"
  },
  {
    "title": "Super Furball Saves the Future",
    "synopsis": "To save the world, Super Furball has to save the bees. In order to do so, the heroic guinea pig has to redeem the biggest bully in school.",
    "genre": "Family, Adventure",
    "release_year": "2022"
  },
  {
    "title": "Elevator Game",
    "synopsis": "Socially awkward teenager Ryan discovers that the night his sister disappeared, she had played 'The Elevator Game' — a ritual conducted in an elevator in which players attempt to travel to another dimension using a set of rules found online. Ignoring warnings, he resolves to follow and find her.",
    "genre": "Horror",
    "release_year": "2023"
  },
  {
    "title": "Ice Age",
    "synopsis": "With the impending ice age almost upon them, a mismatched trio of prehistoric critters – Manny the woolly mammoth, Diego the saber-toothed tiger and Sid the giant sloth – find an orphaned infant and decide to return it to its human parents. Along the way, the unlikely allies become friends but, when enemies attack, their quest takes on far nobler aims.",
    "genre": "Animation, Comedy, Family, Adventure",
    "release_year": "2002"
  },
  {
    "title": "Don't Look at the Demon",
    "synopsis": "A spiritual medium leads a paranormal investigative TV crew to a haunted home only to discover that the evil spirit she’s facing holds the key to her troubled past.",
    "genre": "Horror",
    "release_year": "2022"
  },
  {
    "title": "John Wick: Chapter 3 - Parabellum",
    "synopsis": "Super-assassin John Wick returns with a $14 million price tag on his head and an army of bounty-hunting killers on his trail. After killing a member of the shadowy international assassin’s guild, the High Table, John Wick is excommunicado, but the world’s most ruthless hit men and women await his every turn.",
    "genre": "Action, Thriller, Crime",
    "release_year": "2019"
  },
  {
    "title": "Taken 3",
    "synopsis": "Ex-government operative Bryan Mills finds his life is shattered when he's falsely accused of a murder that hits close to home. As he's pursued by a savvy police inspector, Mills employs his particular set of skills to track the real killer and exact his unique brand of justice.",
    "genre": "Thriller, Action",
    "release_year": "2014"
  },
  {
    "title": "Jigsaw",
    "synopsis": "Law enforcement finds itself chasing the ghost of a man dead for over a decade, embroiled in a diabolical new game that's only just begun.",
    "genre": "Horror, Mystery, Thriller",
    "release_year": "2017"
  },
  {
    "title": "True Romance",
    "synopsis": "Clarence marries hooker Alabama, steals cocaine from her pimp, and tries to sell it in Hollywood, while the owners of the coke try to reclaim it.",
    "genre": "Action, Crime, Romance",
    "release_year": "1993"
  },
  {
    "title": "Mission: Impossible - Fallout",
    "synopsis": "When an IMF mission ends badly, the world is faced with dire consequences. As Ethan Hunt takes it upon himself to fulfill his original briefing, the CIA begin to question his loyalty and his motives. The IMF team find themselves in a race against time, hunted by assassins while trying to prevent a global catastrophe.",
    "genre": "Action, Adventure",
    "release_year": "2018"
  },
  {
    "title": "Pleasure",
    "synopsis": "19 year old Linnéa leaves her small town in Sweden and heads for Los Angeles with the aim of becoming the world's next big porn star, but the road to her goal turns out to be bumpier than she imagined.",
    "genre": "Drama",
    "release_year": "2021"
  },
  {
    "title": "Highlander",
    "synopsis": "He fought his first battle on the Scottish Highlands in 1536. He will fight his greatest battle on the streets of New York City in 1986. His name is Connor MacLeod. He is immortal.",
    "genre": "Adventure, Action, Fantasy",
    "release_year": "1986"
  },
  {
    "title": "The Little Mermaid",
    "synopsis": "This colorful adventure tells the story of an impetuous mermaid princess named Ariel who falls in love with the very human Prince Eric and puts everything on the line for the chance to be with him. Memorable songs and characters -- including the villainous sea witch Ursula.",
    "genre": "Animation, Family, Fantasy",
    "release_year": "1989"
  },
  {
    "title": "Fury",
    "synopsis": "In the last months of World War II, as the Allies make their final push in the European theatre, a battle-hardened U.S. Army sergeant named 'Wardaddy' commands a Sherman tank called 'Fury' and its five-man crew on a deadly mission behind enemy lines. Outnumbered and outgunned, Wardaddy and his men face overwhelming odds in their heroic attempts to strike at the heart of Nazi Germany.",
    "genre": "War, Drama, Action",
    "release_year": "2014"
  },
  {
    "title": "Red Sparrow",
    "synopsis": "Prima ballerina Dominika Egorova faces a bleak and uncertain future after she suffers an injury that ends her career. She soon turns to Sparrow School, a secret intelligence service that trains exceptional young people to use their minds and bodies as weapons. Dominika emerges as the most dangerous Sparrow after completing the sadistic training process. As she comes to terms with her new abilities, she meets a CIA agent who tries to convince her that he is the only person she can trust.",
    "genre": "Thriller, Mystery",
    "release_year": "2018"
  },
  {
    "title": "Chicken Run: Dawn of the Nugget",
    "synopsis": "A band of fearless chickens flock together to save poultry-kind from an unsettling new threat: a nearby farm that's cooking up something suspicious.",
    "genre": "Family, Animation, Adventure, Comedy",
    "release_year": "2023"
  },
  {
    "title": "Avatar",
    "synopsis": "In the 22nd century, a paraplegic Marine is dispatched to the moon Pandora on a unique mission, but becomes torn between following orders and protecting an alien civilization.",
    "genre": "Action, Adventure, Fantasy, Science Fiction",
    "release_year": "2009"
  },
  {
    "title": "The Predator",
    "synopsis": "When a young boy accidentally triggers the universe's most lethal hunters' return to Earth, only a ragtag crew of ex-soldiers and a disgruntled scientist can prevent the end of the human race.",
    "genre": "Science Fiction, Action, Adventure",
    "release_year": "2018"
  },
  {
    "title": "Tangled",
    "synopsis": "When the kingdom's most wanted-and most charming-bandit Flynn Rider hides out in a mysterious tower, he's taken hostage by Rapunzel, a beautiful and feisty tower-bound teen with 70 feet of magical, golden hair. Flynn's curious captor, who's looking for her ticket out of the tower where she's been locked away for years, strikes a deal with the handsome thief and the unlikely duo sets off on an action-packed escapade, complete with a super-cop horse, an over-protective chameleon and a gruff gang of pub thugs.",
    "genre": "Animation, Family",
    "release_year": "2010"
  },
  {
    "title": "Harry Potter and the Half-Blood Prince",
    "synopsis": "As Lord Voldemort tightens his grip on both the Muggle and wizarding worlds, Hogwarts is no longer a safe haven. Harry suspects perils may even lie within the castle, but Dumbledore is more intent upon preparing him for the final battle fast approaching. Together they work to find the key to unlock Voldemorts defenses and to this end, Dumbledore recruits his old friend and colleague Horace Slughorn, whom he believes holds crucial information. Even as the decisive showdown looms, romance blossoms for Harry, Ron, Hermione and their classmates. Love is in the air, but danger lies ahead and Hogwarts may never be the same again.",
    "genre": "Adventure, Fantasy",
    "release_year": "2009"
  },
  {
    "title": "Highlander",
    "synopsis": "He fought his first battle on the Scottish Highlands in 1536. He will fight his greatest battle on the streets of New York City in 1986. His name is Connor MacLeod. He is immortal.",
    "genre": "Adventure, Action, Fantasy",
    "release_year": "1986"
  },
  {
    "title": "The Witch Game",
    "synopsis": "Mara is a teenager who deeply loves everything related to the esoteric arts. On her birthday, she receives a virtual game as a gift that will lead her to live a magical and dangerous experience. Now, after starting the game, Mara must save her sister from the clutches of Satan himself. Anything can happen within the rules of the game, and Mara will have to overcome several obstacles, her own convictions and beliefs, to get her family back.",
    "genre": "Horror",
    "release_year": "2023"
  },
  {
    "title": "The Voyagers",
    "synopsis": "Time jump to 1939 with teenager Max and his friends as they try to navigate Mussolini's Rome and find Max's missing brother.",
    "genre": "Fantasy, Adventure, TV Movie",
    "release_year": "2022"
  },
  {
    "title": "City Hunter",
    "synopsis": "An exceptional marksman and hopeless playboy, private eye Ryo Saeba reluctantly forms an alliance with his late partner's sister to investigate his death.",
    "genre": "Action, Drama, Comedy",
    "release_year": "2024"
  },
  {
    "title": "Rebel Moon - Part One: A Child of Fire",
    "synopsis": "When the ruthless forces of the Motherworld threaten a quiet farming village on a distant moon, a mysterious outsider becomes its best hope for survival.",
    "genre": "Science Fiction, Drama, Action",
    "release_year": "2023"
  },
  {
    "title": "Carmen 1945",
    "synopsis": "Prostitutes in burnt out Tokyo ghetto of post-WWII Japan peddle their flesh and save one-third of their money for a proposed dancehall to be named Paradise. The hookers live in a bombed-out building, but they accept the precarious situation with typical resolve.",
    "genre": "Drama",
    "release_year": "1988"
  },
  {
    "title": "Bohemian Rhapsody",
    "synopsis": "Singer Freddie Mercury, guitarist Brian May, drummer Roger Taylor and bass guitarist John Deacon take the music world by storm when they form the rock 'n' roll band Queen in 1970. Hit songs become instant classics. When Mercury's increasingly wild lifestyle starts to spiral out of control, Queen soon faces its greatest challenge yet – finding a way to keep the band together amid the success and excess.",
    "genre": "Music, Drama",
    "release_year": "2018"
  },
  {
    "title": "Spider-Man",
    "synopsis": "After being bitten by a genetically altered spider at Oscorp, nerdy but endearing high school student Peter Parker is endowed with amazing powers to become the superhero known as Spider-Man.",
    "genre": "Action, Science Fiction",
    "release_year": "2002"
  },
  {
    "title": "Japanese Mom",
    "synopsis": "\"Innocent face, D-cup breasts and perfect intercourse skills! Son, this is not your girlfriend anymore but your mother!\"  Ki-ho brings Yuki from Japan to marry her. However, he starts cheating on her with his ex-girlfriend in Korea.  Min-cheol comforted Yuki and thought of her as his daughter-in-law, but one day he realizes he is looking at her as a woman.  In the end, Yuki and Min-cheol have intercourse without Ki-ho knowing...",
    "genre": "Romance, Drama",
    "release_year": "2017"
  },
  {
    "title": "To Be Twenty",
    "synopsis": "Lia and Tina are two beautiful girls who meet and realize that they have a lot in common. They are both young, beautiful and pissed off, so they decide to hitchhike their way to Rome to find Nazariota's commune, a place to stay for free and have all the sex they want... or so they think. Things don't go as they have planned though, and soon they become involved in prostitution, the police and an aggressive gang.",
    "genre": "Comedy",
    "release_year": "1978"
  },
  {
    "title": "The Exorcism of God",
    "synopsis": "An American priest working in Mexico is considered a saint by many local parishioners. However, due to a botched exorcism, he carries a secret that’s eating him alive until he gets an opportunity to face his demon one final time.",
    "genre": "Horror, Crime, Drama, Fantasy",
    "release_year": "2022"
  },
  {
    "title": "Bad Behaviour",
    "synopsis": "Lucy, a former child actor, seeks enlightenment at a retreat led by spiritual leader Elon while she navigates her close yet turbulent relationship with her stunt-performer daughter, Dylan.",
    "genre": "Drama, Comedy",
    "release_year": "2023"
  },
  {
    "title": "Pirates of the Caribbean: At World's End",
    "synopsis": "Captain Barbossa, long believed to be dead, has come back to life and is headed to the edge of the Earth with Will Turner and Elizabeth Swann. But nothing is quite as it seems.",
    "genre": "Adventure, Fantasy, Action",
    "release_year": "2007"
  },
  {
    "title": "Solaris",
    "synopsis": "A troubled psychologist is sent to investigate the crew of an isolated research station orbiting a bizarre planet.",
    "genre": "Drama, Science Fiction, Mystery",
    "release_year": "2002"
  },
  {
    "title": "Beautiful Teacher in Torture Hell",
    "synopsis": "A female teacher who is skilled in kendo is assigned to a rural high school in a beautiful remote valley. But she is soon trapped in a wide conspiracy of lust and perversion by those around her.",
    "genre": "Drama, Thriller, Horror",
    "release_year": "1985"
  },
  {
    "title": "Sorry Angel",
    "synopsis": "Jacques is a writer living in Paris. He hasn't turned 40 but already mistrusts that the best in life is yet to come. Arthur is a student living in Brittany. He reads and smiles a lot and refuses to think that everything in life might not be possible. Jacques and Arthur will like each other. Just like in a lovely dream. Just like in a sad story.",
    "genre": "Comedy, Drama, Romance",
    "release_year": "2018"
  },
  {
    "title": "White Chicks",
    "synopsis": "Two FBI agent brothers, Marcus and Kevin Copeland, accidentally foil a drug bust. To avoid being fired they accept a mission escorting a pair of socialites to the Hamptons--but when the girls are disfigured in a car accident, they refuse to go. Left without options, Marcus and Kevin decide to pose as the sisters, transforming themselves from black men into rich white women.",
    "genre": "Comedy, Crime",
    "release_year": "2004"
  },
  {
    "title": "Wrath of Man",
    "synopsis": "A cold and mysterious new security guard for a Los Angeles cash truck company surprises his co-workers when he unleashes precision skills during a heist. The crew is left wondering who he is and where he came from. Soon, the marksman's ultimate motive becomes clear as he takes dramatic and irrevocable steps to settle a score.",
    "genre": "Action, Crime, Thriller",
    "release_year": "2021"
  },
  {
    "title": "Soul",
    "synopsis": "Joe Gardner is a middle school teacher with a love for jazz music. After a successful audition at the Half Note Club, he suddenly gets into an accident that separates his soul from his body and is transported to the You Seminar, a center in which souls develop and gain passions before being transported to a newborn child. Joe must enlist help from the other souls-in-training, like 22, a soul who has spent eons in the You Seminar, in order to get back to Earth.",
    "genre": "Animation, Family, Comedy, Fantasy",
    "release_year": "2020"
  },
  {
    "title": "Terminator 2: Judgment Day",
    "synopsis": "Set ten years after the events of the original, James Cameron’s classic sci-fi action flick tells the story of a second attempt to get the rid of rebellion leader John Connor, this time targeting the boy himself. However, the rebellion has sent a reprogrammed terminator to protect Connor.",
    "genre": "Action, Thriller, Science Fiction",
    "release_year": "1991"
  },
  {
    "title": "Vina: Sebelum 7 Hari",
    "synopsis": "Victim of atrocities by motorbike gangs in Cirebon, VINA did not accept that her death was called a single accident. Her spirit enters to reveal the facts. Before 7 Days, what actually happened?",
    "genre": "Crime, Horror, Drama, Mystery, Thriller",
    "release_year": "2024"
  },
  {
    "title": "Despicable Me 2",
    "synopsis": "Gru is recruited by the Anti-Villain League to help deal with a powerful new super criminal.",
    "genre": "Animation, Comedy, Family",
    "release_year": "2013"
  },
  {
    "title": "Evil Dead Rise",
    "synopsis": "A reunion between two estranged sisters gets cut short by the rise of flesh-possessing demons, thrusting them into a primal battle for survival as they face the most nightmarish version of family imaginable.",
    "genre": "Horror, Thriller",
    "release_year": "2023"
  },
  {
    "title": "The Fifth Element",
    "synopsis": "In 2257, a taxi driver is unintentionally given the task of saving a young girl who is part of the key that will ensure the survival of humanity.",
    "genre": "Adventure, Fantasy, Action, Thriller, Science Fiction",
    "release_year": "1997"
  },
  {
    "title": "Blade Runner 2049",
    "synopsis": "Thirty years after the events of the first film, a new blade runner, LAPD Officer K, unearths a long-buried secret that has the potential to plunge what's left of society into chaos. K's discovery leads him on a quest to find Rick Deckard, a former LAPD blade runner who has been missing for 30 years.",
    "genre": "Science Fiction, Drama",
    "release_year": "2017"
  },
  {
    "title": "Ruby Gillman, Teenage Kraken",
    "synopsis": "Ruby Gillman, a sweet and awkward high school student, discovers she's a direct descendant of the warrior kraken queens. The kraken are sworn to protect the oceans of the world against the vain, power-hungry mermaids. Destined to inherit the throne from her commanding grandmother, Ruby must use her newfound powers to protect those she loves most.",
    "genre": "Animation, Family, Fantasy, Comedy",
    "release_year": "2023"
  },
  {
    "title": "Contagion",
    "synopsis": "As an epidemic of a lethal airborne virus - that kills within days - rapidly grows, the worldwide medical community races to find a cure and control the panic that spreads faster than the virus itself.",
    "genre": "Drama, Thriller, Science Fiction",
    "release_year": "2011"
  },
  {
    "title": "The Exorcism of Hannah Stevenson",
    "synopsis": "Hannah and Matt, a young couple on their first holiday together, quickly discover that they may not see eye-to-eye. Feeling as though she let her boyfriend down, Hannah enlists the help of a mysterious gypsy woman, in the hope that the couple's troubles can be overcome. However, when Matt wakes to find his girlfriend has disappeared, the gypsy woman's sinister intentions become all too clear.",
    "genre": "Fantasy, Horror",
    "release_year": "2022"
  },
  {
    "title": "Suburbicon",
    "synopsis": "In the quiet family town of Suburbicon during the 1950s, the best and worst of humanity is hilariously reflected through the deeds of seemingly ordinary people. When a home invasion turns deadly, a picture-perfect family turns to blackmail, revenge and murder.",
    "genre": "Thriller, Crime, Drama, Mystery",
    "release_year": "2017"
  },
  {
    "title": "Cop Land",
    "synopsis": "Freddy Heflin is the sheriff of a place everyone calls “Cop Land” — a small and seemingly peaceful town populated by the big city police officers he’s long admired. Yet something ugly is taking place behind the town’s peaceful facade. And when Freddy uncovers a massive, deadly conspiracy among these local residents, he is forced to take action and make a dangerous choice between protecting his idols and upholding the law.",
    "genre": "Crime, Drama, Mystery",
    "release_year": "1997"
  },
  {
    "title": "Monkey Man",
    "synopsis": "Kid is an anonymous young man who ekes out a meager living in an underground fight club where, night after night, wearing a gorilla mask, he is beaten bloody by more popular fighters for cash. After years of suppressed rage, Kid discovers a way to infiltrate the enclave of the city’s sinister elite. As his childhood trauma boils over, his mysteriously scarred hands unleash an explosive campaign of retribution to settle the score with the men who took everything from him.",
    "genre": "Action, Thriller",
    "release_year": "2024"
  },
  {
    "title": "The Pope's Exorcist",
    "synopsis": "Father Gabriele Amorth, Chief Exorcist of the Vatican, investigates a young boy's terrifying possession and ends up uncovering a centuries-old conspiracy the Vatican has desperately tried to keep hidden.",
    "genre": "Horror, Thriller",
    "release_year": "2023"
  },
  {
    "title": "Django Unchained",
    "synopsis": "With the help of a German bounty hunter, a freed slave sets out to rescue his wife from a brutal Mississippi plantation owner.",
    "genre": "Drama, Western",
    "release_year": "2012"
  },
  {
    "title": "Mavka: The Forest Song",
    "synopsis": "Forest soul Mavka faces an impossible choice between her heart and her duty as guardian to the Heart of the Forest, when she falls in love with the talented young human musician Lukas.",
    "genre": "Animation, Adventure, Family, Fantasy",
    "release_year": "2023"
  },
  {
    "title": "Kung Fu Panda",
    "synopsis": "When the Valley of Peace is threatened, lazy Po the panda discovers his destiny as the \"chosen one\" and trains to become a kung fu hero, but transforming the unsleek slacker into a brave warrior won't be easy. It's up to Master Shifu and the Furious Five -- Tigress, Crane, Mantis, Viper and Monkey -- to give it a try.",
    "genre": "Action, Adventure, Animation, Family, Comedy",
    "release_year": "2008"
  },
  {
    "title": "Maid in Sweden",
    "synopsis": "Schoolgirl Inga goes to visit her sister in Stockholm and is shocked to find her living with her boyfriend, Casten.",
    "genre": "Drama",
    "release_year": "1971"
  },
  {
    "title": "The Lost Boys",
    "synopsis": "When an unsuspecting town newcomer is drawn to local blood fiends, the Frog brothers and other unlikely heroes gear up to rescue him.",
    "genre": "Horror, Comedy, Thriller",
    "release_year": "1987"
  },
  {
    "title": "L.E.T.H.A.L. Ladies: Return to Savage Beach",
    "synopsis": "A stolen computer disk contains the location of a hidden tresaure trove. It's up to the sexy ladies of LETHAL (Legion to Ensure Total Harmony and Law) to find the treasure before the bad guys do.",
    "genre": "Action, Thriller",
    "release_year": "1998"
  },
  {
    "title": "Ted 2",
    "synopsis": "Newlywed couple Ted and Tami-Lynn want to have a baby, but in order to qualify to be a parent, Ted will have to prove he's a person in a court of law.",
    "genre": "Comedy, Fantasy",
    "release_year": "2015"
  },
  {
    "title": "Fast & Furious Presents: Hobbs & Shaw",
    "synopsis": "Ever since US Diplomatic Security Service Agent Hobbs and lawless outcast Shaw first faced off, they just have traded smack talk and body blows. But when cyber-genetically enhanced anarchist Brixton's ruthless actions threaten the future of humanity, they join forces to defeat him.",
    "genre": "Action, Adventure, Comedy",
    "release_year": "2019"
  },
  {
    "title": "Air Force One Down",
    "synopsis": "On her first assignment aboard Air Force One, a rookie Secret Service agent faces the ultimate test when terrorists hijack the plane, intent on derailing a pivotal energy deal. With the President's life on the line and a global crisis at stake, her bravery and skills are pushed to the limit in a relentless battle that could change the course of history.",
    "genre": "Action, Thriller",
    "release_year": "2024"
  },
  {
    "title": "Bob Marley: One Love",
    "synopsis": "Jamaican singer-songwriter Bob Marley overcomes adversity to become the most famous reggae musician in the world.",
    "genre": "Music, History, Drama",
    "release_year": "2024"
  },
  {
    "title": "Psycho",
    "synopsis": "When larcenous real estate clerk Marion Crane goes on the lam with a wad of cash and hopes of starting a new life, she ends up at the notorious Bates Motel, where manager Norman Bates cares for his housebound mother.",
    "genre": "Horror, Thriller, Mystery",
    "release_year": "1960"
  },
  {
    "title": "The Promised Land",
    "synopsis": "Denmark, 1755. Captain Ludvig Kahlen sets out to conquer a Danish heath reputed to be uncultivable, with an impossible goal: to establish a colony in the name of the king, in exchange for a royal title. A single-minded ambition that the ruthless lord of the region will relentlessly seek to put down. Kahlen's fate hangs in the balance: will his endevours bring him wealth and honour, or cost him his life...?",
    "genre": "History, Drama",
    "release_year": "2023"
  },
  {
    "title": "Cars 2",
    "synopsis": "Star race car Lightning McQueen and his pal Mater head overseas to compete in the World Grand Prix race. But the road to the championship becomes rocky as Mater gets caught up in an intriguing adventure of his own: international espionage.",
    "genre": "Animation, Family, Adventure, Comedy",
    "release_year": "2011"
  },
  {
    "title": "Blood and Snow",
    "synopsis": "Scientists find meteor in Arctic. It kills one, infects the other. Nearby base takes in survivor to investigate incident. Survivor's identity raises questions.",
    "genre": "Science Fiction, Horror",
    "release_year": "2023"
  },
  {
    "title": "Demon Slayer: Kimetsu no Yaiba Sibling's Bond",
    "synopsis": "Tanjiro finds his family slaughtered and the lone survivor, his sister Nezuko Kamado, turned into a Demon. To his surprise, however, Nezuko still shows signs of human emotion and thought. Thus begins Tanjiro's journey to seek out the Demon who killed their family and turn his sister human again. A recap film of Kimetsu no Yaiba, covering episodes 1-5 with extra footage.",
    "genre": "Action, Animation, Fantasy",
    "release_year": "2019"
  },
  {
    "title": "The Pig, the Snake and the Pigeon",
    "synopsis": "The arrogant, third most-wanted criminal in Taiwan, decides to get rid of the top two competitors and crowns himself the most-wanted criminal before dying.",
    "genre": "Action, Crime",
    "release_year": "2023"
  },
  {
    "title": "The Island",
    "synopsis": "In 2019, Lincoln Six-Echo is a resident of a seemingly \"Utopian\" but contained facility. Like all of the inhabitants of this carefully-controlled environment, Lincoln hopes to be chosen to go to The Island — reportedly the last uncontaminated location on the planet. But Lincoln soon discovers that everything about his existence is a lie.",
    "genre": "Action, Thriller, Science Fiction, Adventure",
    "release_year": "2005"
  },
  {
    "title": "Toy Story 2",
    "synopsis": "Andy heads off to Cowboy Camp, leaving his toys to their own devices. Things shift into high gear when an obsessive toy collector named Al McWhiggen, owner of Al's Toy Barn kidnaps Woody. Andy's toys mount a daring rescue mission, Buzz Lightyear meets his match and Woody has to decide where he and his heart truly belong.",
    "genre": "Animation, Comedy, Family",
    "release_year": "1999"
  },
  {
    "title": "Triple Oh!",
    "synopsis": "In this dark comedy-drama, a mismatched duo of lesbian ambulance drivers sometimes save lives, and sometimes not so much. Sassy, street-smart Taylor and her newbie, by-the-book partner Cate are constantly at odds with each other as they face the absurdity of life and death head on. But in their clash of wits, sparks fly, and they quickly cross a line by having sex whenever a patient dies (it's like eating a bucketload of delicious greasy chicken to balance out a bad salad). I",
    "genre": "",
    "release_year": "2023"
  },
  {
    "title": "The First Purge",
    "synopsis": "To push the crime rate below one percent for the rest of the year, the New Founding Fathers of America test a sociological theory that vents aggression for one night in one isolated community. But when the violence of oppressors meets the rage of the others, the contagion will explode from the trial-city borders and spread across the nation.",
    "genre": "Horror, Action, Thriller",
    "release_year": "2018"
  },
  {
    "title": "Cars 3",
    "synopsis": "Blindsided by a new generation of blazing-fast racers, the legendary Lightning McQueen is suddenly pushed out of the sport he loves. To get back in the game, he will need the help of an eager young race technician with her own plan to win, inspiration from the late Fabulous Hudson Hornet, and a few unexpected turns. Proving that #95 isn't through yet will test the heart of a champion on Piston Cup Racing’s biggest stage!",
    "genre": "Family, Animation, Adventure, Comedy",
    "release_year": "2017"
  },
  {
    "title": "The Godfather Part III",
    "synopsis": "In the midst of trying to legitimize his business dealings in 1979 New York and Italy, aging mafia don, Michael Corleone seeks forgiveness for his sins while taking a young protege under his wing.",
    "genre": "Crime, Drama, Thriller",
    "release_year": "1990"
  },
  {
    "title": "Finding Nemo",
    "synopsis": "Nemo, an adventurous young clownfish, is unexpectedly taken from his Great Barrier Reef home to a dentist's office aquarium. It's up to his worrisome father Marlin and a friendly but forgetful fish Dory to bring Nemo home -- meeting vegetarian sharks, surfer dude turtles, hypnotic jellyfish, hungry seagulls, and more along the way.",
    "genre": "Animation, Family",
    "release_year": "2003"
  },
  {
    "title": "Mission: Impossible",
    "synopsis": "When Ethan Hunt, the leader of a crack espionage team whose perilous operation has gone awry with no explanation, discovers that a mole has penetrated the CIA, he's surprised to learn that he's the No. 1 suspect. To clear his name, Hunt now must ferret out the real double agent and, in the process, even the score.",
    "genre": "Adventure, Action, Thriller",
    "release_year": "1996"
  },
  {
    "title": "Spider-Man: Far From Home",
    "synopsis": "Peter Parker and his friends go on a summer trip to Europe. However, they will hardly be able to rest - Peter will have to agree to help Nick Fury uncover the mystery of creatures that cause natural disasters and destruction throughout the continent.",
    "genre": "Action, Adventure, Science Fiction",
    "release_year": "2019"
  },
  {
    "title": "Cinderella",
    "synopsis": "Cinderella has faith her dreams of a better life will come true. With help from her loyal mice friends and a wave of her Fairy Godmother's wand, Cinderella's rags are magically turned into a glorious gown and off she goes to the Royal Ball. But when the clock strikes midnight, the spell is broken, leaving a single glass slipper... the only key to the ultimate fairy-tale ending!",
    "genre": "Family, Fantasy, Animation, Romance",
    "release_year": "1950"
  },
  {
    "title": "Frozen II",
    "synopsis": "Elsa, Anna, Kristoff and Olaf head far into the forest to learn the truth about an ancient mystery of their kingdom.",
    "genre": "Family, Animation, Adventure, Comedy, Fantasy",
    "release_year": "2019"
  },
  {
    "title": "Bedspacer",
    "synopsis": "Janice's steamy obsession to imitate Lexi propels them to campus stardom. But dark secrets blur the lines between authenticity and seductive deception.",
    "genre": "Thriller, Drama",
    "release_year": "2024"
  },
  {
    "title": "Penoza: The Final Chapter",
    "synopsis": "The Black Widow is not dead ... Drug Queen Carmen van Walraven is hiding in Canada and leads an anonymous life there. One evening a colleague is harassed and Carmen helps her. In self-defense, she kills the perpetrator, is arrested and extradited to the Netherlands. While her children are in shock that their mother is still alive, there are also some people who still have to settle something with Carmen. Everyone is again dragged into an emotional rollercoaster. Carmen will now have deal with her past to save her family.",
    "genre": "Action, Crime, Thriller, Drama",
    "release_year": "2019"
  },
  {
    "title": "The Fabelmans",
    "synopsis": "Growing up in post-World War II era Arizona, young Sammy Fabelman aspires to become a filmmaker as he reaches adolescence, but soon discovers a shattering family secret and explores how the power of films can help him see the truth.",
    "genre": "Drama",
    "release_year": "2022"
  },
  {
    "title": "The Predator",
    "synopsis": "When a young boy accidentally triggers the universe's most lethal hunters' return to Earth, only a ragtag crew of ex-soldiers and a disgruntled scientist can prevent the end of the human race.",
    "genre": "Science Fiction, Action, Adventure",
    "release_year": "2018"
  },
  {
    "title": "Nowhere",
    "synopsis": "A young pregnant woman named Mia escapes from a country at war by hiding in a maritime container aboard a cargo ship. After a violent storm, Mia gives birth to the child while lost at sea, where she must fight to survive.",
    "genre": "Thriller, Drama",
    "release_year": "2023"
  },
  {
    "title": "I Saw the TV Glow",
    "synopsis": "Teenager Owen is just trying to make it through life in the suburbs when his classmate introduces him to a mysterious late-night TV show — a vision of a supernatural world beneath their own. In the pale glow of the television, Owen’s view of reality begins to crack.",
    "genre": "Drama, Horror",
    "release_year": "2024"
  },
  {
    "title": "Crooklyn",
    "synopsis": "From Spike Lee comes this vibrant semi-autobiographical portrait of a school-teacher, her stubborn jazz-musician husband and their five kids living in '70s Brooklyn.",
    "genre": "Comedy, Drama",
    "release_year": "1994"
  },
  {
    "title": "The Net",
    "synopsis": "Angela Bennett is a freelance software engineer who lives in a world of computer technology. When a cyber friend asks Bennett to debug a new game, she inadvertently becomes involved in a conspiracy that will soon turn her life upside down and make her the target of an assassination.",
    "genre": "Crime, Drama, Mystery, Thriller, Action",
    "release_year": "1995"
  },
  {
    "title": "The Equalizer",
    "synopsis": "McCall believes he has put his mysterious past behind him and dedicated himself to beginning a new, quiet life. But when he meets Teri, a young girl under the control of ultra-violent Russian gangsters, he can’t stand idly by – he has to help her. Armed with hidden skills that allow him to serve vengeance against anyone who would brutalize the helpless, McCall comes out of his self-imposed retirement and finds his desire for justice reawakened. If someone has a problem, if the odds are stacked against them, if they have nowhere else to turn, McCall will help. He is The Equalizer.",
    "genre": "Thriller, Action, Crime",
    "release_year": "2014"
  },
  {
    "title": "Shrek Forever After",
    "synopsis": "A bored and domesticated Shrek pacts with deal-maker Rumpelstiltskin to get back to feeling like a real ogre again, but when he's duped and sent to a twisted version of Far Far Away—where Rumpelstiltskin is king, ogres are hunted, and he and Fiona have never met—he sets out to restore his world and reclaim his true love.",
    "genre": "Comedy, Adventure, Fantasy, Animation, Family",
    "release_year": "2010"
  },
  {
    "title": "Extraction 2",
    "synopsis": "Tasked with extracting a family who is at the mercy of a Georgian gangster, Tyler Rake infiltrates one of the world's deadliest prisons in order to save them. But when the extraction gets hot, and the gangster dies in the heat of battle, his equally ruthless brother tracks down Rake and his team to Vienna, in order to get revenge.",
    "genre": "Action, Thriller",
    "release_year": "2023"
  },
  {
    "title": "Harry Potter and the Half-Blood Prince",
    "synopsis": "As Lord Voldemort tightens his grip on both the Muggle and wizarding worlds, Hogwarts is no longer a safe haven. Harry suspects perils may even lie within the castle, but Dumbledore is more intent upon preparing him for the final battle fast approaching. Together they work to find the key to unlock Voldemorts defenses and to this end, Dumbledore recruits his old friend and colleague Horace Slughorn, whom he believes holds crucial information. Even as the decisive showdown looms, romance blossoms for Harry, Ron, Hermione and their classmates. Love is in the air, but danger lies ahead and Hogwarts may never be the same again.",
    "genre": "Adventure, Fantasy",
    "release_year": "2009"
  },
  {
    "title": "Bohemian Rhapsody",
    "synopsis": "Singer Freddie Mercury, guitarist Brian May, drummer Roger Taylor and bass guitarist John Deacon take the music world by storm when they form the rock 'n' roll band Queen in 1970. Hit songs become instant classics. When Mercury's increasingly wild lifestyle starts to spiral out of control, Queen soon faces its greatest challenge yet – finding a way to keep the band together amid the success and excess.",
    "genre": "Music, Drama",
    "release_year": "2018"
  },
  {
    "title": "Parasite",
    "synopsis": "All unemployed, Ki-taek's family takes peculiar interest in the wealthy and glamorous Parks for their livelihood until they get entangled in an unexpected incident.",
    "genre": "Comedy, Thriller, Drama",
    "release_year": "2019"
  },
  {
    "title": "Dragon Ball: Mystical Adventure",
    "synopsis": "Master Roshi has succeeded at the one mission he valued most: to train Goku and Krillin to become ultimate fighters. So, he arranges for them to test their mettle at a competition hosted by Emperor Chiaotzu. Not everyone's playing by the rules, however, as a member of the ruler's household schemes to use the Dragonballs to extort money and power from the royal.",
    "genre": "Action, Animation",
    "release_year": "1988"
  },
  {
    "title": "The Casagrandes Movie",
    "synopsis": "On a birthday trip to Mexico, 12-year-old Ronnie Anne accidentally frees a demigod trapped in a mountain and needs her family's help to set things right.",
    "genre": "Animation, Comedy, Family",
    "release_year": "2024"
  },
  {
    "title": "The Coffee Table",
    "synopsis": "Jesus and María are a couple going through a difficult time in their relationship. Nevertheless, they have just become parents. To shape their new life, they decide to buy a new coffee table. A decision that will change their existence.",
    "genre": "Horror, Thriller, Comedy",
    "release_year": "2022"
  },
  {
    "title": "Fifty Shades Freed",
    "synopsis": "Believing they have left behind shadowy figures from their past, newlyweds Christian and Ana fully embrace an inextricable connection and shared life of luxury. But just as she steps into her role as Mrs. Grey and he relaxes into an unfamiliar stability, new threats could jeopardize their happy ending before it even begins.",
    "genre": "Drama, Romance",
    "release_year": "2018"
  },
  {
    "title": "Sisu",
    "synopsis": "When an ex-soldier who discovers gold in the Lapland wilderness tries to take the loot into the city, German soldiers led by a brutal SS officer battle him.",
    "genre": "Action, War, Adventure",
    "release_year": "2022"
  },
  {
    "title": "Spider-Man: Into the Spider-Verse",
    "synopsis": "Struggling to find his place in the world while juggling school and family, Brooklyn teenager Miles Morales is unexpectedly bitten by a radioactive spider and develops unfathomable powers just like the one and only Spider-Man. While wrestling with the implications of his new abilities, Miles discovers a super collider created by the madman Wilson \"Kingpin\" Fisk, causing others from across the Spider-Verse to be inadvertently transported to his dimension.",
    "genre": "Animation, Action, Adventure, Science Fiction",
    "release_year": "2018"
  },
  {
    "title": "Thelma",
    "synopsis": "A college student starts to experience extreme seizures. She soon learns that the violent episodes are a symptom of inexplicable abilities.",
    "genre": "Drama, Mystery, Thriller",
    "release_year": "2017"
  },
  {
    "title": "The Mist",
    "synopsis": "After a violent storm, a dense cloud of mist envelops a small Maine town, trapping artist David Drayton and his five-year-old son in a local grocery store with other people. They soon discover that the mist conceals deadly horrors that threaten their lives, and worse, their sanity.",
    "genre": "Horror, Science Fiction, Thriller",
    "release_year": "2007"
  },
  {
    "title": "Ordinary Angels",
    "synopsis": "In Louisville, Kentucky, hairdresser Sharon Stevens rallies the masses to help widowed father Ed Schmitt save his critically ill 5 year old daughter Michelle after their community is hit by a major snowstorm from the 1994 North American cold wave.",
    "genre": "Drama",
    "release_year": "2024"
  },
  {
    "title": "Twilight",
    "synopsis": "When Bella Swan moves to a small town in the Pacific Northwest, she falls in love with Edward Cullen, a mysterious classmate who reveals himself to be a 108-year-old vampire. Despite Edward's repeated cautions, Bella can't stay away from him, a fatal move that endangers her own life.",
    "genre": "Fantasy, Drama, Romance",
    "release_year": "2008"
  },
  {
    "title": "The Equalizer 2",
    "synopsis": "Robert McCall, who serves an unflinching justice for the exploited and oppressed, embarks on a relentless, globe-trotting quest for vengeance when his former partner is murdered.",
    "genre": "Action, Thriller, Crime",
    "release_year": "2018"
  },
  {
    "title": "Lights Out",
    "synopsis": "A drifting ex-soldier turns underground fighter with the help of a just-released ex-con, pitting him against corrupt cops and hired killers now gunning for him and all those he cares about.",
    "genre": "Action, Thriller",
    "release_year": "2024"
  },
  {
    "title": "Gold",
    "synopsis": "Kenny Wells, a modern-day prospector, hustler, and dreamer, is desperate for a lucky break. Left with few options, Wells teams up with an equally luckless geologist to execute a grandiose, last-ditch effort: to find gold deep in the uncharted jungle of Indonesia.",
    "genre": "Adventure, Drama, Thriller",
    "release_year": "2016"
  },
  {
    "title": "In the Land of Saints and Sinners",
    "synopsis": "In a remote Irish village, a damaged Finbar is forced to fight for redemption after a lifetime of sins, but what price is he willing to pay? In the land of saints and sinners, some sins can't be buried.",
    "genre": "Action, Thriller",
    "release_year": "2023"
  },
  {
    "title": "Blue Velvet",
    "synopsis": "Clean-cut Jeffrey Beaumont realizes his hometown is not so normal when he discovers a human ear in a field, the investigation soon catapulting him toward a disturbed nightclub singer and a drug-addicted sadist.",
    "genre": "Crime, Drama, Mystery, Thriller",
    "release_year": "1986"
  },
  {
    "title": "Hunted",
    "synopsis": "A stately home robbery takes an evil turn one night when a gang of young thieves are caught by the owners of the house and then hunted across the estate for the proprietor's entertainment.",
    "genre": "Action, Mystery, Thriller, Horror, Crime, Drama",
    "release_year": "2022"
  },
  {
    "title": "Allegiant",
    "synopsis": "Beatrice Prior and Tobias Eaton venture into the world outside of the fence and are taken into protective custody by a mysterious agency known as the Bureau of Genetic Welfare.",
    "genre": "Adventure, Science Fiction, Action, Mystery",
    "release_year": "2016"
  },
  {
    "title": "The Lord of the Rings: The Two Towers",
    "synopsis": "Frodo Baggins and the other members of the Fellowship continue on their sacred quest to destroy the One Ring--but on separate paths. Their destinies lie at two towers--Orthanc Tower in Isengard, where the corrupt wizard Saruman awaits, and Sauron's fortress at Barad-dur, deep within the dark lands of Mordor. Frodo and Sam are trekking to Mordor to destroy the One Ring of Power while Gimli, Legolas and Aragorn search for the orc-captured Merry and Pippin. All along, nefarious wizard Saruman awaits the Fellowship members at the Orthanc Tower in Isengard.",
    "genre": "Adventure, Fantasy, Action",
    "release_year": "2002"
  },
  {
    "title": "Casablanca",
    "synopsis": "In Casablanca, Morocco in December 1941, a cynical American expatriate meets a former lover, with unforeseen complications.",
    "genre": "Drama, Romance",
    "release_year": "1943"
  },
  {
    "title": "Spider-Man 3",
    "synopsis": "The seemingly invincible Spider-Man goes up against an all-new crop of villains—including the shape-shifting Sandman. While Spider-Man’s superpowers are altered by an alien organism, his alter ego, Peter Parker, deals with nemesis Eddie Brock and also gets caught up in a love triangle.",
    "genre": "Action, Adventure, Science Fiction",
    "release_year": "2007"
  },
  {
    "title": "Bright",
    "synopsis": "In an alternate present-day where magical creatures live among us, two L.A. cops become embroiled in a prophesied turf battle.",
    "genre": "Fantasy, Action, Thriller",
    "release_year": "2017"
  },
  {
    "title": "Cinderella",
    "synopsis": "When her father unexpectedly passes away, young Ella finds herself at the mercy of her cruel stepmother and her daughters. Never one to give up hope, Ella's fortunes begin to change after meeting a dashing stranger in the woods.",
    "genre": "Romance, Fantasy, Family, Drama",
    "release_year": "2015"
  },
  {
    "title": "Solaris",
    "synopsis": "A troubled psychologist is sent to investigate the crew of an isolated research station orbiting a bizarre planet.",
    "genre": "Drama, Science Fiction, Mystery",
    "release_year": "2002"
  },
  {
    "title": "Shang-Chi and the Legend of the Ten Rings",
    "synopsis": "Shang-Chi must confront the past he thought he left behind when he is drawn into the web of the mysterious Ten Rings organization.",
    "genre": "Action, Adventure, Fantasy",
    "release_year": "2021"
  }
]